Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.4.tar.gz/litegram-1.0.4/docs/locale/*/LC_MESSAGES/dispatcher/finite_state_machine/scene.po
Languages: ru

source: Scenes Wizard
ru: Майcтер сцен

source: This feature is experimental and may be changed in future versions.
ru: Дана фича является експериментальною, поэтому в наступних оновленнях может зминюватись.

source: **litegram's** basics API is easy to use and powerful, allowing the implementation of simple interactions such as triggering a command or message for a response. However, certain tasks require a dialogue between the user and the bot. This is where Scenes come into play.
ru: Базовий интерфейс **litegram**-в простий и мощный в використанни, что дозволяе реализувати простые взаемодии, такие как обробка команд или сообщений и видповидей. Однак деяки завдання вимагають поетапного диалогу между пользователем и ботом. Ось где сцени вступають в гру.

source: Understanding Scenes
ru: Що ж ике сцены?

source: A Scene in **litegram** is like an abstract, isolated namespace or room that a user can be ushered into via the code. When a user is within a Scene, most other global commands or message handlers are bypassed, unless they are specifically designed to function outside of the Scenes. This helps in creating an experience of focused interactions. Scenes provide a structure for more complex interactions, effectively isolating and managing contexts for different stages of the conversation. They allow you to control and manage the flow of the conversation in a more organized manner.
ru: Сцена в **litegram** схожа на абстрактний, изольований простир имен или кимнату, к которой пользователь может потрапити с помощью коду. Коли пользователь перебувае в межах Сцени, бильшисть других глобальних команд или обработчиков сообщений пропускаються, если только вони не призначени для роботи поза Сценами.Сцени забезпечують структуру для бильш складних взаемодий, ефективно изолюючи и керуючи контекстами для ризних етапив розмови. Вони дозволяють бильш организовано контролювати и керувати розмовою.

source: Scene Lifecycle
ru: Життевий цикл

source: Scene Listeners
ru: Слухачи событий

source: Scenes have their own hooks which are command or message listeners that only act while the user is within the Scene. These hooks react to user actions while the user is 'inside' the Scene, providing the responses or actions appropriate for that context. When the user is ushered from one Scene to another, the actions and responses change accordingly as the user is now interacting with the set of listeners inside the new Scene. These 'Scene-specific' hooks or listeners, detached from the global listening context, allow for more streamlined and organized bot-user interactions.
ru: Сцени мають власни хуки, которые является слухачами команд или сообщений, которые диють только тогда, когда пользователь знаходиться всередини сцени. Ци хуки реагують на действия пользователя, когда пользователь перебувае «всередини» Сцени, предоставляя видповиди или действия, видповидни этому контексту. Коли пользователь переходить от одниеи сцени к иншои, действия и видповиди видповидно зминюються, оскильки пользователь теперь взаемодие с групою слухачив в новий сцени. Ци «специфични для сцени» хуки или слухачи, видирвани от глобального контексту прослуховування, дозволяють бильш оптимизовану и организовану взаемодию бот-пользователь.

source: Scene Interactions
ru: Взаемодия

source: Each Scene is like a self-contained world, with interactions defined within the scope of that Scene. As such, only the handlers defined within the specific Scene will react to user's input during the lifecycle of that Scene.
ru: Кожна сцена схожа на самодостатний свит из взаемодиями, визначеними в межах этой сцени. Таким чином, только обробники, визначени в конкретний сцени, реагуватимуть на введення пользователя протягом життевого циклу этой сцени.

source: Scene Benefits
ru: Переваги

source: Scenes can help manage more complex interaction workflows and enable more interactive and dynamic dialogs between the user and the bot. This offers great flexibility in handling multi-step interactions or conversations with the users.
ru: Сцени могут допомогти керувати бильш складними робочими процесами взаемодии и забезпечити бильш интерактивни и динамични диалоги между пользователем и ботом. Це обеспечивает велику гнучкисть в обробци багатоетапних взаемодий или розмов с користувачами.

source: How to use Scenes
ru: Как это использовать?

source: For example we have a quiz bot, which asks the user a series of questions and then displays the results.
ru: Например, в нас является тестовий бот, который задае користувачеви серию запитань, а потим видображае результати - назвемо его гра-викторина.

source: Lets start with the data models, in this example simple data models are used to represent the questions and answers, in real life you would probably use a database to store the data.
ru: Почнемо с моделей данных. У этому примеры простые модели данных використовуються для представлення запитань и видповидей, в реальному житти вы, ймовирно, використовували б базу данных для хранения данных.

source: Questions list
ru: Запииння

source: Then, we need to create a Scene class that will represent the quiz game scene:
ru: Затем нам потрибно створити клас Scene, который представлятиме сцену викторини:

source: Keyword argument passed into class definition describes the scene name - is the same as state of the scene.
ru: Іменований аргумент, переданий в визначення класу, описуе имя сцени - те саме, что стан сцени.

source: Quiz Scene
ru: Сэтона викторини

source: Also we need to define a handler that helps to start the quiz game:
ru: Також нам потрибно визначити обробник, который поможетт запустити викторину:

source: Start command handler
ru: Обробник для запуску викторини

source: Once the scene is defined, we need to register it in the SceneRegistry:
ru: Писля визначення сцены нам потрибно зарееструвати ии в SceneRegistry:

source: Registering the scene
ru: Реестрация сцены

source: So, now we can implement the quiz game logic, each question is sent to the user one by one, and the user's answer is checked at the end of all questions.
ru: Отже, теперь ми можемо реализувати логику гри-викторини, кожне запитання надсилаеться користувачеви одне за одним, а ответ пользователя перевиряеться в кинци всех запитань.

source: Now we need to write an entry point for the question handler:
ru: Тепер нам потрибно написати точку входу для обробника запиинь:

source: Question handler entry point
ru: Точка входу обробника запиинь

source: Once scene is entered, we should expect the user's answer, so we need to write a handler for it, this handler should expect the text message, save the answer and retake the question handler for the next question:
ru: Писля входу в сцену ми маемо очикувати видповиди пользователя, поэтому нам потрибно написати для неи обробник, этот обробник имеет очикувати текстове сообщения, зберегти ответ и повторно виконати обробник запитання для наступного запитання:

source: Answer handler
ru: Обробник ответов

source: When user answer with unknown message, we should expect the text message again:
ru: Коли пользователь видповидае невидомим повидомленням, ми должны знову очикувати текстове сообщения:

source: Unknown message handler
ru: Невикмий обробник сообщений

source: When all questions are answered, we should show the results to the user, as you can see in the code below, we use `await self.wizard.exit()` to exit from the scene when questions list is over in the `QuizScene.on_enter` handler.
ru: Писля видповиди на все запитання ми маемо показати результати користувачеви, как вы можете бачити в коди нижче, ми використовуемо `await self.wizard.exit()`, чтобы вийти зи сцени, когда список запитань в `QuizScene» закинчено .on_enter` обробник.

source: Thats means that we need to write an exit handler to show the results to the user:
ru: Це означае, что нам потрибно написати обробник виходу, чтобы показати результати користувачеви:

source: Show results handler
ru: Обробник показу результаттив

source: Also we can implement a actions to exit from the quiz game or go back to the previous question:
ru: Також ми можемо виконати действия для виходу с викторини или возврат к попереднього запитання:

source: Exit handler
ru: Обробник виходу

source: Back handler
ru: Обробник действия "повернутись"

source: Now we can run the bot and test the quiz game:
ru: Тепер ми можетмо запустити бота и протестувати гру-викторину:

source: Run the bot
ru: Запустить бота

source: Complete them all
ru: Зберемо все разом

source: Quiz Example
ru: Пример викторини

source: Components
ru: Компоненти

source: :class:`litegram.fsm.scene.Scene` - represents a scene, contains handlers
ru: :class:`litegram.fsm.scene.Scene` - представляет сцену, содержит обробники

source: :class:`litegram.fsm.scene.SceneRegistry` - container for all scenes in the bot, used to register scenes and resolve them by name
ru: :class:`litegram.fsm.scene.SceneRegistry` - контейнер для всех сцен в боти, використовуеться для реестрации сцен и их виришення за назвою

source: :class:`litegram.fsm.scene.ScenesManager` - manages scenes for each user, used to enter, leave and resolve current scene for user
ru: :class:`litegram.fsm.scene.ScenesManager` - керуе сценами для каждого пользователя, використовуеться для входу, виходу и виришення поточнои сцени для пользователя

source: :class:`litegram.fsm.scene.SceneConfig` - scene configuration, used to configure scene
ru: :class:`litegram.fsm.scene.SceneConfig` - конфигурация сцени, використовуеться для настройки сцени

source: :class:`litegram.fsm.scene.SceneWizard` - scene wizard, used to interact with user in scene from active scene handler
ru: :class:`litegram.fsm.scene.SceneWizard` - майстер сцени, который використовуеться для взаемодии с пользователем в сцени с активного обробника сцени

source: Markers - marker for scene handlers, used to mark scene handlers
ru: Markers - маркер для обработчиков сцен, використовуеться для позначення обработчиков сцен

source: Represents a scene in a conversation flow.
ru: Предсивляе крок в диалози.

source: A scene is a specific state in a conversation where certain actions can take place.
ru: Сэтона — это певний син розмови, где могут отбуватися певни действия.

source: Each scene has a set of filters that determine when it should be triggered, and a set of handlers that define the actions to be executed when the scene is active.
ru: Кожна сцена имеет набир фильтрив, которые визначають, когда вона имеет бути запущена, и набир обработчиков, которые визначають действия, которые мають виконуватися, когда сцена активна.

source: This class is not meant to be used directly. Instead, it should be subclassed to define custom scenes.
ru: Этот клас не призначений для безпосереднього використання. Замисть этого следует створити пидкласи для визначення власних сцен.

source: Adds the scene to the given router.
ru: Додае сцену к заданого маршрутизатора.

source: Parameters
ru: Параметры

source: Returns
ru: Возвращает

source: Create an entry point handler for the scene, can be used to simplify the handler that starts the scene.
ru: Створить обробник точки входу для сцени, который можна использовать для спрощення обробника, который запускае сцену.

source: new router
ru: новий роутер

source: A class that represents a registry for scenes in a Telegram bot.
ru: Клас, который представляет реестр для сцен.

source: This method adds the specified scenes to the registry and optionally registers it to the router.
ru: Этот метод додае вказани сцени к реестру и додатково рееструе их на маршрутизатори.

source: If a scene with the same state already exists in the registry, a SceneException is raised.
ru: Якщо сцена с таким самим станом уже существует в реестри, виникае SceneException.

source: A variable length parameter that accepts one or more types of scenes. These scenes are instances of the Scene class.
ru: Параметр зминнои довжини, который принимает один или килька типов сцен. Ци сцени является екземплярами класу Scene.

source: An optional parameter that specifies the router to which the scenes should be added.
ru: Додатковий параметр, который визначае маршрутизатор, к которого следует додати сцени.

source: If the specified scene is not registered in the SceneRegistry object, a SceneException will be raised.
ru: Якщо вказану сцену не зареестровано в объекти SceneRegistry, буде породжено помилку SceneException.

source: The registered Scene object corresponding to the given scene parameter.
ru: Зареестрований объект Scene, что ответие даному параметру сцены.

source: Registers one or more scenes to the SceneRegistry.
ru: Рееструе одну или килька сцен в SceneRegistry.

source: One or more scene classes to register.
ru: Один или килька класив сцен для реестрации.

source: The ScenesManager class is responsible for managing scenes in an application. It provides methods for entering and exiting scenes, as well as retrieving the active scene.
ru: Клас ScenesManager видповидае за керування сценами в програми. Он предоставляет методы входу и виходу зи сцен, а також видновлення активнои сцени.

source: Close method is used to exit the currently active scene in the ScenesManager.
ru: Метод Close використовуеться для виходу с поточнои активнои сцени в ScenesManager.

source: Additional keyword arguments passed to the scene's exit method.
ru: Додаткови аргументи ключового слова, передани в метод виходу сцены.

source: Enters the specified scene.
ru: Виходить на вказану сцену.

source: Optional bool indicating whether to check if there is an active scene to exit before entering the new scene. Defaults to True.
ru: Необов’язковий параметр, что вказуе, чи перевиряти наявнисть активнои сцени для виходу перед входом в нову сцену. За замовчуванням значение True.

source: Additional keyword arguments to pass to the scene's wizard.enter() method.
ru: Додаткови именованные аргументи для передачи в метод wizard.enter() сцены.

source: Scene actions
ru: Дии сцены

source: Allow callback query without state
ru: Створювати обробники кнопок без проверки сину поточнои сцены

source: Scene handlers
ru: Обробники сцены

source: Reset scene data on enter
ru: Скинути дани сцены после входу

source: Reset scene history on enter
ru: Скинути историю сцены во время входу

source: Scene state
ru: Син сцены

source: A class that represents a wizard for managing scenes in a Telegram bot.
ru: Клас, который представляет майстер сцен.

source: Instance of this class is passed to each scene as a parameter. So, you can use it to transition between scenes, get and set data, etc.
ru: Екземпляр этого класу передаеться кожний сцени как параметр. Отже, вы можете использовать его для переходу между сценами, отримання и встановлення данных и т.д..

source: This class is not meant to be used directly. Instead, it should be used as a parameter in the scene constructor.
ru: Этот клас не призначений для безпосереднього використання. Натомисть его следует использовать как параметр в конструктори сцени.

source: This method is used to go back to the previous scene.
ru: Этот метод використовуеться для возврат к попередньои сцены.

source: Keyword arguments that can be passed to the method.
ru: Аргументи ключових слив, которые можна передати в метод.

source: Clears the data.
ru: Очищае дани.

source: Enter method is used to transition into a scene in the SceneWizard class. It sets the state, clears data and history if specified, and triggers entering event of the scene.
ru: Метод Enter використовуеться для переходу в сцену в класи SceneWizard. Он встановлюе стан, очищае дани и историю, если вказано, и запускае введення подии сцени.

source: Additional keyword arguments.
ru: Додаткови именованные аргументи.

source: Exit the current scene and enter the default scene/state.
ru: Вийти с поточнои сцены и перейти к синдартного сину чи сцены.

source: This method returns the data stored in the current state.
ru: Этот метод поверие дани, что зберигаються в поточному сини.

source: A dictionary containing the data stored in the scene state.
ru: Словник, что содержит дани, что зберигаються в сини сцены.

source: The `goto` method transitions to a new scene. It first calls the `leave` method to perform any necessary cleanup in the current scene, then calls the `enter` event to enter the specified scene.
ru: Метод `goto` переходить к новои сцени. Спочатку вин викликае метод `leave`, чтобы виконати будь-которое необхидне очищення в поточний сцени, а потим викликае подию `enter`, чтобы увийти к вказанои сцени.

source: Additional keyword arguments to pass to the `enter` method of the scene manager.
ru: Додаткови именованные аргументи для точки входу к `enter` менеджера сцен.

source: Leaves the current scene. This method is used to exit a scene and transition to the next scene.
ru: Залишае поточну сцену. Этот метод використовуеться для виходу зи сцени и переходу к наступнои сцени.

source: Whether to include history in the snapshot. Defaults to True.
ru: Чи включати историю в знимок. За замовчуванням значение True.

source: This method allows to re-enter the current scene.
ru: Этот метод кзволяе повторно увийти к поточнои сцены.

source: Additional keyword arguments to pass to the scene.
ru: Додаткови именованные аргументи для передачи к сцены.

source: Sets custom data in the current state.
ru: Всиновлюе настроювани дани в поточний син.

source: This method updates the data stored in the current state
ru: Этот метод оновлюе дани, что зберигаються в поточному сини

source: Additional key-value pairs of data to update.
ru: Додаткови пари ключ-значение данных для обновления.

source: Dictionary of updated data
ru: Словник оновлених данных

source: Markers
ru: Маркери

source: Markers are similar to the Router event registering mechanism, but they are used to mark scene handlers in the Scene class.
ru: Маркери подибни к механизму реестрации событий Router, але вони використовуються для позначення обработчиков сцени в класи Scene.

source: It can be imported from :code:`from litegram.fsm.scene import on` and should be used as decorator.
ru: Его можна импортувати с :code:`from litegram.fsm.scene import on` и следует использовать как декоратор.

source: Allowed event types:
ru: Дозволени типы событий:

source: Each event type can be filtered in the same way as in the Router.
ru: Кожен тип подии можна отфильтрувати ик само, как и в маршрутизатори.

source: Also each event type can be marked as scene entry point, exit point or leave point.
ru: Також каждый тип подии можна позначити как точку входу в сцену, точку виходу или точку переходу.

source: If you want to mark the scene can be entered from message or inline query, you should use :code:`on.message` or :code:`on.inline_query` marker:
ru: Если вы хотите позначити, что к сцени можна потрапити с сообщения или ин-лайн кнопки, вам следует использовать маркер :code:`on.message` или :code:`on.inline_query`:

source: enter point - when user enters to the scene
ru: Точка входу - когда пользователь входить к сцены

source: leave point - when user leaves the scene and the enter another scene
ru: Точка переходу - когда пользователь переходить к иншои сцены

source: exit point - when user exits from the scene
ru: Точка виходу - когда пользователь завершуе сцену
