Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.7.tar.gz/litegram-1.0.7/docs/locale/*/LC_MESSAGES/migration_2_to_3.po
Languages: ru

source: Migration FAQ (2.x -> 3.0)
ru: FAQ по переходу с версии 2.x на 3.0

source: This guide is still in progress.
ru: Этот посибник все еще в разработке.

source: This version introduces numerous breaking changes and architectural improvements. It helps reduce the count of global variables in your code, provides useful mechanisms to modularize your code, and enables the creation of shareable modules via packages on PyPI. It also makes middlewares and filters more controllable, among other improvements.
ru: Ця версия содержит численни суттеви змини и архитектурни покращення. Вона допомагае зменшити килькисть глобальних зминних в вашому коди, предоставляет корисни механизми для модуляризации вашого коду и дозволяе створювати спильни модули с помощью пакетив на PyPI. Крим того, серед других покращень, вин робить промижне програмне забезпечення (мидлвари) и фильтри бильш контрольованими.

source: On this page, you can read about the changes made in relation to the last stable 2.x version.
ru: На ций сторинци вы можете прочитать о змини, внесени в останню стабильну версию 2.x.

source: This page more closely resembles a detailed changelog than a migration guide, but it will be updated in the future.
ru: Ця сторинка больше нагадуе детальний список змин, ниж посибник с миграции, але вона буде оновлюватися в майбутньому.

source: Feel free to contribute to this page, if you find something that is not mentioned here.
ru: Не соромтеся зробити свий внесок в цю сторинку, если вы знайшли что-то, о что здесь не згадано.

source: Dependencies
ru: Залежности

source: The dependencies required for :code:`i18n` are no longer part of the default package. If your application uses translation functionality, be sure to add an optional dependency:
ru: Залежности, необхидни для :code:`i18n`, больше не является частиною пакету по умолчанию. Якщо ваш кдаток використовуе функциональнисть перекладу, обов'язково кдайте необов'язкову залежнисть:

source: Dispatcher
ru: Диспетчер

source: The |Dispatcher| class no longer accepts a |Bot| instance in its initializer. Instead, the |Bot| instance should be passed to the dispatcher only for starting polling or handling events from webhooks. This approach also allows for the use of multiple bot instances simultaneously ("multibot").
ru: Клас :class:`Dispatcher` больше не принимает екземпляр `Bot` в своему инициализатори. Замисть этого екземпляр `Bot` следует передавати диспетчеру только для запуску полингу или обработки событий с вебхукив. Такий пидхид також дозволяе использовать декилька екземплярив бота одночасно ("мультибот").

source: |Dispatcher| now can be extended with another Dispatcher-like thing named |Router|. With routes, you can easily modularize your code and potentially share these modules between projects. (:ref:`Read more » <Nested routers>`.)
ru: Клас :class:`Dispatcher` теперь можна розширити еще одним объектом на кшталт диспетчера с назвою :class:`Router` (:ref:`Детальнише » <Nested routers>`).

source: Removed the **_handler** suffix from all event handler decorators and registering methods. (:ref:`Read more » <Event observers>`)
ru: Видалено суфикс **_handler** с всех декораторив обработчиков событий и методив реестрации. (:ref:`Детальнише » <Event observers>`)

source: The :class:`Executor` has been entirely removed; you can now use the |Dispatcher| directly to start poll the API or handle webhooks from it.
ru: Executor було полностью вилучено; теперь вы можете использовать Dispatcher непосредственно для запуску полингу или обработки вебхукив.

source: The throttling method has been completely removed; you can now use middlewares to control the execution context and implement any throttling mechanism you desire.
ru: Метод дроселювання (Throttling) полностью вилучено; теперь вы можете использовать промижне програмне забезпечення (middleware) для керування контекстом виконання и реализовувати будь-который механизм дроселювання за вашим бажанням.

source: Removed global context variables from the API types, |Bot| and |Dispatcher| object. From now on, if you want to access the current bot instance within handlers or filters, you should accept the argument :code:`bot: Bot` and use it instead of :code:`Bot.get_current()`. In middlewares, it can be accessed via :code:`data["bot"]`.
ru: Вилучено глобальни контекстни зминни с типов API, объектив Bot и Dispatcher, Видтепер, если вы хотите получить доступ к текущего екземпляру бота в обробниках или фильтрах, вы должны приймати аргумент :code:`bot: Bot` и использовать его вместо :code:`Bot.get_current()`. У промижному програмному забезпеченни (middleware) доступ к нього можна получить через :code:`data["bot"]`.

source: Filtering events
ru: Фильтрация событий

source: Keyword filters can no longer be used; use filters explicitly. (`Read more » <https://github.com/litegram/litegram/issues/942>`_)
ru: Фильтри за ключовими словами больше не можна использовать; используйте фильтри явно. (`Детальнише » <https://github.com/litegram/litegram/issues/942>`_)

source: Due to the removal of keyword filters, all previously enabled-by-default filters (such as state and content_type) are now disabled. You must specify them explicitly if you wish to use them. For example instead of using :code:`@dp.message_handler(content_types=ContentType.PHOTO)` you should use :code:`@router.message(F.photo)`
ru: У зв'язку с вилученням keyword фильтрив, все раньше ввимкнени за замовчуванням фильтри (такие как state и content_type) теперь вимкнено. Якщо вы бажаете их использовать, вы должны указать их явно. Например, вместо :code:`@dp.message_handler(content_types=ContentType.PHOTO)` следует использовать :code:`@router.message(F.photo)`.

source: By default, the message handler now receives any content type. If you want a specific one, simply add the appropriate filters (Magic or any other).
ru: За замовчуванням обробник сообщений теперь отримуе будь-который тип содержимого. Якщо вам потрибен певний тип, просто додайте видповидни фильтри (Magic или будь-который инший).

source: The state filter is no longer enabled by default. This means that if you used :code:`state="*"` in v2, you should not pass any state filter in v3. Conversely, if the state was not specified in v2, you will now need to specify it in v3.
ru: Фильтр стану больше не вмикаеться по умолчанию. Це означае, что если вы використовували :code:`state="*"` в v2, вам не следует передавати фильтр стану в v3. І навпаки, если стан не було вказано в v2, вам потрибно буде указать его в v3.

source: Added the possibility to register global filters for each router, which helps to reduce code repetition and provides an easier way to control the purpose of each router.
ru: Додано можливисть реестрации глобальних фильтрив для каждого роутера, что допомагае зменшити повторення коду и полегшуе контроль назначения каждого роутера.

source: All API methods are now classes with validation, implemented via `pydantic <https://docs.pydantic.dev/>`. These API calls are also available as methods in the Bot class.
ru: Вси методы API теперь является класами с валидациею, реализованими через `pydantic <https://docs.pydantic.dev/>`. Ци виклики API також доступни как методы в класи Bot.

source: More pre-defined Enums have been added and moved to the `litegram.enums` sub-package. For example, the chat type enum is now :class:`litegram.enums.ChatType` instead of :class:`litegram.types.chat.ChatType`.
ru: Додано больше попередньо визначених enums и перемищено их к пидпакету `litegram.enums`. Например, enum типа чату теперь имеет вигляд :class:`litegram.enums.ChatType` вместо :class:`litegram.types.chat.ChatType`.

source: The HTTP client session has been separated into a container that can be reused across different Bot instances within the application.
ru: Клиентська сесия HTTP була видокремлена в контейнер, который можна повторно использовать для ризних екземплярив бота в додатку.

source: API Exceptions are no longer classified by specific messages, as Telegram has no documented error codes. However, all errors are classified by HTTP status codes, and for each method, only one type of error can be associated with a given code. Therefore, in most cases, you should check only the error type (by status code) without inspecting the error message.
ru: Виключення API больше не класификуються за конкретними повидомленнями, оскильки Telegram не имеет задокументованих кодив помилок. Проте все помилки класификуються за кодами статусу HTTP, и для каждого методу с певним кодом может бути пов'язаний только один тип помилки. Тому в бильшости випадкив следует перевиряти только тип помилки (за кодом статусу), не перевиряючи сообщения о помилку.

source: Middlewares
ru: Промеждуне ПО (Middlewares)

source: Middlewares can now control an execution context, e.g., using context managers. (:ref:`Read more » <middlewares>`)
ru: Промижне програмне забезпечення теперь может керувати контекстом виконання, например, с помощью менеджерив контексту. (:ref:`Детальнише » <middlewares>`)

source: All contextual data is now shared end-to-end between middlewares, filters, and handlers. For example now you can easily pass some data into context inside middleware and get it in the filters layer as the same way as in the handlers via keyword arguments.
ru: Вси контекстни дани теперь наскризно використовуються между промижним програмним забезпеченням, фильтрами и обробниками. Например, теперь вы можете легко передати деяки дани в контекст в промижному програмному забезпеченни и получить их в шари фильтрив так же, как и в обробниках через аргументи ключових слив.

source: Added a mechanism named **flags** that helps customize handler behavior in conjunction with middlewares. (:ref:`Read more » <flags>`)
ru: Додано механизм с назвою **flags**, который допомагае налаштовувати повединку обробника в поеднанни с промижним програмним забезпеченням. (:ref:`Детальнише о » <flags>`)

source: Keyboard Markup
ru: Розмитка клавиатуры

source: Now :class:`litegram.types.inline_keyboard_markup.InlineKeyboardMarkup` and :class:`litegram.types.reply_keyboard_markup.ReplyKeyboardMarkup` no longer have methods for extension, instead you have to use markup builders :class:`litegram.utils.keyboard.ReplyKeyboardBuilder` and :class:`litegram.utils.keyboard.KeyboardBuilder` respectively (:ref:`Read more » <Keyboard builder>`)
ru: Тепер :class:`litegram.types.inline_keyboard_markup.InlineKeyboardMarkup` и :class:`litegram.types.reply_keyboard_markup.ReplyKeyboardMarkup` больше не мають методив для розширення, натомисть вам следует использовать будивники розмитки :class:`litegram.utils.keyboard.ReplyKeyboardBuilder` и :class:`litegram.utils.keyboard.InlineKeyboardBuilder` видповидно (:ref:`Детальнише » <Keyboard builder>`)

source: Callbacks data
ru: Дани зворотного виклику

source: The callback data factory is now strictly typed using `pydantic <https://docs.pydantic.dev/>`_ models. (:ref:`Read more » <Callback data factory>`)
ru: Фабрику данных зворотного виклику теперь строго типизовано с помощью моделей `pydantic <https://docs.pydantic.dev/>`_. (:ref:`Детальнише » <Callback data factory>`)

source: Finite State machine
ru: Скинченний автомат

source: State filters will no longer be automatically added to all handlers; you will need to specify the state if you want to use it.
ru: Фильтри станив больше не будуть автоматически додаватися к всех обработчиков; вам потрибно буде указать стан, если вы хотите его використати.

source: Added the possibility to change the FSM strategy. For example, if you want to control the state for each user based on chat topics rather than the user in a chat, you can specify this in the |Dispatcher|.
ru: Додано можливисть изменять стратегию FSM. Например, если вы хотите контролювати стан для каждого пользователя на основи топикив чату, а не пользователя в чати, вы можете указать это в Диспетчери.

source: The state proxy is deprecated; you should update the state data by calling :code:`state.set_data(...)` and :code:`state.get_data()` respectively.
ru: Прокси стану является застарилим; вам следует оновити дани стану, викликавши :code:`state.set_data(...)` и :code:`state.get_data()` видповидно.

source: Sending Files
ru: Надсилання файлов

source: From now on, you should wrap files in an InputFile object before sending them, instead of passing the IO object directly to the API method. (:ref:`Read more » <sending-files>`)
ru: Видтепер перед видправкою файлов следует обертати их в объект InputFile вместо того, чтобы передавати объект вводу-виводу непосредственно к методу API. (:ref:`Детальнише » <sending-files>`)

source: Webhook
ru: Вебхук

source: The httpx web app configuration has been simplified.
ru: Спрощено настройки веб-застосунку httpx.

source: By default, the ability to upload files has been added when you `make requests in response to updates <https://core.telegram.org/bots/faq#how-can-i-make-requests-in-response-to-updates>`_ (available for webhook only).
ru: За замовчуванням кдана можливисть скачивание файлов при `ответях на обновления <https://core.telegram.org/bots/faq#how-can-i-make-requests-in-response-to-updates>`_ (доступно только для вебхука).

source: Telegram API Server
ru: Сервер Telegram API

source: Telegram objects transformation (to dict, to json, from json)
ru: Перетворення объектив Telegram (в словник, в json, с json)

source: Methods :code:`TelegramObject.to_object()`, :code:`TelegramObject.to_json()` and :code:`TelegramObject.to_python()` have been removed due to the use of `pydantic <https://docs.pydantic.dev/>`_ models.
ru: Методи :code:`TelegramObject.to_object()`, :code:`TelegramObject.to_json()` и :code:`TelegramObject.to_python()` були вилучени через викорисиння моделей `pydantic <https://docs.pydantic.dev/>`_.

source: :code:`TelegramObject.to_object()` should be replaced by :code:`TelegramObject.model_validate()` (`Read more <https://docs.pydantic.dev/2.7/api/base_model/#pydantic.BaseModel.model_validate>`_)
ru: :code:`TelegramObject.to_object()` следует заминити на :code:`TelegramObject.model_validate()` (`Детальнише <https://docs.pydantic.dev/2.7/api/base_model/#pydantic.BaseModel.model_validate>`_)

source: :code:`TelegramObject.as_json()` should be replaced by :func:`litegram.utils.serialization.deserialize_telegram_object_to_python`
ru: :code:`TelegramObject.as_json()` следует заминити на :func:`litegram.utils.serialization.deserialize_telegram_object_to_python`

source: :code:`<TelegramObject>.to_python()` should be replaced by :code:`json.dumps(deserialize_telegram_object_to_python(<TelegramObject>))`
ru: :code:`<TelegramObject>.to_python()` следует заминити на :code:`json.dumps(deserialize_telegram_object_to_python(<TelegramObject>))`

source: Here are some usage examples:
ru: Ось деяки примеры викорисиння:

source: Creating an object from a dictionary representation of an object
ru: Створення об'еки с предсивлення об'еки в вигляди словника

source: Creating a json representation of an object
ru: Cтворення предсивлення об'еки в вигляди json

source: Creating a dictionary representation of an object
ru: Створення предсивлення об'еки в вигляди словника

source: ChatMember tools
ru: Інструменти ChatMember

source: Now :class:`litegram.types.chat_member.ChatMember` no longer contains tools to resolve an object with the appropriate status.
ru: Тепер :class:`litegram.types.chat_member.ChatMember` больше не содержит инструментив для виришення объекта с видповидним статусом.

source: Now :class:`litegram.types.chat_member.ChatMember` and all its child classes no longer contain methods for checking for membership in certain logical groups. As a substitute, you can use pre-defined groups or create such groups yourself and check their entry using the :func:`isinstance` function
ru: Видтепер :class:`litegram.types.chat_member.ChatMember` и все его дочирни класи больше не мистять методив для проверки належности к певних логичних груп. Замисть этого вы можете использовать попередньо визначени групи или створювати такие групи самостийно и перевиряти их входження с помощью функции :func:`isinstance`

source: You also can independently create group similar to ADMINS that fits the logic of your application.
ru: Також вы можетте самостийно створити групу, подибну к ADMINS, которая ответие логици вашого застосунку.

source: E.g., you can create a PUNISHED group and include banned and restricted members there!
ru: Например, вы можетте створити групу PUNISHED и включити туди заблокованих и обмежених учасникив!
