Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.3-py3-none-any.whl/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: be, ca, el, es, fi, kk, kn, lv, mk, sv

source: Deactivate an active MFA method. Requires verification code from the method itself. Cannot deactivate primary methods - set another method as primary first.
be: Дэактываваць актыўны метад MFA. Патрабуе код верыфікацыі са самога метада. Немагчыма дэактываваць асноўныя метады - спачатку ўстанавіце іншы метад як асноўны.
ca: Desactiva un mètode MFA actiu. Requereix codi de verificació del mateix mètode. No es poden desactivar mètodes primaris - estableix primer un altre mètode com a primari.
el: Απενεργοποίηση μίας ενεργής μεθόδου MFA. Απαιτεί κωδικό επιβεβαίωσης από την ίδια τη μέθοδο. Δεν μπορεί να απενεργοποιήσει κύριες μεθόδους - ορίστε πρώτα άλλη μέθοδο ως κύρια.
es: Desactiva un método MFA activo. Requiere código de verificación del método mismo. No se pueden desactivar métodos primarios - establece otro método como primario primero.
fi: Poista aktiivinen MFA-menetelmä käytöstä. Vaatii vahvistuskoodin menetelmästä itsestään. Ei voi poistaa ensisijaisia menetelmiä käytöstä - aseta toinen menetelmä ensisijaiseksi ensin.
kk: Белсенді MFA әдісін өшіру. Әдістің өзінен растау кодын талап етеді. Негізгі әдістерді өшіру мүмкін емес - алдымен басқа әдісті негізгі ретінде орнатыңыз.
kn: ಸಕ್ರಿಯ MFA ವಿಧಾನವನ್ನು ನಿಷ್ಕ್ರಿಯಗೊಳಿಸಿ. ವಿಧಾನದಿಂದಲೇ ಪರಿಶೀಲನಾ ಕೋಡ್ ಅಗತ್ಯವಿದೆ. ಪ್ರಾಥಮಿಕ ವಿಧಾನಗಳನ್ನು ನಿಷ್ಕ್ರಿಯಗೊಳಿಸಲಾಗುವುದಿಲ್ಲ - ಮೊದಲು ಇನ್ನೊಂದು ವಿಧಾನವನ್ನು ಪ್ರಾಥಮಿಕವಾಗಿ ಹೊಂದಿಸಿ.
lv: Deaktivizēt aktīvu MFA metodi. Nepieciešams verifikācijas kods no pašas metodes. Nevar deaktivizēt primārās metodes - vispirms iestatiet citu metodi kā primāro.
mk: Деактивирај активна MFA метода. Бара код за верификација од самата метода. Не можат да се деактивираат примарни методи - прво постави друга метода како примарна.
sv: Inaktivera en aktiv MFA-metod. Kräver verifieringskod från metoden själv. Kan inte inaktivera primära metoder - ställ in en annan metod som primär först.

source: Set an active MFA method as the primary authentication method. Primary method is used by default during login flow.
be: Усталяваць актыўны метад MFA як асноўны метад аўтэнтыфікацыі. Асноўны метад выкарыстоўваецца па змаўчанні падчас патоку ўваходу.
ca: Estableix un mètode MFA actiu com a mètode d'autenticació primari. El mètode primari s'utilitza per defecte durant el flux d'inici de sessió.
el: Ορισμός μίας ενεργής μεθόδου MFA ως κύρια μέθοδος πιστοποίησης. Η κύρια μέθοδος χρησιμοποιείται εξ ορισμού κατά τη ροή σύνδεσης.
es: Establece un método MFA activo como el método de autenticación primario. El método primario se usa por defecto durante el flujo de inicio de sesión.
fi: Aseta aktiivinen MFA-menetelmä ensisijaiseksi tunnistautusmenetelmäksi. Ensisijaista menetelmää käytetään oletuksena kirjautumisprosessin aikana.
kk: Белсенді MFA әдісін негізгі аутентификация әдісі ретінде орнату. Негізгі әдіс кіру ағыны кезінде әдепкі бойынша пайдаланылады.
kn: ಸಕ್ರಿಯ MFA ವಿಧಾನವನ್ನು ಪ್ರಾಥಮಿಕ ದೃಢೀಕರಣ ವಿಧಾನವಾಗಿ ಹೊಂದಿಸಿ. ಲಾಗಿನ್ ಹರಿವಿನ ಸಮಯದಲ್ಲಿ ಪ್ರಾಥಮಿಕ ವಿಧಾನವನ್ನು ಡಿಫಾಲ್ಟ್ ಆಗಿ ಬಳಸಲಾಗುತ್ತದೆ.
lv: Iestatīt aktīvu MFA metodi kā primāro autentifikācijas metodi. Primārā metode tiek izmantota pēc noklusējuma pieteikšanās plūsmas laikā.
mk: Постави активна MFA метода како примарна метода за автентикација. Примарната метода се користи по стандард за време на протокот на најавување.
sv: Ställ in en aktiv MFA-metod som den primära autentiseringsmetoden. Primär metod används som standard under inloggningsflödet.

source: Only one method can be primary at a time.
be: Толькі адзін метад можа быць асноўным адначасова.
ca: Només un mètode pot ser primari a la vegada.
el: Μόνο μία μέθοδος μπορεί να είναι κύρια σε μία στιγμή.
es: Solo un método puede ser primario a la vez.
fi: Vain yksi menetelmä voi olla ensisijainen kerrallaan.
kk: Бір уақытта тек бір әдіс негізгі бола алады.
kn: ಒಂದು ಸಮಯದಲ್ಲಿ ಕೇವಲ ಒಂದು ವಿಧಾನವನ್ನು ಮಾತ್ರ ಪ್ರಾಥಮಿಕವಾಗಿಸಬಹುದು.
lv: Tikai viena metode var būt primārā vienlaicīgi.
mk: Само една метода може да биде примарна во исто време.
sv: Endast en metod kan vara primär åt gången.

source: Requires verification code from current primary method.
be: Патрабуе код верыфікацыі з бягучага асноўнага метада.
ca: Requereix codi de verificació del mètode primari actual.
el: Απαιτεί κωδικό επιβεβαίωσης από την τρέχουσα κύρια μέθοδο.
es: Requiere código de verificación del método primario actual.
fi: Vaatii vahvistuskoodin nykyisestä ensisijaisesta menetelmästä.
kk: Ағымдағы негізгі әдістен растау кодын талап етеді.
kn: ಪ್ರಸ್ತುತ ಪ್ರಾಥಮಿಕ ವಿಧಾನದಿಂದ ಪರಿಶೀಲನಾ ಕೋಡ್ ಅಗತ್ಯವಿದೆ.
lv: Nepieciešams verifikācijas kods no pašreizējās primārās metodes.
mk: Бара код за верификација од тековната примарна метода.
sv: Kräver verifieringskod från nuvarande primära metod.

source: Send verification code for methods that support code dispatch. Useful for testing method configuration or manual code requests.
be: Адправіць код верыфікацыі для метадаў, якія падтрымліваюць адпраўку кода. Карысна для тэсціравання канфігурацыі метада або ручных запытаў кода.
ca: Envia codi de verificació per a mètodes que suporten enviament de codi. Útil per provar la configuració del mètode o peticions manuals de codi.
el: Αποστολή κωδικού επιβεβαίωσης για μεθόδους που υποστηρίζουν αποστολή κωδικού. Χρήσιμο για δοκιμή ρύθμισης μεθόδου ή χειροκίνητες αιτήσεις κωδικού.
es: Envía código de verificación para métodos que soportan envío de código. Útil para probar configuración de método o solicitudes manuales de código.
fi: Lähetä vahvistuskoodi menetelmille, jotka tukevat koodin lähettämistä. Hyödyllinen menetelmän konfiguraation testaamiseen tai manuaalisiin koodipyyntöihin.
kk: Код жіберуді қолдайтын әдістер үшін растау кодын жіберу. Әдіс конфигурациясын тексеру немесе қолмен код сұрау үшін пайдалы.
kn: ಕೋಡ್ ಕಳುಹಿಸುವಿಕೆಯನ್ನು ಬೆಂಬಲಿಸುವ ವಿಧಾನಗಳಿಗೆ ಪರಿಶೀಲನಾ ಕೋಡ್ ಅನ್ನು ಕಳುಹಿಸಿ. ವಿಧಾನದ ಕಾನ್ಫಿಗರೇಶನ್ ಅನ್ನು ಪರೀಕ್ಷಿಸಲು ಅಥವಾ ಹಸ್ತಚಾಲಿತ ಕೋಡ್ ವಿನಂತಿಗಳಿಗೆ ಉಪಯುಕ್ತ.
lv: Sūtīt verifikācijas kodu metodēm, kas atbalsta koda nosūtīšanu. Noderīgi metodes konfigurācijas testēšanai vai manuāliem koda pieprasījumiem.
mk: Испрати код за верификација за методи кои поддржуваат испраќање код. Корисно за тестирање конфигурација на метода или мануелни барања за код.
sv: Skicka verifieringskod för metoder som stöder kodsändning. Användbart för testning av metodkonfiguration eller manuella kodförfrågningar.

source: Permanently delete an MFA method.
be: Канчаткова выдаліць метад MFA.
ca: Elimina permanentment un mètode MFA.
el: Μόνιμη διαγραφή μίας μεθόδου MFA.
es: Elimina permanentemente un método MFA.
fi: Poista MFA-menetelmä pysyvästi.
kk: MFA әдісін тұрақты жою.
kn: MFA ವಿಧಾನವನ್ನು ಶಾಶ್ವತವಾಗಿ ಅಳಿಸಿ.
lv: Neatgriezeniski dzēst MFA metodi.
mk: Трајно избриши MFA метода.
sv: Radera en MFA-metod permanent.

source: This action cannot be undone.
be: Гэта дзеянне нельга адмяніць.
ca: Aquesta acció no es pot desfer.
el: Αυτή η ενέργεια δεν μπορεί να αναιρεθεί.
es: Esta acción no se puede deshacer.
fi: Tätä toimintoa ei voi peruuttaa.
kk: Бұл әрекетті болдырмауға болмайды.
kn: ಈ ಕ್ರಿಯೆಯನ್ನು ರದ್ದುಪಡಿಸಲಾಗುವುದಿಲ್ಲ.
lv: Šo darbību nevar atsaukt.
mk: Ова дејство не може да се поништи.
sv: Denna åtgärd kan inte ångras.

source: Cannot delete active methods.
be: Нельга выдаліць актыўныя метады.
ca: No es poden eliminar mètodes actius.
el: Δεν μπορεί να διαγραφεί ενεργές μεθόδους.
es: No se pueden eliminar métodos activos.
fi: Ei voi poistaa aktiivisia menetelmiä.
kk: Белсенді әдістерді жою мүмкін емес.
kn: ಸಕ್ರಿಯ ವಿಧಾನಗಳನ್ನು ಅಳಿಸಲಾಗುವುದಿಲ್ಲ.
lv: Nevar dzēst aktīvas metodes.
mk: Не можат да се бришат активни методи.
sv: Kan inte radera aktiva metoder.

source: Cannot delete primary methods.
be: Нельга выдаліць асноўныя метады.
ca: No es poden eliminar mètodes primaris.
el: Δεν μπορεί να διαγραφεί κύριες μεθόδους.
es: No se pueden eliminar métodos primarios.
fi: Ei voi poistaa ensisijaisia menetelmiä.
kk: Негізгі әдістерді жою мүмкін емес.
kn: ಪ್ರಾಥಮಿಕ ವಿಧಾನಗಳನ್ನು ಅಳಿಸಲಾಗುವುದಿಲ್ಲ.
lv: Nevar dzēst primārās metodes.
mk: Не можат да се бришат примарни методи.
sv: Kan inte radera primära metoder.

source: Requires verification code for active methods.
be: Патрабуе код верыфікацыі для актыўных метадаў.
ca: Requereix codi de verificació per a mètodes actius.
el: Απαιτεί κωδικό επιβεβαίωσης για ενεργές μεθόδους.
es: Requiere código de verificación para métodos activos.
fi: Vaatii vahvistuskoodin aktiivisille menetelmille.
kk: Белсенді әдістер үшін растау кодын талап етеді.
kn: ಸಕ್ರಿಯ ವಿಧಾನಗಳಿಗೆ ಪರಿಶೀಲನಾ ಕೋಡ್ ಅಗತ್ಯವಿದೆ.
lv: Nepieciešams verifikācijas kods aktīvām metodēm.
mk: Бара код за верификација за активни методи.
sv: Kräver verifieringskod för aktiva metoder.

source: user
be: карыстальнік
ca: usuari
el: χρήστης
es: usuario
fi: käyttäjä
kk: пайдаланушы
kn: ಬಳಕೆದಾರ
lv: lietotājs
mk: корисник
sv: användare

source: User who owns this MFA method
be: Карыстальнік, які валодае гэтым метадам MFA
ca: Usuari que posseeix aquest mètode MFA
el: Χρήστης που κατέχει αυτή τη μέθοδο MFA
es: Usuario que posee este método MFA
fi: Käyttäjä, joka omistaa tämän MFA-menetelmän
kk: Осы MFA әдісінің иесі болған пайдаланушы
kn: ಈ MFA ವಿಧಾನವನ್ನು ಹೆಂದಿರುವ ಬಳಕೆದಾರ
lv: Lietotājs, kuram pieder šī MFA metode
mk: Корисник кој ја поседува оваа MFA метода
sv: Användare som äger denna MFA-metod

source: name
be: назва
ca: nom
el: όνομα
es: nombre
fi: nimi
kk: атауы
kn: ಹೆಸರು
lv: nosaukums
mk: име
sv: namn

source: MFA method name (e.g., 'app', 'email')
be: Назва метада MFA (напрыклад, 'app', 'email')
ca: Nom del mètode MFA (p. ex., 'app', 'email')
el: Όνομα μεθόδου MFA (π.χ., 'app', 'email')
es: Nombre del método MFA (ej., 'app', 'email')
fi: MFA-menetelmän nimi (esim. 'app', 'email')
kk: MFA әдісінің атауы (мысалы, 'app', 'email')
kn: MFA ವಿಧಾನದ ಹೆಸರು (ಉದಾಹರಣೆಗೆ, 'app', 'email')
lv: MFA metodes nosaukums (piem., 'app', 'email')
mk: Име на MFA метода (на пример, 'app', 'email')
sv: MFA-metodnamn (t.ex. 'app', 'email')

source: secret
be: сакрэт
el: μυστικό
es: secreto
fi: salaisuus
kk: құпия
kn: ಗುಪ್ತ
lv: noslēpums
mk: тајна
sv: hemlighet

source: TOTP secret key for generating verification codes
be: Сакрэтны ключ TOTP для генерацыі кодаў верыфікацыі
ca: Clau secreta TOTP per generar codis de verificació
el: Μυστικό κλειδί TOTP για τη δημιουργία κωδικών επιβεβαίωσης
es: Clave secreta TOTP para generar códigos de verificación
fi: TOTP-salaisuusavain vahvistuskoodien generointia varten
kk: Растау кодтарын жасау үшін TOTP құпия кілті
kn: ಪರಿಶೀಲನಾ ಕೋಡ್‌ಗಳನ್ನು ಉತ್ಪಾದಿಸುವುದಕ್ಕಾಗಿ TOTP ಗುಪ್ತ ಕೀಲಿ
lv: TOTP slepenais atslēga verifīkācijas kodu ģenerēšanai
mk: TOTP таен клуч за генерирање кодови за верификација
sv: TOTP hemlig nyckel för att generera verifieringskoder

source: is primary
be: асноўны
ca: és primari
el: είναι κύρια
es: es primario
fi: on ensisijainen
kk: негізгі
kn: ಪ್ರಾಥಮಿಕವಾಗಿದೆ
lv: ir primārs
mk: е примарна
sv: är primär

source: Whether this is the user's primary MFA method
be: Ці з'яўляецца гэта асноўным метадам MFA карыстальніка
ca: Si aquest és el mètode MFA primari de l'usuari
el: Αν αυτή είναι η κύρια μέθοδος MFA του χρήστη
es: Si este es el método MFA primario del usuario
fi: Onko tämä käyttäjän ensisijainen MFA-menetelmä
kk: Бұл пайдаланушының негізгі MFA әдісі бола ма
kn: ಇದು ಬಳಕೆದಾರರ ಪ್ರಾಥಮಿಕ MFA ವಿಧಾನವಾಗಿದೆಯಾ
lv: Vai šī ir lietotāja primārā MFA metode
mk: Дали ова е примарната MFA метода на корисникот
sv: Om detta är användarens primära MFA-metod

source: is active
be: актыўны
ca: és actiu
el: είναι ενεργή
es: está activo
fi: on aktiivinen
kk: белсенді
kn: ಸಕ್ರಿಯವಾಗಿದೆ
lv: ir aktīvs
mk: е активна
sv: är aktiv

source: Whether this method is active and can be used
be: Ці з'яўляецца гэты метад актыўным і можа быць выкарыстаны
ca: Si aquest mètode és actiu i es pot utilitzar
el: Αν αυτή η μέθοδος είναι ενεργή και μπορεί να χρησιμοποιηθεί
es: Si este método está activo y puede ser usado
fi: Onko tämä menetelmä aktiivinen ja käytettävissä
kk: Бұл әдіс белсенді болып, пайдаланылуы мүмкін бе
kn: ಈ ವಿಧಾನವು ಸಕ್ರಿಯವಾಗಿದೆ ಮತ್ತು ಬಳಕೆಯಾಗಬಹುದು
lv: Vai šī metode ir aktīva un var tikt izmantota
mk: Дали оваа метода е активна и може да се користи
sv: Om denna metod är aktiv och kan användas

source: backup codes
be: рэзервовыя коды
ca: codis de còpia de seguretat
el: κωδικοί εφεδρείας
es: códigos de respaldo
fi: varmuuskoodit
kk: резервті кодтар
kn: ಬ್ಯಾಕಪ್ ಕೋಡ್‌ಗಳು
lv: rezerves kodi
mk: резервни кодови
sv: reservkoder

source: JSON field storing backup codes for account recovery
be: Поле JSON для захоўвання рэзервовых кодаў для аднаўлення конта
ca: Camp JSON que emmagatzema codis de còpia de seguretat per a la recuperació del compte
el: Πεδίο JSON που αποθηκεύει κωδικούς εφεδρείας για ανάκτηση λογαριασμού
es: Campo JSON que almacena códigos de respaldo para recuperación de cuenta
fi: JSON-kenttä, joka tallentaa varmuuskoodeja tilin palautusta varten
kk: Есептік жазбаны қалпына келтіру үшін резервті кодтарды сақтайтын JSON өрісі
kn: ಖಾತೆಯ ಪುನರ್ಪಾದಿಸುವುದಕ್ಕಾಗಿ ಬ್ಯಾಕಪ್ ಕೋಡ್‌ಗಳನ್ನು ಸಂಗ್ರಹಿಸುವ JSON ಕ್ಷೇತ್ರ
lv: JSON lauks, kas glabā rezerves kodus konta atjaunošanai
mk: JSON поле кое ги чува резервните кодови за опоравување на сметка
sv: JSON-fält som lagrar reservkoder för kontoåterställning

source: MFA Method
be: Метад MFA
ca: Mètode MFA
el: Μέθοδος MFA
es: Método MFA
fi: MFA-menetelmä
kk: MFA әдісі
kn: MFA ವಿಧಾನ
lv: MFA metode
mk: MFA Метода
sv: MFA-metod

source: MFA Methods
be: Метады MFA
ca: Mètodes MFA
el: Μέθοδοι MFA
es: Métodos MFA
fi: MFA-menetelmät
kk: MFA әдістері
kn: MFA ವಿಧಾನಗಳು
lv: MFA metodes
mk: MFA Методи
sv: MFA-metoder

source: Invalid code
be: Няправільны код
ca: Codi invàlid
el: Μη έγκυρος κωδικός
es: Código inválido
fi: Virheellinen koodi
kk: Жарамсыз код
kn: ಅಮಾನ್ಯ ಕೋಡ್
lv: Nederīgs kods
mk: Невалиден код
sv: Ogiltig kod

source: Invalid token
be: Няправільны токен
ca: Token invàlid
el: Μη έγκυρο token
es: Token inválido
fi: Virheellinen tunniste
kk: Жарамсыз токен
kn: ಅಮಾನ್ಯ ಟೋಕನ್
lv: Nederīgs žetons
mk: Невалиден токен
sv: Ogiltig token

source: Please select a new method
be: Калі ласка, выберыце новы метад
ca: Si us plau, selecciona un nou mètode
el: Παρακαλώ επιλέξτε νέα μέθοδο
es: Por favor selecciona un nuevo método
fi: Valitse uusi menetelmä
kk: Жаңа әдісті таңдаңыз
kn: ದಯವಿಟ್ಟು ಹೊಸ ವಿಧಾನವನ್ನು ಆಯ್ಕೆ ಮಾಡಿ
lv: Lūdzu, izvēlieties jaunu metodi
mk: Ве молиме изберете нова метода
sv: Vänligen välj en ny metod

source: This method is already exists
be: Гэты метад ужо існуе
ca: Aquest mètode ja existeix
el: Αυτή η μέθοδος υπάρχει ήδη
es: Este método ya existe
fi: Tämä menetelmä on jo olemassa
kk: Бұл әдіс әлдеқашан бар
kn: ಈ ವಿಧಾನ ಈಗಾಗಲೇ ಅಸ್ತಿತ್ವದಲ್ಲಿದೆ
lv: Šī metode jau eksistē
mk: Оваа метода веќе постои
sv: Denna metod finns redan

source: Invalid OTP code
be: Няправільны OTP-код
ca: Codi OTP invàlid
el: Μη έγκυρος κωδικός OTP
es: Código OTP inválido
fi: Virheellinen OTP-koodi
kk: Жарамсыз OTP коды
kn: ಅಮಾನ್ಯ OTP ಕೋಡ್
lv: Nederīgs OTP kods
mk: Невалиден OTP код
sv: Ogiltig OTP-kod

source: Activated MFA method
be: Актываваны метад MFA
ca: Mètode MFA activat
el: Ενεργοποιήθηκε η μέθοδος MFA
es: Método MFA activado
fi: MFA-menetelmä aktivoitu
kk: MFA әдісі белсендірілді
kn: MFA ವಿಧಾನ ಸಕ್ರಿಯಗೊಳಿಸಲಾಗಿದೆ
lv: Aktivizēta MFA metode
mk: Активирана MFA метода
sv: Aktiverad MFA-metod

source: You can only deactivate non-primary MFA method.
be: Вы можаце дэактываваць толькі неасноўны метад MFA.
ca: Només pots desactivar mètodes MFA no primaris.
el: Μπορείτε να απενεργοποιήσετε μόνο μη κύρια μέθοδο MFA.
es: Solo puedes desactivar métodos MFA no primarios.
fi: Voit poistaa käytöstä vain ei-ensisijaisen MFA-menetelmän.
kk: Сіз тек негізгі емес MFA әдісін өшіре аласыз.
kn: ನೀವು ಪ್ರಾಥಮಿಕವಲ್ಲದ MFA ವಿಧಾನವನ್ನು ಮಾತ್ರ ನಿಷ್ಕ್ರಿಯಗೊಳಿಸಬಹುದು.
lv: Jūs varat deaktivizēt tikai ne-primāro MFA metodi.
mk: Можете да деактивирате само не-примарна MFA метода.
sv: Du kan bara inaktivera icke-primär MFA-metod.

source: Deactivated MFA method
be: Дэактываваны метад MFA
ca: Mètode MFA desactivat
el: Απενεργοποιήθηκε η μέθοδος MFA
es: Método MFA desactivado
fi: MFA-menetelmä poistettu käytöstä
kk: MFA әдісі өшірілді
kn: MFA ವಿಧಾನ ನಿಷ್ಕ್ರಿಯಗೊಳಿಸಲಾಗಿದೆ
lv: Deaktivizēta MFA metode
mk: Деактивирана MFA метода
sv: Inaktiverad MFA-metod

source: Invalid primary method code
be: Няправільны код асноўнага метада
ca: Codi del mètode primari invàlid
el: Μη έγκυρος κωδικός κύριας μεθόδου
es: Código de método primario inválido
fi: Virheellinen ensisijaisen menetelmän koodi
kk: Жарамсыз негізгі әдіс коды
kn: ಅಮಾನ್ಯ ಪ್ರಾಥಮಿಕ ವಿಧಾನ ಕೋಡ್
lv: Nederīgs primārās metodes kods
mk: Невалиден код на примарна метода
sv: Ogiltig primär metodkod

source: Updated primary MFA method
be: Абноўлены асноўны метад MFA
ca: Mètode MFA primari actualitzat
el: Ενημερώθηκε η κύρια μέθοδος MFA
es: Método MFA primario actualizado
fi: Ensisijainen MFA-menetelmä päivitetty
kk: Негізгі MFA әдісі жаңартылды
kn: ಪ್ರಾಥಮಿಕ MFA ವಿಧಾನ ನವೀಕರಿಸಲಾಗಿದೆ
lv: Atjaunota primārā MFA metode
mk: Ажурирана примарна MFA метода
sv: Uppdaterad primär MFA-metod

source: Cannot delete active MFA method
be: Нельга выдаліць актыўны метад MFA
ca: No es pot eliminar el mètode MFA actiu
el: Δεν μπορεί να διαγραφεί ενεργή μέθοδο MFA
es: No se puede eliminar el método MFA activo
fi: Ei voi poistaa aktiivista MFA-menetelmää
kk: Белсенді MFA әдісін жою мүмкін емес
kn: ಸಕ್ರಿಯ MFA ವಿಧಾನವನ್ನು ಅಳಿಸಲಾಗುವುದಿಲ್ಲ
lv: Nevar dzēst aktīvu MFA metodi
mk: Не може да се избрише активна MFA метода
sv: Kan inte radera aktiv MFA-metod

source: Cannot delete primary MFA method
be: Нельга выдаліць асноўны метад MFA
ca: No es pot eliminar el mètode MFA primari
el: Δεν μπορεί να διαγραφεί κύρια μέθοδο MFA
es: No se puede eliminar el método MFA primario
fi: Ei voi poistaa ensisijaista MFA-menetelmää
kk: Негізгі MFA әдісін жою мүмкін емес
kn: ಪ್ರಾಥಮಿಕ MFA ವಿಧಾನವನ್ನು ಅಳಿಸಲಾಗುವುದಿಲ್ಲ
lv: Nevar dzēst primāro MFA metodi
mk: Не може да се избрише примарна MFA метода
sv: Kan inte radera primär MFA-metod

source: Method does not exist
be: Метад не існуе
ca: El mètode no existeix
el: Η μέθοδος δεν υπάρχει
es: El método no existe
fi: Menetelmää ei ole olemassa
kk: Әдіс жоқ
kn: ವಿಧಾನ ಅಸ್ತಿತ್ವದಲ್ಲಿಲ್ಲ
lv: Metode neeksistē
mk: Методата не постои
sv: Metoden existerar inte

source: Deleted MFA method
be: Выдалены метад MFA
ca: Mètode MFA eliminat
el: Διαγράφηκε η μέθοδος MFA
es: Método MFA eliminado
fi: MFA-menetelmä poistettu
kk: MFA әдісі жойылды
kn: MFA ವಿಧಾನ ಅಳಿಸಲಾಗಿದೆ
lv: Dzēsta MFA metode
mk: Избришана MFA метода
sv: Raderad MFA-metod

source: MFA code sent
be: MFA-код адпраўлены
ca: Codi MFA enviat
el: Στάλθηκε ο κωδικός MFA
es: Código MFA enviado
fi: MFA-koodi lähetetty
kk: MFA коды жіберілді
kn: MFA ಕೋಡ್ ಕಳುಹಿಸಲಾಗಿದೆ
lv: MFA kods nosūtīts
mk: MFA код испратен
sv: MFA-kod skickad

source: Will override cookie.
be: Перавызначыць кукі.
ca: Sobreescriurà la galeta.
el: Θα καταργήσει το cookie.
es: Sobrescribirá la cookie.
fi: Korvaa evästeen.
kk: Куки файлын қайта орнатады.
kn: ಕುಕೀಯನ್ನು ಅತಿಕ್ರಮಿಸುತ್ತದೆ.
lv: Pārrakstīs sīkdatni.
mk: Ќе го презапише колачето.
sv: Kommer att åsidosätta cookie.

source: No valid refresh token found.
be: Не знойдзены дзейны токен абнаўлення.
ca: No s'ha trobat cap token d'actualització vàlid.
el: Δεν βρέθηκε έγκυρο refresh token.
es: No se encontró token de actualización válido.
fi: Kelvollista päivitystunnistetta ei löytynyt.
kk: Жарамды жаңарту токені табылмады.
kn: ಮಾನ್ಯವಾದ ನವೀಕರಣ ಟೋಕನ್ ಕಂಡುಬಂದಿಲ್ಲ.
lv: Nav atrasts derīgs atjaunošanas žetons.
mk: Не е пронајден валиден токен за освежување.
sv: Ingen giltig uppdateringstoken hittades.

source: E-mail is not verified.
be: Электронная пошта не праверана.
ca: El correu electrònic no està verificat.
el: Το email δεν έχει επιβεβαιωθεί.
es: El email no está verificado.
fi: Sähköpostia ei ole vahvistettu.
kk: Эл.пошта расталмаған.
kn: ಇಮೇಲ್ ಪರಿಶೀಲಿಸಲಾಗಿಲ್ಲ.
lv: E-pasts nav apstiprināts.
mk: Емаилот не е верифициран.
sv: E-post är inte verifierad.

source: Unable to log in with provided credentials.
be: Немагчыма ўвайсці з пададзенымі ўліковымі дадзенымі.
ca: No es pot iniciar sessió amb les credencials proporcionades.
el: Αδύνατη σύνδεση με τα διαπιστευτήρια που παρασχέθηκαν.
es: No se puede iniciar sesión con las credenciales proporcionadas.
fi: Kirjautuminen epäonnistui annetuilla tunnistietiedoilla.
kk: Берілген дәйектемелермен кіру мүмкін емес.
kn: ಒದಗಿಸಿದ ಅರ್ಹತೆಗಳೊಂದಿಗೆ ಲಾಗಿನ್ ಮಾಡಲು ಸಾಧ್ಯವಿಲ್ಲ.
lv: Nevar pieteikties ar norādītajiem akreditācijas datiem.
mk: Не може да се најави со обезбедените акредитиви.
sv: Kan inte logga in med angivna referenser.

source: Invalid value
be: Няправільнае значэнне
ca: Valor invàlid
el: Μη έγκυρη τιμή
es: Valor inválido
fi: Virheellinen arvo
kk: Жарамсыз мән
kn: ಅಮಾನ್ಯ ಮೌಲ್ಯ
lv: Nederīga vērtība
mk: Невалидна вредност
sv: Ogiltigt värde

source: Your old password was entered incorrectly. Please enter it again.
be: Ваш стары пароль быў уведзены няправільна. Калі ласка, увядзіце яго зноў.
ca: La teva contrasenya anterior s'ha introduït incorrectament. Si us plau, introdueix-la de nou.
el: Ο παλιός σας κωδικός πρόσβασης εισάχθηκε λάθος. Παρακαλώ εισάγετε τον ξανά.
es: Tu contraseña anterior fue ingresada incorrectamente. Por favor ingrésala de nuevo.
fi: Vanha salasanasi syötettiin väärin. Anna se uudelleen.
kk: Сіздің ескі құпия сөзіңіз дұрыс енгізілмеді. Қайта енгізіңіз.
kn: ನಿಮ್ಮ ಹಳೆಯ ಗುಪ್ತಪದವನ್ನು ತಪ್ಪಾಗಿ ನಮೂದಿಸಲಾಗಿದೆ. ದಯವಿಟ್ಟು ಅದನ್ನು ಮತ್ತೆ ನಮೂದಿಸಿ.
lv: Jūsu vecā parole tika ievadīta nepareizi. Lūdzu, ievadiet to vēlreiz.
mk: Вашата стара лозинка беше внесена неточно. Ве молиме внесете ја повторно.
sv: Ditt gamla lösenord angavs felaktigt. Vänligen ange det igen.

source: A user is already registered with this e-mail address.
be: Карыстальнік ужо зарэгістраваны з гэтым адрасам электроннай пошты.
ca: Ja hi ha un usuari registrat amb aquesta adreça de correu electrònic.
el: Ένας χρήστης είναι ήδη εγγεγραμμένος με αυτή τη διεύθυνση email.
es: Ya hay un usuario registrado con esta dirección de email.
fi: Käyttäjä on jo rekisteröity tällä sähköpostiosoitteella.
kk: Бұл эл.пошта мекенжайымен пайдаланушы әлдеқашан тіркелген.
kn: ಈ ಇಮೇಲ್ ವಿಳಾಸದೊಂದಿಗೆ ಒಬ್ಬ ಬಳಕೆದಾರ ಈಗಾಗಲೇ ನೋಂದಾಯಿಸಲಾಗಿದೆ.
lv: Lietotājs jau ir reģistrēts ar šo e-pasta adresi.
mk: Корисник веќе е регистриран со оваа емаил адреса.
sv: En användare är redan registrerad med denna e-postadress.

source: The two password fields didn't match.
be: Два палі пароля не супадаюць.
ca: Els dos camps de contrasenya no coincideixen.
el: Τα δύο πεδία κωδικού πρόσβασης δεν ταιριάζουν.
es: Los dos campos de contraseña no coinciden.
fi: Salasanakentät eivät täsmää.
kk: Екі құпия сөз өрісі сәйкес келмеді.
kn: ಎರಡು ಗುಪ್ತಪದ ಕ್ಷೇತ್ರಗಳು ಹೊಂದಿಕೆಯಾಗಲಿಲ್ಲ.
lv: Abi paroles lauki neatbilst.
mk: Двете полиња за лозинка не се совпаѓаат.
sv: De två lösenordsfälten stämde inte överens.

source: Social account email must match your current account email.
be: Электронная пошта сацыяльнага конта павінна супадаць з электроннай поштай вашага бягучага конта.
ca: El correu del compte social ha de coincidir amb el correu del teu compte actual.
el: Το email του κοινωνικού λογαριασμού πρέπει να ταιριάζει με το email του τρέχοντα λογαριασμού σας.
es: El email de la cuenta social debe coincidir con el email de tu cuenta actual.
fi: Sosiaalisen tilin sähköpostin on täsmättävä nykyisen tilisi sähköpostiin.
kk: Әлеуметтік есептік жазба эл.поштасы сіздің ағымдағы есептік жазба эл.поштасына сәйкес келуі тиіс.
kn: ಸಾಮಾಜಿಕ ಖಾತೆ ಇಮೇಲ್ ನಿಮ್ಮ ಪ್ರಸ್ತುತ ಖಾತೆ ಇಮೇಲ್‌ಗೆ ಹೊಂದಿಕೆಯಾಗಬೇಕು.
lv: Sociālā konta e-pastam jāatbilst jūsu pašreizējā konta e-pastam.
mk: Емаилот на социјалната сметка мора да се совпаѓа со емаилот на вашата тековна сметка.
sv: E-post för socialt konto måste matcha din nuvarande kontos e-post.

source: Connected
be: Падключана
ca: Connectat
el: Συνδέθηκε
es: Conectado
fi: Yhdistetty
kk: Қосылды
kn: ಸಂಪರ್ಕಿಸಲಾಗಿದೆ
lv: Savienots
mk: Поврзан
sv: Ansluten
