Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.3-py3-none-any.whl/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: be, ca, el, es, fi, kk, kn, lv, mk, sv

source: Returns user details along with JWT access and refresh tokens with expiration times.
be: Вяртае дадзеныя пра карыстальніка разам з JWT-токенамі доступу і абнавлення з часом заканчэння.
ca: Retorna els detalls de l'usuari juntament amb els tokens JWT d'accés i actualització amb temps d'expiració.
el: Επιστρέφει στοιχεία χρήστη μαζί με JWT access και refresh tokens με χρόνους λήξης.
es: Devuelve los detalles del usuario junto con los tokens de acceso y actualización JWT con tiempos de expiración.
fi: Palauttaa käyttäjätiedot sekä JWT-pääsy- ja päivitystunnisteet vanhenemisaikoineen.
kk: Пайдаланушы мәліметтерін мерзімі аяқталу уақытымен бірге JWT қол жетімділік және жаңарту токендермен қайтарады.
kn: ವಿಕಲ್ಪ ಸಮಯಗಳೊಂದಿಗೆ JWT ಪ್ರವೇಶ ಮತ್ತು ನವೀಕರಣ ಟೋಕನ್‌ಗಳೊಂದಿಗೆ ಬಳಕೆದಾರರ ವಿವರಗಳನ್ನು ಹಿಂದಿರುಗಿಸುತ್ತದೆ.
lv: Atgriež lietotāja datus kopā ar JWT piekļuves un atjaunošanas žetoniem ar beigu termiņiem.
mk: Враќа детали за корисникот заедно со JWT токени за пристап и освежување со времиња на истекување.
sv: Returnerar användardetaljer tillsammans med JWT åtkomst- och uppdateringstokens med utgångstider.

source: Returns user details along with a DRF authentication token for API access.
be: Вяртае дадзеныя пра карыстальніка разам з DRF-токенам аўтэнтыфікацыі для API-доступу.
ca: Retorna els detalls de l'usuari juntament amb un token d'autenticació DRF per a l'accés a l'API.
el: Επιστρέφει στοιχεία χρήστη μαζί με DRF authentication token για πρόσβαση API.
es: Devuelve los detalles del usuario junto con un token de autenticación DRF para acceso a la API.
fi: Palauttaa käyttäjätiedot sekä DRF-tunnistautumistunnisteen API-käyttöön.
kk: API қол жетімділігі үшін DRF аутентификация токенімен бірге пайдаланушы мәліметтерін қайтарады.
kn: API ಪ್ರವೇಶಕ್ಕಾಗಿ DRF ದೃಢೀಕರಣ ಟೋಕನ್‌ನೊಂದಿಗೆ ಬಳಕೆದಾರರ ವಿವರಗಳನ್ನು ಹಿಂದಿರುಗಿಸುತ್ತದೆ.
lv: Atgriež lietotāja datus kopā ar DRF autentifikācijas žetonu API piekļuvei.
mk: Враќа детали за корисникот заедно со DRF токен за автентикација за API пристап.
sv: Returnerar användardetaljer tillsammans med en DRF autentiseringstoken för API-åtkomst.

source: Returns user details along with custom authentication tokens.
be: Вяртае дадзеныя пра карыстальніка разам з кастомнымі токенамі аўтэнтыфікацыі.
ca: Retorna els detalls de l'usuari juntament amb tokens d'autenticació personalitzats.
el: Επιστρέφει στοιχεία χρήστη μαζί με προσαρμοσμένα authentication tokens.
es: Devuelve los detalles del usuario junto con tokens de autenticación personalizados.
fi: Palauttaa käyttäjätiedot sekä mukautetut tunnistautumistunnisteet.
kk: Пайдаланушы мәліметтерін реттелетін аутентификация токендермен бірге қайтарады.
kn: ಕಸ್ಟಮ್ ದೃಢೀಕರಣ ಟೋಕನ್‌ಗಳೊಂದಿಗೆ ಬಳಕೆದಾರರ ವಿವರಗಳನ್ನು ಹಿಂದಿರುಗಿಸುತ್ತದೆ.
lv: Atgriež lietotāja datus kopā ar pielāgotiem autentifikācijas žetoniem.
mk: Враќа детали за корисникот заедно со прилагодени токени за автентикација.
sv: Returnerar användardetaljer tillsammans med anpassade autentiseringstokens.

source: JWT access and refresh tokens
be: JWT-токены доступу і абнаўлення
ca: Tokens JWT d'accés i actualització
el: JWT access και refresh tokens
es: Tokens de acceso y actualización JWT
fi: JWT-pääsy- ja päivitystunnisteet
kk: JWT қол жетімділік және жаңарту токендері
kn: JWT ಪ್ರವೇಶ ಮತ್ತು ನವೀಕರಣ ಟೋಕನ್‌ಗಳು
lv: JWT piekļuves un atjaunošanas žetoni
mk: JWT токени за пристап и освежување
sv: JWT åtkomst- och uppdateringstokens

source: DRF authentication token
be: DRF-токен аўтэнтыфікацыі
ca: Token d'autenticació DRF
es: Token de autenticación DRF
fi: DRF-tunnistautumistunniste
kk: DRF аутентификация токені
kn: DRF ದೃಢೀಕರಣ ಟೋಕನ್
lv: DRF autentifikācijas žetons
mk: DRF токен за автентикација
sv: DRF autentiseringstoken

source: custom authentication tokens
be: кастомныя токены аўтэнтыфікацыі
ca: tokens d'autenticació personalitzats
el: προσαρμοσμένα authentication tokens
es: tokens de autenticación personalizados
fi: mukautetut tunnistautumistunnisteet
kk: реттелетін аутентификация токендері
kn: ಕಸ್ಟಮ್ ದೃಢೀಕರಣ ಟೋಕನ್‌ಗಳು
lv: pielāgoti autentifikācijas žetoni
mk: прилагодени токени за автентикација
sv: anpassade autentiseringstokens

source: Authentication cookies are set automatically for secure token storage.
be: Кукі аўтэнтыфікацыі аўтаматычна встаноўвацца для бяспечнага схоўвання токенаў.
ca: Les galetes d'autenticació es configuren automàticament per a l'emmagatzematge segur de tokens.
el: Τα authentication cookies ορίζονται αυτόματα για ασφαλή αποθήκευση token.
es: Las cookies de autenticación se establecen automáticamente para almacenamiento seguro de tokens.
fi: Tunnistautumisevästeet asetetaan automaattisesti turvallista tunnisteiden tallennusta varten.
kk: Аутентификация куки файлдары қауіпсіз токен сақтау үшін автоматты түрде орнатылады.
kn: ಸುರಕ್ಷಿತ ಟೋಕನ್ ಸಂಗ್ರಹಣೆಗಾಗಿ ದೃಢೀಕರಣ ಕುಕೀಗಳನ್ನು ಸ್ವಯಂಚಾಲಿತವಾಗಿ ಹೊಂದಿಸಲಾಗಿದೆ.
lv: Autentifikācijas sīkdatnes tiek iestatītas automātiski drošai žetonu glabāšanai.
mk: Колачињата за автентикација се поставуваат автоматски за безбедно чување на токени.
sv: Autentiseringscookies ställs automatiskt in för säker tokenlagring.

source: Blacklists JWT refresh tokens to prevent further use.
be: Дадае JWT-токены абнаўлення ў чорны спіс, каб прадухіліць далейшае выкарыстанне.
ca: Afegeix els tokens JWT d'actualització a la llista negra per evitar el seu ús posterior.
el: Προσθέτει JWT refresh tokens στη μαύρη λίστα για αποτροπή περαιτέρω χρήσης.
es: Incluye en lista negra los tokens de actualización JWT para prevenir su uso posterior.
fi: Lisää JWT-päivitystunnisteet mustalle listalle estääkseen niiden jatkokäytön.
kk: JWT жаңарту токендерін әрі қарай пайдалануды болдырмау үшін қара тізімге қосады.
kn: ಮುಂದಿನ ಬಳಕೆಯನ್ನು ತಡೆಯಲು JWT ನವೀಕರಣ ಟೋಕನ್‌ಗಳನ್ನು ಕಪ್ಪುಪಟ್ಟಿಗೆ ಸೇರಿಸುತ್ತದೆ.
lv: Iekļauj JWT atjaunošanas žetonus melnajā sarakstā, lai novērstu turpmāku izmantošanu.
mk: Го става JWT токенот за освежување на црна листа за да спречи понатамошна употреба.
sv: Svartlistar JWT uppdateringstokens för att förhindra vidare användning.

source: Deletes the DRF authentication token from the database.
be: Выдаляе DRF-токен аўтэнтыфікацыі з базы дадзеных.
ca: Elimina el token d'autenticació DRF de la base de dades.
el: Διαγράφει το DRF authentication token από τη βάση δεδομένων.
es: Elimina el token de autenticación DRF de la base de datos.
fi: Poistaa DRF-tunnistautumistunnisteen tietokannasta.
kk: DRF аутентификация токенін мәліметтер базасынан жояды.
kn: ಡೇಟಾಬೇಸ್‌ನಿಂದ DRF ದೃಢೀಕರಣ ಟೋಕನ್ ಅನ್ನು ಅಳಿಸುತ್ತದೆ.
lv: Dzēš DRF autentifikācijas žetonu no datu bāzes.
mk: Го брише DRF токенот за автентикација од базата на податоци.
sv: Raderar DRF autentiseringstoken från databasen.

source: Invalidates custom authentication tokens.
be: Абнуляе кастомныя токены аўтэнтыфікацыі.
ca: Invalida els tokens d'autenticació personalitzats.
el: Ακυρώνει τα προσαρμοσμένα authentication tokens.
es: Invalida los tokens de autenticación personalizados.
fi: Mitätöi mukautetut tunnistautumistunnisteet.
kk: Реттелетін аутентификация токендерін жарамсыз етеді.
kn: ಕಸ್ಟಮ್ ದೃಢೀಕರಣ ಟೋಕನ್‌ಗಳನ್ನು ಅಮಾನ್ಯಗೊಳಿಸುತ್ತದೆ.
lv: Padara nederīgus pielāgotos autentifikācijas žetonus.
mk: Ги поништува прилагодените токени за автентикација.
sv: Ogiltigförklarar anpassade autentiseringstokens.

source: Clears authentication cookies from the browser.
be: Очышчае кукі аўтэнтыфікацыі з браўзэра.
ca: Neteja les galetes d'autenticació del navegador.
el: Καθαρίζει τα authentication cookies από τον περιηγητή.
es: Borra las cookies de autenticación del navegador.
fi: Poistaa tunnistautumisevästeet selaimesta.
kk: Браузерден аутентификация куки файлдарын тазалайды.
kn: ಬ್ರೌಸರ್‌ನಿಂದ ದೃಢೀಕರಣ ಕುಕೀಗಳನ್ನು ತೆರವುಗೊಳಿಸುತ್ತದೆ.
lv: Notīra autentifikācijas sīkdatnes no pārlūkprogrammas.
mk: Ги брише колачињата за автентикација од прелистувачот.
sv: Rensar autentiseringscookies från webbläsaren.

source: Authenticate with username/email and password to obtain access tokens.
be: Аўтэнтыфікацыя па імені карыстальніка/электроннай пошце і паролі для отрымання токенаў доступу.
ca: Autentica amb nom d'usuari/correu electrònic i contrasenya per obtenir tokens d'accés.
el: Πιστοποίηση με όνομα χρήστη/email και κωδικό πρόσβασης για απόκτηση access tokens.
es: Autentícate con nombre de usuario/email y contraseña para obtener tokens de acceso.
fi: Tunnistaudu käyttäjänimellä/sähköpostilla ja salasanalla saadaksesi pääsytunnisteet.
kk: Қол жетімділік токендерін алу үшін пайдаланушы аты/эл.пошта және құпия сөзбен аутентификация.
kn: ಪ್ರವೇಶ ಟೋಕನ್‌ಗಳನ್ನು ಪಡೆಯಲು ಬಳಕೆದಾರ ಹೆಸರು/ಇಮೇಲ್ ಮತ್ತು ಗುಪ್ತಪದದೊಂದಿಗೆ ದೃಢೀಕರಿಸಿ.
lv: Autentificēties ar lietotājvārdu/e-pastu un paroli, lai iegūtu piekļuves žetonus.
mk: Автентикувај се со корисничко име/емаил и лозинка за да добиеш токени за пристап.
sv: Autentisera med användarnamn/e-post och lösenord för att erhålla åtkomsttokens.

source: Logout user and invalidate authentication tokens.
be: Выхад карыстальніка і абнуленне токенаў аўтэнтыфікацыі.
ca: Tanca la sessió de l'usuari i invalida els tokens d'autenticació.
el: Αποσύνδεση χρήστη και ακύρωση authentication tokens.
es: Cierra sesión del usuario e invalida los tokens de autenticación.
fi: Kirjaa käyttäjä ulos ja mitätöi tunnistautumistunnisteet.
kk: Пайдаланушыны жүйеден шығару және аутентификация токендерін жарамсыз ету.
kn: ಬಳಕೆದಾರರನ್ನು ಲಾಗ್‌ಔಟ್ ಮಾಡಿ ಮತ್ತು ದೃಢೀಕರಣ ಟೋಕನ್‌ಗಳನ್ನು ಅಮಾನ್ಯಗೊಳಿಸಿ.
lv: Atteikt lietotāju un paddarīt nederīgus autentifikācijas žetonus.
mk: Одјави корисник и поништи токени за автентикација.
sv: Loggar ut användare och ogiltigförklarar autentiseringstokens.

source: Requires authentication to ensure only valid sessions can be logged out.
be: Патрабуе аўтэнтыфікацыі, каб упэўніцца, што толькі дзейныя сесіі могуць быць закончаны.
ca: Requereix autenticació per assegurar que només es poden tancar sessions vàlides.
el: Απαιτεί πιστοποίηση για να διασφαλίσει ότι μόνο έγκυρες συνεδρίες μπορούν να αποσυνδεθούν.
es: Requiere autenticación para asegurar que solo las sesiones válidas puedan cerrar sesión.
fi: Vaatii tunnistautumisen varmistaakseen, että vain voimassa olevat istunnot voidaan kirjata ulos.
kk: Тек жарамды сеанстарды ғана жүйеден шығаруға болатынын қамтамасыз ету үшін аутентификация қажет.
kn: ಮಾನ್ಯವಾದ ಅಧಿವೇಶನಗಳನ್ನು ಮಾತ್ರ ಲಾಗ್‌ಔಟ್ ಮಾಡಬಹುದು ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಲು ದೃಢೀಕರಣ ಅಗತ್ಯವಿದೆ.
lv: Nepieciešama autentifikācija, lai nodrošinātu, ka tikai derīgās sesijas var tikt atteiktas.
mk: Бара автентикација за да се осигури дека само валидни сесии можат да се одјават.
sv: Kräver autentisering för att säkerställa att endast giltiga sessioner kan loggas ut.

source: Generate new JWT access tokens using refresh tokens.
be: Генерацыя новых JWT-токенаў доступу з выкарыстаннем токенаў абнаўлення.
ca: Genera nous tokens JWT d'accés utilitzant tokens d'actualització.
el: Δημιουργία νέων JWT access tokens χρησιμοποιώντας refresh tokens.
es: Genera nuevos tokens de acceso JWT usando tokens de actualización.
fi: Luo uudet JWT-pääsytunnisteet käyttäen päivitystunnisteita.
kk: Жаңарту токендерін пайдаланып жаңа JWT қол жетімділік токендерін жасау.
kn: ನವೀಕರಣ ಟೋಕನ್‌ಗಳನ್ನು ಬಳಸಿ ಹೊಸ JWT ಪ್ರವೇಶ ಟೋಕನ್‌ಗಳನ್ನು ಉತ್ಪಾದಿಸಿ.
lv: Ģenerēt jaunus JWT piekļuves žetonus, izmantojot atjaunošanas žetonus.
mk: Генерирај нови JWT токени за пристап користејќи токени за освежување.
sv: Genererar nya JWT åtkomsttokens med hjälp av uppdateringstokens.

source: Refresh tokens can be provided in request data or extracted automatically from HTTP cookies.
be: Токены абнаўлення могуць быць прадстаўлены ў дадзеных запыту ці аўтаматычна выяўлены з HTTP-кукі.
ca: Els tokens d'actualització es poden proporcionar en les dades de la petició o extreure automàticament des de les galetes HTTP.
el: Τα refresh tokens μπορούν να παρασχεθούν στα δεδομένα αιτήματος ή να εξαχθούν αυτόματα από HTTP cookies.
es: Los tokens de actualización pueden proporcionarse en los datos de solicitud o extraerse automáticamente de las cookies HTTP.
fi: Päivitystunnisteet voidaan antaa pyyntötiedoissa tai ne voidaan poimia automaattisesti HTTP-evästeistä.
kk: Жаңарту токендері сұрау деректерінде берілуі немесе HTTP куки файлдарынан автоматты түрде алынуы мүмкін.
kn: ನವೀಕರಣ ಟೋಕನ್‌ಗಳನ್ನು ವಿನಂತಿ ಡೇಟಾದಲ್ಲಿ ಒದಗಿಸಬಹುದು ಅಥವಾ HTTP ಕುಕೀಗಳಿಂದ ಸ್ವಯಂಚಾಲಿತವಾಗಿ ಹೊರತೆಗೆಯಬಹುದು.
lv: Atjaunošanas žetoni var tikt nodrošināti pieprasījuma datos vai automātiski izvilkti no HTTP sīkdatnēm.
mk: Токените за освежување можат да се обезбедат во податоците за барање или да се извлечат автоматски од HTTP колачињата.
sv: Uppdateringstokens kan tillhandahållas i förfrågningsdata eller extraheras automatiskt från HTTP-cookies.

source: Returns new access tokens with updated expiration times.
be: Вяртае новыя токены доступу з абноўленым часом заканчэння.
ca: Retorna nous tokens d'accés amb temps d'expiració actualitzats.
el: Επιστρέφει νέα access tokens με ενημερωμένους χρόνους λήξης.
es: Devuelve nuevos tokens de acceso con tiempos de expiración actualizados.
fi: Palauttaa uudet pääsytunnisteet päivitetyillä vanhenemisajoilla.
kk: Жаңартылған мерзімі аяқталу уақытымен жаңа қол жетімділік токендерін қайтарады.
kn: ನವೀಕರಿಸಿದ ವಿಕಲ್ಪ ಸಮಯಗಳೊಂದಿಗೆ ಹೊಸ ಪ್ರವೇಶ ಟೋಕನ್‌ಗಳನ್ನು ಹಿಂದಿರುಗಿಸುತ್ತದೆ.
lv: Atgriež jaunus piekļuves žetonus ar atjaunotiem beigu termiņiem.
mk: Враќа нови токени за пристап со ажурирани времиња на истекување.
sv: Returnerar nya åtkomsttokens med uppdaterade utgångstider.

source: New tokens are automatically set in HTTP cookies for secure storage.
be: Новыя токены аўтаматычна встаноўвацца ў HTTP-кукі для бяспечнага схоўвання.
ca: Els nous tokens es configuren automàticament en galetes HTTP per a l'emmagatzematge segur.
el: Τα νέα tokens ορίζονται αυτόματα σε HTTP cookies για ασφαλή αποθήκευση.
es: Los nuevos tokens se establecen automáticamente en cookies HTTP para almacenamiento seguro.
fi: Uudet tunnisteet asetetaan automaattisesti HTTP-evästeisiin turvallista tallennusta varten.
kk: Жаңа токендер қауіпсіз сақтау үшін HTTP куки файлдарында автоматты түрде орнатылады.
kn: ಸುರಕ್ಷಿತ ಸಂಗ್ರಹಣೆಗಾಗಿ ಹೊಸ ಟೋಕನ್‌ಗಳನ್ನು HTTP ಕುಕೀಗಳಲ್ಲಿ ಸ್ವಯಂಚಾಲಿತವಾಗಿ ಹೊಂದಿಸಲಾಗಿದೆ.
lv: Jauni žetoni tiek automātiski iestatīti HTTP sīkdatnēs drošai glabāšanai.
mk: Новите токени се поставуваат автоматски во HTTP колачињата за безбедно чување.
sv: Nya tokens ställs automatiskt in i HTTP-cookies för säker lagring.

source: Refresh tokens must be provided in the request data.
be: Токены абнаўлення павінны быць прадстаўлены ў дадзеных запыту.
ca: Els tokens d'actualització s'han de proporcionar en les dades de la petició.
el: Τα refresh tokens πρέπει να παρασχεθούν στα δεδομένα αιτήματος.
es: Los tokens de actualización deben proporcionarse en los datos de la solicitud.
fi: Päivitystunnisteet on annettava pyyntötiedoissa.
kk: Жаңарту токендері сұрау деректерінде берілуі тиіс.
kn: ನವೀಕರಣ ಟೋಕನ್‌ಗಳನ್ನು ವಿನಂತಿ ಡೇಟಾದಲ್ಲಿ ಒದಗಿಸಬೇಕು.
lv: Atjaunošanas žetoni jānodrošina pieprasījuma datos.
mk: Токените за освежување мора да се обезбедат во податоците за барање.
sv: Uppdateringstokens måste tillhandahållas i förfrågningsdata.

source: Register a new user account.
be: Рэгістрацыя новага карыстальніцкага конта.
ca: Registra un nou compte d'usuari.
el: Εγγραφή νέου λογαριασμού χρήστη.
es: Registra una nueva cuenta de usuario.
fi: Rekisteröi uusi käyttäjätili.
kk: Жаңа пайдаланушы есептік жазбасын тіркеу.
kn: ಹೊಸ ಬಳಕೆದಾರ ಖಾತೆಯನ್ನು ನೋಂದಾಯಿಸಿ.
lv: Reģistrēt jaunu lietotāja kontu.
mk: Регистрирај нова корисничка сметка.
sv: Registrerar ett nytt användarkonto.

source: Users must verify their email address before the account is fully activated.
be: Карыстальнікі павінны праверыць свой адрас электроннай пошты перад тым, як конт будзе поўнасцю актываваны.
ca: Els usuaris han de verificar la seva adreça de correu electrònic abans que el compte estigui completament activat.
el: Οι χρήστες πρέπει να επιβεβαιώσουν τη διεύθυνση email τους πριν ο λογαριασμός ενεργοποιηθεί πλήρως.
es: Los usuarios deben verificar su dirección de email antes de que la cuenta se active completamente.
fi: Käyttäjien on vahvistettava sähköpostiosoitteensa ennen kuin tili on täysin aktivoitu.
kk: Пайдаланушылар есептік жазба толық белсендірілуіне дейін эл.пошта мекенжайын растауы тиіс.
kn: ಖಾತೆಯು ಪೂರ್ಣವಾಗಿ ಸಕ್ರಿಯಗೊಳಿಸುವ ಮುಂದೆ ಬಳಕೆದಾರರು ತಮ್ಮ ಇಮೇಲ್ ವಿಳಾಸವನ್ನು ಪರಿಶೀಲಿಸಬೇಕು.
lv: Lietotājiem ir jāapstiprina sava e-pasta adrese, pirms konts tiek pilnībā aktivizēts.
mk: Корисниците мора да ја верифицираат својата емаил адреса пред сметката да биде целосно активирана.
sv: Användare måste verifiera sin e-postadress innan kontot är fullt aktiverat.

source: Send password reset instructions to the provided email address. If the email is registered, a secure reset link will be sent. The link expires after a limited time for security.
be: Адправіць інструкцыі па скідванні пароля на паведамлены адрас электроннай пошты. Калі электронная пошта зарэгістравана, будзе адпраўлена бяспечная спасылка для скіду. Спасылка заканчваецца праз абмежаваны час для бяспекі.
ca: Envia instruccions per restablir la contrasenya a l'adreça de correu proporcionada. Si el correu està registrat, s'enviarà un enllaç segur de restabliment. L'enllaç expira després d'un temps limitat per seguretat.
el: Αποστολή οδηγιών επαναφοράς κωδικού πρόσβασης στη διεύθυνση email που παρασχέθηκε. Αν το email είναι εγγεγραμμένο, θα σταλεί ένας ασφαλής σύνδεσμος επαναφοράς. Ο σύνδεσμος λήγει μετά από περιορισμένο χρόνο για λόγους ασφαλείας.
es: Envía instrucciones de restablecimiento de contraseña a la dirección de email proporcionada. Si el email está registrado, se enviará un enlace seguro de restablecimiento. El enlace expira después de un tiempo limitado por seguridad.
fi: Lähetä salasanan nollausohjeet annettuun sähköpostiosoitteeseen. Jos sähköposti on rekisteröity, turvallinen nollauslinkki lähetetään. Linkki vanhenee rajoitetun ajan kuluttua turvallisuussyistä.
kk: Көрсетілген эл.пошта мекенжайына құпия сөзді қалпына келтіру нұсқауларын жіберу. Егер эл.пошта тіркелсе, қауіпсіз қалпына келтіру сілтемесі жіберіледі. Сілтеме қауіпсіздік үшін шектеулі уақыттан кейін аяқталады.
kn: ಒದಗಿಸಿದ ಇಮೇಲ್ ವಿಳಾಸಕ್ಕೆ ಗುಪ್ತಪದ ಮರುಹೊಂದಿಸುವ ಸೂಚನೆಗಳನ್ನು ಕಳುಹಿಸಿ. ಇಮೇಲ್ ನೋಂದಾಯಿಸಿದ್ದರೆ, ಸುರಕ್ಷಿತ ಮರುಹೊಂದಿಸುವ ಲಿಂಕ್ ಅನ್ನು ಕಳುಹಿಸಲಾಗುತ್ತದೆ. ಭದ್ರತೆಗಾಗಿ ಸೀಮಿತ ಸಮಯದ ನಂತರ ಲಿಂಕ್ ಅವಧಿ ಮುಗಿಯುತ್ತದೆ.
lv: Sūtīt paroles atiestatīšanas instrukcijas uz norādīto e-pasta adresi. Ja e-pasts ir reģistrēts, tiks nosūtīta droša atiestatīšanas saite. Saite beidzas pēc ierobežota laika drošības nolūkos.
mk: Испрати инструкции за ресетирање на лозинката на дадената емаил адреса. Ако емаилот е регистриран, ќе се испрати безбедна врска за ресетирање. Врската истекува по ограничено време поради безбедност.
sv: Skickar instruktioner för lösenordsåterställning till den angivna e-postadressen. Om e-posten är registrerad kommer en säker återställningslänk att skickas. Länken går ut efter en begränsad tid av säkerhetsskäl.

source: Complete the password reset process using the token from the reset email. Requires the UID and token from the email along with the new password. The token is single-use and expires for security.
be: Завяршэнне працэсу скідвання пароля з выкарыстаннем токена з электроннага ліста скіду. Патрабуе UID і токен з электроннага ліста разам з новым паролем. Токен выкарыстоўваецца толькі раз і заканчваецца для бяспекі.
ca: Completa el procés de restabliment de contrasenya utilitzant el token del correu de restabliment. Requereix l'UID i el token del correu juntament amb la nova contrasenya. El token és d'un sol ús i expira per seguretat.
el: Ολοκλήρωση της διαδικασίας επαναφοράς κωδικού πρόσβασης χρησιμοποιώντας το token από το email επαναφοράς. Απαιτεί το UID και το token από το email μαζί με τον νέο κωδικό πρόσβασης. Το token είναι μιας χρήσης και λήγει για λόγους ασφαλείας.
es: Completa el proceso de restablecimiento de contraseña usando el token del email de restablecimiento. Requiere el UID y token del email junto con la nueva contraseña. El token es de un solo uso y expira por seguridad.
fi: Viimeistele salasanan nollausprosessi käyttäen nollaussähköpostin tunnistetta. Vaatii sähköpostin UID:n ja tunnisteen sekä uuden salasanan. Tunniste on kertakäyttöinen ja vanhenee turvallisuussyistä.
kk: Қалпына келтіру эл.поштасынан алынған токенді пайдаланып құпия сөзді қалпына келтіру процесін аяқтау. Жаңа құпия сөзбен бірге эл.поштадан UID және токен қажет. Токен бір рет пайдаланылады және қауіпсіздік үшін аяқталады.
kn: ಮರುಹೊಂದಿಸುವ ಇಮೇಲ್‌ನಿಂದ ಟೋಕನ್ ಅನ್ನು ಬಳಸಿ ಗುಪ್ತಪದ ಮರುಹೊಂದಿಸುವ ಪ್ರಕ್ರಿಯೆಯನ್ನು ಪೂರ್ಣಗೊಳಿಸಿ. ಹೊಸ ಗುಪ್ತಪದದೊಂದಿಗೆ ಇಮೇಲ್‌ನಿಂದ UID ಮತ್ತು ಟೋಕನ್ ಅಗತ್ಯವಿದೆ. ಭದ್ರತೆಗಾಗಿ ಟೋಕನ್ ಒಂದು ಬಾರಿ ಬಳಕೆ ಮತ್ತು ಅವಧಿ ಮುಗಿಯುತ್ತದೆ.
lv: Pabeigt paroles atiestatīšanas procesu, izmantojot žetonu no atiestatīšanas e-pasta. Nepieciešams UID un žetons no e-pasta kopā ar jauno paroli. Žetons ir vienreizējs un beidzas drošības nolūkos.
mk: Заврши го процесот за ресетирање на лозинката користејќи го токенот од емаилот за ресетирање. Бара UID и токен од емаилот заедно со новата лозинка. Токенот е за еднократна употреба и истекува поради безбедност.
sv: Slutför lösenordsåterställningsprocessen med hjälp av token från återställningsmailen. Kräver UID och token från e-posten tillsammans med det nya lösenordet. Token är för engångsbruk och går ut av säkerhetsskäl.

source: Change the current user's password. Requires authentication.
be: Змяніць пароль бягучага карыстальніка. Патрабуе аўтэнтыфікацыі.
ca: Canvia la contrasenya de l'usuari actual. Requereix autenticació.
el: Αλλαγή του κωδικού πρόσβασης του τρέχοντα χρήστη. Απαιτεί πιστοποίηση.
es: Cambia la contraseña del usuario actual. Requiere autenticación.
fi: Vaihda nykyisen käyttäjän salasana. Vaatii tunnistautumisen.
kk: Ағымдағы пайдаланушының құпия сөзін өзгерту. Аутентификация қажет.
kn: ಪ್ರಸ್ತುತ ಬಳಕೆದಾರರ ಗುಪ್ತಪದವನ್ನು ಬದಲಾಯಿಸಿ. ದೃಢೀಕರಣ ಅಗತ್ಯವಿದೆ.
lv: Mainīt pašreizējā lietotāja paroli. Nepieciešama autentifikācija.
mk: Промени ја лозинката на тековниот корисник. Бара автентикација.
sv: Ändra den aktuella användarens lösenord. Kräver autentisering.

source: Confirm email address using the verification key sent via email. This activates the user account and allows login access.
be: Пацвердзіць адрас электроннай пошты з выкарыстаннем ключа верыфікацыі, адпраўленага па электроннай пошце. Гэта актывуе карыстальніцкі конт і дазваляе доступ для ўваходу.
ca: Confirma l'adreça de correu electrònic utilitzant la clau de verificació enviada per correu. Això activa el compte d'usuari i permet l'accés d'inici de sessió.
el: Επιβεβαίωση διεύθυνσης email χρησιμοποιώντας το κλειδί επιβεβαίωσης που στάλθηκε μέσω email. Αυτό ενεργοποιεί τον λογαριασμό χρήστη και επιτρέπει πρόσβαση σύνδεσης.
es: Confirma la dirección de email usando la clave de verificación enviada por email. Esto activa la cuenta de usuario y permite el acceso de inicio de sesión.
fi: Vahvista sähköpostiosoite käyttäen sähköpostitse lähetettyä vahvistusavainta. Tämä aktivoi käyttäjätilin ja sallii kirjautumisen.
kk: Эл.пошта арқылы жіберілген тексеру кілтін пайдаланып эл.пошта мекенжайын растау. Бұл пайдаланушы есептік жазбасын белсендіреді және кіру рұқсатын береді.
kn: ಇಮೇಲ್ ಮೂಲಕ ಕಳುಹಿಸಿದ ಪರಿಶೀಲನಾ ಕೀಲಿಯನ್ನು ಬಳಸಿ ಇಮೇಲ್ ವಿಳಾಸವನ್ನು ದೃಢೀಕರಿಸಿ. ಇದು ಬಳಕೆದಾರ ಖಾತೆಯನ್ನು ಸಕ್ರಿಯಗೊಳಿಸುತ್ತದೆ ಮತ್ತು ಲಾಗಿನ್ ಪ್ರವೇಶವನ್ನು ಅನುಮತಿಸುತ್ತದೆ.
lv: Apstiprināt e-pasta adresi, izmantojot verifikācijas atslēgu, kas nosūtīta pa e-pastu. Tas aktivizē lietotāja kontu un ļauj pieteikties.
mk: Потврди ја емаил адресата користејќи го клучот за верификација испратен преку емаил. Ова ја активира корисничката сметка и овозможува пристап при најавување.
sv: Bekräfta e-postadress med hjälp av verifieringsnyckeln som skickas via e-post. Detta aktiverar användarkontot och tillåter inloggningsåtkomst.
