Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.3-py3-none-any.whl/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: be, ca, el, es, fi, kk, kn, lv, mk, sv

source: Failed to complete OAuth flow
be: Не ўдалося завяршыць OAuth-паток
ca: Ha fallat completar el flux OAuth
el: Απέτυχε η ολοκλήρωση της ροής OAuth
es: Falló al completar el flujo OAuth
fi: OAuth-prosessin viimeistely epäonnistui
kk: OAuth ағынын аяқтау сәтсіз аяқталды
kn: OAuth ಹರಿವನ್ನು ಪೂರ್ಣಗೊಳಿಸಲು ವಿಫಲವಾಗಿದೆ
lv: Neizdevās pabeigt OAuth plūsmu
mk: Неуспешно завршување на OAuth протокот
sv: Misslyckades att slutföra OAuth-flöde

source: User is already registered with this e-mail address.
be: Карыстальнік ужо зарэгістраваны з гэтым адрасам электроннай пошты.
ca: L'usuari ja està registrat amb aquesta adreça de correu electrònic.
el: Ο χρήστης είναι ήδη εγγεγραμμένος με αυτή τη διεύθυνση email.
es: El usuario ya está registrado con esta dirección de email.
fi: Käyttäjä on jo rekisteröity tällä sähköpostiosoitteella.
kk: Пайдаланушы бұл эл.пошта мекенжайымен әлдеқашан тіркелген.
kn: ಈ ಇಮೇಲ್ ವಿಳಾಸದೊಂದಿಗೆ ಬಳಕೆದಾರ ಈಗಾಗಲೇ ನೋಂದಾಯಿಸಲಾಗಿದೆ.
lv: Lietotājs jau ir reģistrēts ar šo e-pasta adresi.
mk: Корисник веќе е регистриран со оваа емаил адреса.
sv: Användare är redan registrerad med denna e-postadress.

source: Failed to exchange code for access token
be: Не ўдалося абмяняць код на токен доступу
ca: Ha fallat l'intercanvi de codi per token d'accés
el: Απέτυχε η ανταλλαγή κωδικού για access token
es: Falló al intercambiar código por token de acceso
fi: Koodin vaihtaminen pääsytunnisteeseen epäonnistui
kk: Кодты қол жетімділік токеніне айырбастау сәтсіз аяқталды
kn: ಪ್ರವೇಶ ಟೋಕನ್‌ಗಾಗಿ ಕೋಡ್ ಅನ್ನು ವಿನಿಮಯ ಮಾಡಲು ವಿಫಲವಾಗಿದೆ
lv: Neizdevās apmainīt kodu pret piekļuves žetonu
mk: Неуспешна размена на код за токен за пристап
sv: Misslyckades att växla kod mot åtkomsttoken

source: Authenticate with {} using OAuth2/OpenID Connect authorization code to obtain access tokens.
be: Аўтэнтыфікацыя з {} з выкарыстаннем кода аўтарызацыі OAuth2/OpenID Connect для отрымання токенаў доступу.
ca: Autentica amb {} utilitzant el codi d'autorització OAuth2/OpenID Connect per obtenir tokens d'accés.
el: Πιστοποίηση με {} χρησιμοποιώντας OAuth2/OpenID Connect κωδικό εξουσιοδότησης για απόκτηση access tokens.
es: Autentícate con {} usando código de autorización OAuth2/OpenID Connect para obtener tokens de acceso.
fi: Tunnistaudu {}-palvelun kanssa käyttäen OAuth2/OpenID Connect valtuutuskoodia saadaksesi pääsytunnisteet.
kk: Қол жетімділік токендерін алу үшін {} арқылы OAuth2/OpenID Connect ауторизация кодын пайдаланып аутентификация.
kn: ಪ್ರವೇಶ ಟೋಕನ್‌ಗಳನ್ನು ಪಡೆಯಲು {} ಮೂಲಕ OAuth2/OpenID Connect ಅಧಿಕಾರ ಕೊಡ್ ಅನ್ನು ಬಳಸಿ ದೃಢೀಕರಿಸಿ.
lv: Autentificēties ar {}, izmantojot OAuth2/OpenID Connect autorizācijas kodu, lai iegūtu piekļuves žetonus.
mk: Автентикувај се со {} користејќи OAuth2/OpenID Connect авторизациски код за да добиеш токени за пристап.
sv: Autentisera med {} med hjälp av OAuth2/OpenID Connect-auktoriseringskod för att erhålla åtkomsttokens.

source: Connect a {} account to the current user's account. This allows the user to login using their existing {} account in the future.
be: Падключыць конт {} да конта бягучага карыстальніка. Гэта дазваляе карыстальніку уваходзіць з выкарыстаннем свайго існуючага конта {} у будучыні.
ca: Connecta un compte {} al compte de l'usuari actual. Això permet a l'usuari iniciar sessió utilitzant el seu compte {} existent en el futur.
el: Σύνδεση ενός {} λογαριασμού με τον τρέχοντα λογαριασμό χρήστη. Αυτό επιτρέπει στον χρήστη να συνδεθεί χρησιμοποιώντας τον υπάρχοντα {} λογαριασμό του στο μέλλον.
es: Conecta una cuenta de {} a la cuenta del usuario actual. Esto permite al usuario iniciar sesión usando su cuenta existente de {} en el futuro.
fi: Yhdistä {}-tili nykyiseen käyttäjätiliin. Tämä mahdollistaa käyttäjän kirjautumisen olemassa olevalla {}-tilillään tulevaisuudessa.
kk: {} есептік жазбаны ағымдағы пайдаланушы есептік жазбасына қосу. Бұл пайдаланушыға болашақта қолданыстағы {} есептік жазбасын пайдаланып кіруге мүмкіндік береді.
kn: {} ಖಾತೆಯನ್ನು ಪ್ರಸ್ತುತ ಬಳಕೆದಾರರ ಖಾತೆಗೆ ಸಂಬಂಧಿಸಿ. ಇದು ಬಳಕೆದಾರರು ಭವಿಷ್ಯದಲ್ಲಿ ಅಸ್ತಿತ್ವದಲ್ಲಿರುವ {} ಖಾತೆಯನ್ನು ಬಳಸಿ ಲಾಗಿನ್ ಮಾಡಲು ಅನುಮತಿಸುತ್ತದೆ.
lv: Savienot {} kontu ar pašreizējā lietotāja kontu. Tas ļauj lietotājam turpmāk pieteikties, izmantojot savu esošo {} kontu.
mk: Поврзи {} сметка со сметката на тековниот корисник. Ова овозможува корисникот да се најави користејќи ја својата постоечка {} сметка во иднина.
sv: Anslut ett {}-konto till den aktuella användarens konto. Detta tillåter användaren att logga in med sitt befintliga {}-konto i framtiden.

source: Requires authentication and a valid OAuth2/OpenID Connect authorization code from {}.
be: Патрабуе аўтэнтыфікацыі і дзейнага кода аўтарызацыі OAuth2/OpenID Connect ад {}.
ca: Requereix autenticació i un codi d'autorització OAuth2/OpenID Connect vàlid de {}.
el: Απαιτεί πιστοποίηση και έγκυρο OAuth2/OpenID Connect κωδικό εξουσιοδότησης από {}.
es: Requiere autenticación y un código de autorización OAuth2/OpenID Connect válido de {}.
fi: Vaatii tunnistautumisen ja kelvollisen OAuth2/OpenID Connect valtuutuskoodin {}-palvelusta.
kk: Аутентификация және {} арқылы жарамды OAuth2/OpenID Connect ауторизация кодын талап етеді.
kn: ದೃಢೀಕರಣ ಮತ್ತು {} ನಿಂದ ಮಾನ್ಯವಾದ OAuth2/OpenID Connect ಅಧಿಕಾರ ಕೊಡ್ ಅಗತ್ಯವಿದೆ.
lv: Nepieciešama autentifikācija un derīgs OAuth2/OpenID Connect autorizācijas kods no {}.
mk: Бара автентикација и валиден OAuth2/OpenID Connect авторизациски код од {}.
sv: Kräver autentisering och en giltig OAuth2/OpenID Connect-auktoriseringskod från {}.

source: On success, the {} account is linked and can be used for future logins.
be: Пры паспяховай аперацыі конт {} будзе павязаны і можа быць выкарыстаны для будучых уваходаў.
ca: En cas d'èxit, el compte {} es vincula i es pot utilitzar per a futurs inicis de sessió.
el: Επιτυχώς, ο {} λογαριασμός συνδέεται και μπορεί να χρησιμοποιηθεί για μελλοντικές συνδέσεις.
es: Si es exitoso, la cuenta de {} se vincula y puede usarse para futuros inicios de sesión.
fi: Onnistumisen jälkeen {}-tili on yhdistetty ja sitä voidaan käyttää tuleviin kirjautumisiin.
kk: Сәтті болған жағдайда, {} есептік жазбасы байланысты және болашақ кірулер үшін пайдаланылуы мүмкін.
kn: ಯಶಸ್ಸಿನ ಮೇಲೆ, {} ಖಾತೆಯನ್ನು ಲಿಂಕ್ ಮಾಡಲಾಗಿದೆ ಮತ್ತು ಭವಿಷ್ಯದ ಲಾಗಿನ್‌ಗಳಿಗೆ ಬಳಸಬಹುದು.
lv: Veiksmīgas darbības gadījumā {} konts tiek saistīts un to var izmantot turpmākajām pieteikšanās reizēm.
mk: При успех, {} сметката е поврзана и може да се користи за идни најавувања.
sv: Vid framgång länkas {}-kontot och kan användas för framtida inloggningar.

source: List all social accounts connected to the current user. Shows account details including provider, UID, and connection dates.
be: Спіс усіх сацыяльных контаў, падключаных да бягучага карыстальніка. Паказвае падрабязнасці конта, уключаючы пастаўшчыка, UID і даты падключэння.
ca: Llista tots els comptes socials connectats a l'usuari actual. Mostra els detalls del compte incloent proveïdor, UID i dates de connexió.
el: Λίστα όλων των κοινωνικών λογαριασμών που συνδέονται με τον τρέχοντα χρήστη. Εμφανίζει λεπτομέρειες λογαριασμού συμπεριλαμβανομένου του παρόχου, UID και ημερομηνίες σύνδεσης.
es: Lista todas las cuentas sociales conectadas al usuario actual. Muestra detalles de la cuenta incluyendo proveedor, UID y fechas de conexión.
fi: Listaa kaikki nykyiseen käyttäjään yhdistetyt sosiaalisen median tilit. Näyttää tilin tiedot mukaan lukien palveluntarjoaja, UID ja yhdistämispäivät.
kk: Ағымдағы пайдаланушыға қосылған барлық әлеуметтік есептік жазбаларды тізімдеу. Провайдер, UID және қосылу күндерін қоса алғанда есептік жазба толық ақпаратын көрсетеді.
kn: ಪ್ರಸ್ತುತ ಬಳಕೆದಾರರೆ ಸಂಬಂಧಿಸಿದ ಎಲ್ಲಾ ಸಾಮಾಜಿಕ ಖಾತೆಗಳನ್ನು ಪಟ್ಟಿ ಮಾಡಿ. ಪ್ರೊವೈಡರ್, UID, ಮತ್ತು ಸಂಬಂಧ ದಿನಾಂಕಗಳನ್ನು ಒಳಗೊಂಡ ಖಾತೆ ವಿವರಗಳನ್ನು ತೊರಿಸುತ್ತದೆ.
lv: Uzskaita visus sociālos kontus, kas savienoti ar pašreizējo lietotāju. Rāda konta detaļas, ieskaitot nodrošinātāju, UID un savienojuma datumus.
mk: Листа на сите социјални сметки поврзани со тековниот корисник. Покажува детали за сметката вклучувајќи давател, UID и датуми на поврзување.
sv: Lista alla sociala konton anslutna till den aktuella användaren. Visar kontodetaljer inklusive leverantör, UID och anslutningsdatum.

source: Disconnect a social account from the current user. Removes the social account connection and prevents future logins via that provider. Requires authentication and the account must belong to the current user.
be: Адключыць сацыяльны конт ад бягучага карыстальніка. Выдаляе падключэнне сацыяльнага конта і прадухіляе будучыя уваходы чраз гэтага пастаўшчыка. Патрабуе аўтэнтыфікацыі і конт павінен належаць бягучаму карыстальніку.
ca: Desconnecta un compte social de l'usuari actual. Elimina la connexió del compte social i impedeix futurs inicis de sessió a través d'aquest proveïdor. Requereix autenticació i el compte ha de pertànyer a l'usuari actual.
el: Αποσύνδεση ενός κοινωνικού λογαριασμού από τον τρέχοντα χρήστη. Αφαιρεί τη σύνδεση του κοινωνικού λογαριασμού και αποτρέπει μελλοντικές συνδέσεις μέσω αυτού του παρόχου. Απαιτεί πιστοποίηση και ο λογαριασμός πρέπει να ανήκει στον τρέχοντα χρήστη.
es: Desconecta una cuenta social del usuario actual. Elimina la conexión de la cuenta social y previene futuros inicios de sesión vía ese proveedor. Requiere autenticación y la cuenta debe pertenecer al usuario actual.
fi: Katkaise sosiaalisen median tilin yhteys nykyisestä käyttäjästä. Poistaa sosiaalisen median tilin yhteyden ja estää tulevat kirjautumiset kyseisen palveluntarjoajan kautta. Vaatii tunnistautumisen ja tilin on kuuluttava nykyiselle käyttäjälle.
kk: Ағымдағы пайдаланушыдан әлеуметтік есептік жазбаны ажырату. Әлеуметтік есептік жазба қосылымын жояды және сол провайдер арқылы болашақ кірулерді болдырмауды болдырады. Аутентификация қажет және есептік жазба ағымдағы пайдаланушыға телсуі тиіс.
kn: ಪ್ರಸ್ತುತ ಬಳಕೆದಾರರಿಂದ ಸಾಮಾಜಿಕ ಖಾತೆಯನ್ನು ವಿಲಗಿಸಿ. ಸಾಮಾಜಿಕ ಖಾತೆ ಸಂಬಂಧವನ್ನು ತೆಗೆದು ಮತ್ತು ಆ ಪ್ರೊವೈಡರ್ ಮೂಲಕ ಭವಿಷ್ಯದ ಲಾಗಿನ್‌ಗಳನ್ನು ತಡೆಯುತ್ತದೆ. ದೃಢೀಕರಣ ಅಗತ್ಯವಿದೆ ಮತ್ತು ಖಾತೆಯು ಪ್ರಸ್ತುತ ಬಳಕೆದಾರರೆ ಸಂಬಂಧಿಸಿದಿರಬೇಕು.
lv: Atvienot sociālo kontu no pašreizējā lietotāja. Noņem sociālā konta savienojumu un novērš turpmāko pieteikšanos caur šo nodrošinātāju. Nepieciešama autentifikācija un kontam jāpieder pašreizējam lietotājam.
mk: Исклучи социјална сметка од тековниот корисник. Ја отстранува врската со социјалната сметка и спречува идни најавувања преку тој давател. Бара автентикација и сметката мора да му припаѓа на тековниот корисник.
sv: Koppla från ett socialt konto från den aktuella användaren. Tar bort den sociala kontoanslutningen och förhindrar framtida inloggningar via den leverantören. Kräver autentisering och kontot måste tillhöra den aktuella användaren.

source: adapter_class is not defined
be: adapter_class не вызначаны
ca: adapter_class no està definida
el: Το adapter_class δεν είναι ορισμένο
es: adapter_class no está definido
fi: adapter_class ei ole määritelty
kk: adapter_class анықталмаған
kn: adapter_class ಅನ್ನು ವ್ಯಾಖ್ಯಾನಿಸಲಾಗಿಲ್ಲ
lv: adapter_class nav definēts
mk: adapter_class не е дефиниран
sv: adapter_class är inte definierad

source: Refresh token was not included in cookie data.
be: Токен абнаўлення не быў уключаны ў дадзеныя кукі.
ca: El token d'actualització no s'ha inclòs en les dades de la galeta.
el: Το refresh token δεν περιλαμβάνονταν στα δεδομένα cookie.
es: El token de actualización no fue incluido en los datos de la cookie.
fi: Päivitystunnistetta ei sisällytetty evästetietoihin.
kk: Жаңарту токені куки деректеріне енгізілмеген.
kn: ನವೀಕರಣ ಟೋಕನ್ ಅನ್ನು ಕುಕೀ ಡೇಟಾದಲ್ಲಿ ಸೇರಿಸಲಾಗಿಲ್ಲ.
lv: Atjaunošanas žetons nebija iekļauts sīkdatņu datos.
mk: Токенот за освежување не беше вклучен во податоците на колачето.
sv: Uppdateringstoken var inte inkluderad i cookiedata.

source: Refresh token was not included in request data.
be: Токен абнаўлення не быў уключаны ў дадзеныя запыту.
ca: El token d'actualització no s'ha inclòs en les dades de la petició.
el: Το refresh token δεν περιλαμβάνονταν στα δεδομένα αιτήματος.
es: El token de actualización no fue incluido en los datos de la solicitud.
fi: Päivitystunnistetta ei sisällytetty pyyntötietoihin.
kk: Жаңарту токені сұрау деректеріне енгізілмеген.
kn: ನವೀಕರಣ ಟೋಕನ್ ಅನ್ನು ವಿನಂತಿ ಡೇಟಾದಲ್ಲಿ ಸೇರಿಸಲಾಗಿಲ್ಲ.
lv: Atjaunošanas žetons nebija iekļauts pieprasījuma datos.
mk: Токенот за освежување не беше вклучен во податоците на барањето.
sv: Uppdateringstoken var inte inkluderad i förfrågningsdata.

source: An error has occurred.
be: Адбылася памылка.
ca: S'ha produït un error.
el: Παρουσιάστηκε σφάλμα.
es: Ha ocurrido un error.
fi: Virhe on tapahtunut.
kk: Қате орын алды.
kn: ಒಂದು ದೋಷ ಸಂಭವಿಸಿದೆ.
lv: Radusies kļūda.
mk: Се случи грешка.
sv: Ett fel har uppstått.

source: Successfully logged out.
be: Паспяхова выйшлі.
ca: Sessió tancada correctament.
el: Επιτυχής αποσύνδεση.
es: Sesión cerrada exitosamente.
fi: Kirjauduit ulos onnistuneesti.
kk: Сәтті шығу.
kn: ಯಶಸ್ವಿಯಾಗಿ ಲಾಗ್‌ಔಟ್ ಆಗಿದೆ.
lv: Sekmīgi atteikts.
mk: Успешно одјавен.
sv: Framgångsrikt utloggad.

source: Password reset e-mail has been sent.
be: Электронны ліст скіду пароля быў адпраўлены.
ca: S'ha enviat un correu de restabliment de contrasenya.
el: Το email επαναφοράς κωδικού πρόσβασης έχει αποσταλεί.
es: Se ha enviado el email de restablecimiento de contraseña.
fi: Salasanan nollaussähköposti on lähetetty.
kk: Құпия сөзді қалпына келтіру эл.поштасы жіберілді.
kn: ಗುಪ್ತಪದ ಮರುಹೊಂದಿಸುವ ಇಮೇಲ್ ಕಳುಹಿಸಲಾಗಿದೆ.
lv: Paroles atiestatīšanas e-pasts ir nosūtīts.
mk: Емаил за ресетирање на лозинка е испратен.
sv: E-post för lösenordsåterställning har skickats.

source: Password has been reset with the new password.
be: Пароль быў скінуты з новым паролем.
ca: La contrasenya s'ha restablert amb la nova contrasenya.
el: Ο κωδικός πρόσβασης έχει επαναφερθεί με τον νέο κωδικό πρόσβασης.
es: La contraseña ha sido restablecida con la nueva contraseña.
fi: Salasana on nollattu uudella salasanalla.
kk: Құпия сөз жаңа құпия сөзбен қалпына келтірілді.
kn: ಹೊಸ ಗುಪ್ತಪದದೊಂದಿಗೆ ಗುಪ್ತಪದವನ್ನು ಮರುಹೊಂದಿಸಲಾಗಿದೆ.
lv: Parole ir atiestatīta ar jauno paroli.
mk: Лозинката е ресетирана со новата лозинка.
sv: Lösenordet har återställts med det nya lösenordet.

source: New password has been saved.
be: Новы пароль быў захаваны.
ca: La nova contrasenya s'ha desat.
el: Ο νέος κωδικός πρόσβασης έχει αποθηκευτεί.
es: La nueva contraseña ha sido guardada.
fi: Uusi salasana on tallennettu.
kk: Жаңа құпия сөз сақталды.
kn: ಹೊಸ ಗುಪ್ತಪದವನ್ನು ಉಳಿಸಲಾಗಿದೆ.
lv: Jaunā parole ir saglabāta.
mk: Новата лозинка е зачувана.
sv: Nytt lösenord har sparats.

source: Verification e-mail sent.
be: Электронны ліст верыфікацыі адпраўлены.
ca: Correu de verificació enviat.
el: Το email επιβεβαίωσης έχει αποσταλεί.
es: Email de verificación enviado.
fi: Vahvistussähköposti lähetetty.
kk: Растау эл.поштасы жіберілді.
kn: ಪರಿಶೀಲನಾ ಇಮೇಲ್ ಕಳುಹಿಸಲಾಗಿದೆ.
lv: Verifikācijas e-pasts nosūtīts.
mk: Емаил за верификација испратен.
sv: Verifierings-e-post skickad.

source: Successfully registered.
be: Паспяхова зарэгістраваны.
ca: Registrat correctament.
el: Επιτυχής εγγραφή.
es: Registrado exitosamente.
fi: Rekisteröityminen onnistui.
kk: Сәтті тіркелді.
kn: ಯಶಸ್ವಿಯಾಗಿ ನೋಂದಾಯಿಸಲಾಗಿದೆ.
lv: Sekmīgi reģistrēts.
mk: Успешно регистриран.
sv: Framgångsrikt registrerad.

source: ok
be: добра
ca: d'acord
el: εντάξει
kk: жарайды
kn: ಸರಿ
lv: labi
mk: во ред

source: Personal info
be: Асабістая інфармацыя
ca: Informació personal
el: Προσωπικά στοιχεία
es: Información personal
fi: Henkilötiedot
kk: Жеке ақпарат
kn: ವೈಯಕ್ತಿಕ ಮಾಹಿತಿ
lv: Personīgā informācija
mk: Лични информации
sv: Personlig information

source: Permissions
be: Дазволы
ca: Permisos
el: Δικαιώματα
es: Permisos
fi: Oikeudet
kk: Рұқсаттар
kn: ಅನುಮತಿಗಳು
lv: Atļaujas
mk: Дозволи
sv: Behörigheter

source: Important dates
be: Важныя даты
ca: Dates important
el: Σημαντικές ημερομηνίες
es: Fechas importantes
fi: Tärkeät päivämäärät
kk: Маңызды күндер
kn: ಪ್ರಮುಖ ದಿನಾಂಕಗಳು
lv: Svarīgi datumi
mk: Важни датуми
sv: Viktiga datum
