Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.3-py3-none-any.whl/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: be, ca, el, es, fi, kk, kn, lv, mk, sv

source: Send a new email verification message to unverified email addresses. Only works for email addresses that are registered but not yet verified.
be: Адправіць новае паведамленне верыфікацыі электроннай пошты на неправераныя адрасы. Працуе толькі для адрасоў электроннай пошты, якія зарэгістраваны, але яшчэ не правераны.
ca: Envia un nou missatge de verificació de correu a adreces de correu no verificades. Només funciona per a adreces de correu registrades però encara no verificades.
el: Αποστολή νέου μηνύματος επιβεβαίωσης email σε μη επιβεβαιωμένες διευθύνσεις email. Λειτουργεί μόνο για διευθύνσεις email που είναι εγγεγραμμένες αλλά δεν έχουν επιβεβαιωθεί ακόμη.
es: Envía un nuevo mensaje de verificación por email a direcciones de email no verificadas. Solo funciona para direcciones de email registradas pero aún no verificadas.
fi: Lähetä uusi sähköpostin vahvistusviesti vahvistamattomiin sähköpostiosoitteisiin. Toimii vain sähköpostiosoitteille, jotka on rekisteröity mutta ei vielä vahvistettu.
kk: Расталмаған эл.пошта мекенжайларына жаңа эл.пошта растау хабарын жіберу. Тек тіркелген, бірақ әлі расталмаған эл.пошта мекенжайлары үшін жұмыс істейді.
kn: ಪರಿಶೀಲಿಸದ ಇಮೇಲ್ ವಿಳಾಸಗಳಿಗೆ ಹೊಸ ಇಮೇಲ್ ಪರಿಶೀಲನಾ ಸಂದೇಶವನ್ನು ಕಳುಹಿಸಿ. ನೋಂದಾಯಿಸಿದ ಆದರೆ ಇನ್ನೂ ಪರಿಶೀಲಿಸದ ಇಮೇಲ್ ವಿಳಾಸಗಳಿಗೆ ಮಾತ್ರ ಕಾರ್ಯನಿರ್ವಹಿಸುತ್ತದೆ.
lv: Sūtīt jaunu e-pasta verifikācijas ziņojumu uz neapstiprinātām e-pasta adresēm. Darbojas tikai e-pasta adresēm, kas ir reģistrētas, bet vēl nav apstiprinātas.
mk: Испрати нова порака за верификација на емаил до неверифицирани емаил адреси. Работи само за емаил адреси кои се регистрирани но уште не се верифицирани.
sv: Skicka ett nytt e-postverifieringsmeddelande till overifierade e-postadresser. Fungerar endast för e-postadresser som är registrerade men ännu inte verifierade.

source: Retrieve the authenticated user's profile information including username, email, first name, and last name. Password fields are excluded.
be: Атрымаць інфармацыю профілю аўтэнтыфікаванага карыстальніка, уключаючы імя карыстальніка, электронную пошту, імя і прозвішча. Палі пароля выключаны.
ca: Recupera la informació del perfil de l'usuari autenticat incloent nom d'usuari, correu electrònic, nom i cognoms. Els camps de contrasenya s'exclouen.
el: Ανάκτηση των στοιχείων προφίλ του πιστοποιημένου χρήστη συμπεριλαμβανομένων του ονόματος χρήστη, email, μικρού ονόματος και επιθέτου. Τα πεδία κωδικού πρόσβασης εξαιρούνται.
es: Recupera la información de perfil del usuario autenticado incluyendo nombre de usuario, email, nombre y apellido. Los campos de contraseña están excluidos.
fi: Hae tunnistautuneen käyttäjän profiilin tiedot mukaan lukien käyttäjänimi, sähköposti, etunimi ja sukunimi. Salasanakentät on jätetty pois.
kk: Пайдаланушы аты, эл.пошта, аты және тегі қоса алғанда, аутентификацияланған пайдаланушының профиль ақпаратын алу. Құпия сөз өрістері қосылмаған.
kn: ಬಳಕೆದಾರ ಹೆಸರು, ಇಮೇಲ್, ಮೊದಲ ಹೆಸರು ಮತ್ತು ಕೊನೆಯ ಹೆಸರು ಸೇರಿದಂತೆ ದೃಢೀಕರಿಸಿದ ಬಳಕೆದಾರರ ಪ್ರೊಫೈಲ್ ಮಾಹಿತಿಯನ್ನು ಪಡೆಯಿರಿ. ಗುಪ್ತಪದ ಕ್ಷೇತ್ರಗಳನ್ನು ಹೊರಗಿಡಲಾಗಿದೆ.
lv: Iegūt autentificētā lietotāja profila informāciju, ieskaitot lietotājvārdu, e-pastu, vārdu un uzvārdu. Paroles lauki nav iekļauti.
mk: Преземи ги информациите за профилот на автентикуваниот корисник вклучувајќи корисничко име, емаил, име и презиме. Полињата за лозинка се исклучени.
sv: Hämtar den autentiserade användarens profilinformation inklusive användarnamn, e-post, förnamn och efternamn. Lösenordsfält är undantagna.

source: Update the authenticated user's profile information. Allows modification of username, first name, and last name. Email field is read-only for security.
be: Абнавіць інфармацыю профілю аўтэнтыфікаванага карыстальніка. Дазваляе змяненне імя карыстальніка, імя і прозвішча. Поле электроннай пошты толькі для чытання дзеля бяспекі.
ca: Actualitza la informació del perfil de l'usuari autenticat. Permet la modificació del nom d'usuari, nom i cognoms. El camp de correu és només de lectura per seguretat.
el: Ενημέρωση των στοιχείων προφίλ του πιστοποιημένου χρήστη. Επιτρέπει τροποποίηση του ονόματος χρήστη, μικρού ονόματος και επιθέτου. Το πεδίο email είναι μόνο για ανάγνωση για λόγους ασφαλείας.
es: Actualiza la información de perfil del usuario autenticado. Permite modificar nombre de usuario, nombre y apellido. El campo de email es solo lectura por seguridad.
fi: Päivitä tunnistautuneen käyttäjän profiilin tiedot. Sallii käyttäjänimen, etunimen ja sukunimen muokkaamisen. Sähköpostikenttä on vain luku turvallisuussyistä.
kk: Аутентификацияланған пайдаланушының профиль ақпаратын жаңарту. Пайдаланушы аты, аты және тегін өзгертуге мүмкіндік береді. Эл.пошта өрісі қауіпсіздік үшін тек оқуға арналған.
kn: ದೃಢೀಕರಿಸಿದ ಬಳಕೆದಾರರ ಪ್ರೊಫೈಲ್ ಮಾಹಿತಿಯನ್ನು ನವೀಕರಿಸಿ. ಬಳಕೆದಾರ ಹೆಸರು, ಮೊದಲ ಹೆಸರು ಮತ್ತು ಕೊನೆಯ ಹೆಸರಿನ ಮಾರ್ಪಾಡನ್ನು ಅನುಮತಿಸುತ್ತದೆ. ಭದ್ರತೆಗಾಗಿ ಇಮೇಲ್ ಕ್ಷೇತ್ರವು ಓದಲು ಮಾತ್ರ.
lv: Atjaunot autentificētā lietotāja profila informāciju. Ļauj modificēt lietotājvārdu, vārdu un uzvārdu. E-pasta lauks ir tikai lasāms drošības nolūkos.
mk: Ажурирај ги информациите за профилот на автентикуваниот корисник. Овозможува модификација на корисничкото име, име и презиме. Полето за емаил е само за читање поради безбедност.
sv: Uppdaterar den autentiserade användarens profilinformation. Tillåter modifiering av användarnamn, förnamn och efternamn. E-postfältet är skrivskyddat av säkerhetsskäl.

source: Partially update the authenticated user's profile information. Only provided fields will be updated. Email field is read-only.
be: Часткова абнавіць інфармацыю профілю аўтэнтыфікаванага карыстальніка. Будуць абноўлены толькі пададзеныя палі. Поле электроннай пошты толькі для чытання.
ca: Actualitza parcialment la informació del perfil de l'usuari autenticat. Només s'actualitzaran els camps proporcionats. El camp de correu és només de lectura.
el: Μερική ενημέρωση των στοιχείων προφίλ του πιστοποιημένου χρήστη. Μόνο τα πεδία που παρασχέθηκαν θα ενημερωθούν. Το πεδίο email είναι μόνο για ανάγνωση.
es: Actualiza parcialmente la información de perfil del usuario autenticado. Solo se actualizarán los campos proporcionados. El campo de email es solo lectura.
fi: Päivitä osittain tunnistautuneen käyttäjän profiilin tiedot. Vain annetut kentät päivitetään. Sähköpostikenttä on vain luku.
kk: Аутентификацияланған пайдаланушының профиль ақпаратын жартылай жаңарту. Тек берілген өрістер жаңартылады. Эл.пошта өрісі тек оқуға арналған.
kn: ದೃಢೀಕರಿಸಿದ ಬಳಕೆದಾರರ ಪ್ರೊಫೈಲ್ ಮಾಹಿತಿಯನ್ನು ಭಾಗಶಃ ನವೀಕರಿಸಿ. ಒದಗಿಸಿದ ಕ್ಷೇತ್ರಗಳನ್ನು ಮಾತ್ರ ನವೀಕರಿಸಲಾಗುತ್ತದೆ. ಇಮೇಲ್ ಕ್ಷೇತ್ರವು ಓದಲು ಮಾತ್ರ.
lv: Daļēji atjaunot autentificētā lietotāja profila informāciju. Tikai norādītie lauki tiks atjaunoti. E-pasta lauks ir tikai lasāms.
mk: Делумно ажурирај ги информациите за профилот на автентикуваниот корисник. Само обезбедените полиња ќе се ажурираат. Полето за емаил е само за читање.
sv: Delvis uppdatera den autentiserade användarens profilinformation. Endast angivna fält kommer att uppdateras. E-postfältet är skrivskyddat.

source: The email address is not assigned to any user account.
be: Адрас электроннай пошты не прызначаны ніякому карыстальніцкаму конту.
ca: L'adreça de correu electrònic no està assignada a cap compte d'usuari.
el: Η διεύθυνση email δεν είναι αντιστοιχισμένη σε κανένα λογαριασμό χρήστη.
es: La dirección de email no está asignada a ninguna cuenta de usuario.
fi: Sähköpostiosoitetta ei ole liitetty mihinkään käyttäjätiliin.
kk: Эл.пошта мекенжайы ешбір пайдаланушы есептік жазбасына тағайындалмаған.
kn: ಇಮೇಲ್ ವಿಳಾಸವನ್ನು ಯಾವುದೇ ಬಳಕೆದಾರ ಖಾತೆಗೆ ನಿಯೋಜಿಸಲಾಗಿಲ್ಲ.
lv: E-pasta adrese nav piešķirta nevienam lietotāja kontam.
mk: Емаил адресата не е доделена на ниедна корисничка сметка.
sv: E-postadressen är inte tilldelad till något användarkonto.

source: Requested MFA method does not exist.
be: Запытаны метад MFA не існуе.
ca: El mètode MFA sol·licitat no existeix.
el: Η ζητημένη μέθοδος MFA δεν υπάρχει.
es: El método MFA solicitado no existe.
fi: Pyydettyä MFA-menetelmää ei ole olemassa.
kk: Сұралған MFA әдісі жоқ.
kn: ವಿನಂತಿಸಿದ MFA ವಿಧಾನ ಅಸ್ತಿತ್ವದಲ್ಲಿಲ್ಲ.
lv: Pieprasītā MFA metode neeksistē.
mk: Барањата MFA метода не постои.
sv: Begärd MFA-metod existerar inte.

source: Email message with MFA code has been sent.
be: Электронны ліст з MFA-кодам адпраўлены.
ca: S'ha enviat un missatge de correu amb el codi MFA.
el: Το email με τον κωδικό MFA έχει αποσταλεί.
es: Se ha enviado el mensaje de email con el código MFA.
fi: Sähköpostiviesti MFA-koodilla on lähetetty.
kk: MFA кодымен эл.пошта хабары жіберілді.
kn: MFA ಕೋಡ್‌ನೊಂದಿಗೆ ಇಮೇಲ್ ಸಂದೇಶವನ್ನು ಕಳುಹಿಸಲಾಗಿದೆ.
lv: E-pasta ziņojums ar MFA kodu ir nosūtīts.
mk: Емаил порака со MFA код е испратена.
sv: E-postmeddelande med MFA-kod har skickats.

source: MFA code expires in {} seconds.
be: MFA-код заканчваецца праз {} секунд.
ca: El codi MFA expira en {} segons.
el: Ο κωδικός MFA λήγει σε {} δευτερόλεπτα.
es: El código MFA expira en {} segundos.
fi: MFA-koodi vanhenee {} sekunnin kuluttua.
kk: MFA кодының мерзімі {} секундтан кейін аяқталады.
kn: MFA ಕೋಡ್ {} ಸೆಕೆಂಡುಗಳಲ್ಲಿ ಅವಧಿ ಮುಗಿಯುತ್ತದೆ.
lv: MFA kods beidzas pēc {} sekundēm.
mk: MFA кодот истекува за {} секунди.
sv: MFA-kod går ut om {} sekunder.

source: First step of MFA-enabled authentication. Validates credentials and initiates MFA flow.
be: Першы крок аўтэнтыфікацыі з уключаным MFA. Правярае ўліковыя дадзеныя і пачынае MFA-паток.
ca: Primer pas de l'autenticació amb MFA habilitada. Valida les credencials i inicia el flux MFA.
el: Πρώτο βήμα της πιστοποίησης με ενεργοποιημένο MFA. Επικυρώνει τα διαπιστευτήρια και ξεκινά τη ροή MFA.
es: Primer paso de autenticación con MFA habilitada. Valida credenciales e inicia el flujo MFA.
fi: MFA-tunnistautumisen ensimmäinen vaihe. Validoi tunnistetiedot ja aloittaa MFA-prosessin.
kk: MFA қосылған аутентификацияның бірінші қадамы. Дәйектемелерді тексереді және MFA ағынын бастайды.
kn: MFA-ಸಕ್ರಿಯಗೊಳಿಸಿದ ದೃಢೀಕರಣದ ಮೊದಲ ಹಂತ. ಅರ್ಹತೆಗಳನ್ನು ಮಾನ್ಯಗೊಳಿಸುತ್ತದೆ ಮತ್ತು MFA ಹರಿವನ್ನು ಪ್ರಾರಂಭಿಸುತ್ತದೆ.
lv: Pirmais MFA-iespējotās autentifikācijas solis. Validē akreditācijas datus un uzsāk MFA plūsmu.
mk: Прв чекор на MFA-овозможена автентикација. Ги валидира акредитивите и го иницира MFA протокот.
sv: Första steget av MFA-aktiverad autentisering. Validerar referenser och initierar MFA-flöde.

source: Returns ephemeral token for MFA verification or complete {} if MFA is disabled.
be: Вяртае часовы токен для MFA-верыфікацыі або поўны {}, калі MFA адключаны.
ca: Retorna un token efímer per a la verificació MFA o {} complets si MFA està desactivada.
el: Επιστρέφει προσωρινό token για επιβεβαίωση MFA ή ολοκληρωμένα {} εάν το MFA είναι απενεργοποιημένο.
es: Devuelve token efímero para verificación MFA o {} completo si MFA está deshabilitada.
fi: Palauttaa tilapäisen tunnisteen MFA-vahvistusta varten tai täydelliset {}, jos MFA on poistettu käytöstä.
kk: MFA тексеруі үшін уақытша токенді немесе MFA өшірілген болса толық {} қайтарады.
kn: MFA ಪರಿಶೀಲನೆಗಾಗಿ ಅಸ್ಥಾಯಿ ಟೋಕನ್ ಅನ್ನು ಹಿಂದಿರುಗಿಸುತ್ತದೆ ಅಥವಾ MFA ನಿಷ್ಕ್ರಿಯಗೊಳಿಸಿದ್ದರೆ ಪೂರ್ಣ {} ಅನ್ನು ಹಿಂದಿರುಗಿಸುತ್ತದೆ.
lv: Atgriež īslaicīgu žetonu MFA verifikācijai vai pilnu {}, ja MFA ir atspējots.
mk: Враќа привремен токен за MFA верификација или комплетен {} ако MFA е оневозможен.
sv: Returnerar tillfällig token för MFA-verifiering eller kompletta {} om MFA är inaktiverad.

source: Complete MFA authentication using verification code and ephemeral token.
be: Завяршыць MFA-аўтэнтыфікацыю з выкарыстаннем кода верыфікацыі і часовага токена.
ca: Completa l'autenticació MFA utilitzant el codi de verificació i el token efímer.
el: Ολοκλήρωση πιστοποίησης MFA χρησιμοποιώντας κωδικό επιβεβαίωσης και προσωρινό token.
es: Completa la autenticación MFA usando código de verificación y token efímero.
fi: Viimeistele MFA-tunnistautuminen käyttäen vahvistuskoodia ja tilapäistä tunnistetta.
kk: Растау кодын және уақытша токенді пайдаланып MFA аутентификацияны аяқтау.
kn: ಪರಿಶೀಲನಾ ಕೋಡ್ ಮತ್ತು ಅಸ್ಥಾಯಿ ಟೋಕನ್ ಅನ್ನು ಬಳಸಿ MFA ದೃಢೀಕರಣವನ್ನು ಪೂರ್ಣಗೊಳಿಸಿ.
lv: Pabeigt MFA autentifikāciju, izmantojot verifikācijas kodu un īslaicīgu žetonu.
mk: Заврши ја MFA автентикацијата користејќи код за верификација и привремен токен.
sv: Slutför MFA-autentisering med hjälp av verifieringskod och tillfällig token.

source: Supports both TOTP codes and backup codes for verification.
be: Падтрымлівае як TOTP-коды, так і рэзервовыя коды для верыфікацыі.
ca: Suporta tant codis TOTP com codis de còpia de seguretat per a la verificació.
el: Υποστηρίζει τόσο κωδικούς TOTP όσο και κωδικούς εφεδρείας για επιβεβαίωση.
es: Soporta tanto códigos TOTP como códigos de respaldo para verificación.
fi: Tukee sekä TOTP-koodeja että varmuuskoodeja vahvistusta varten.
kk: Растау үшін TOTP кодтары мен резервті кодтарды қолдайды.
kn: ಪರಿಶೀಲನೆಗಾಗಿ TOTP ಕೋಡ್‌ಗಳು ಮತ್ತು ಬ್ಯಾಕಪ್ ಕೋಡ್‌ಗಳೆರಡನ್ನೂ ಬೆಂಬಲಿಸುತ್ತದೆ.
lv: Atbalsta gan TOTP kodus, gan rezerves kodus verifikācijai.
mk: Поддржува и TOTP кодови и резервни кодови за верификација.
sv: Stöder både TOTP-koder och reservkoder för verifiering.

source: Switch to a different MFA method during authentication flow.
be: Пераключыцца на іншы метад MFA падчас патоку аўтэнтыфікацыі.
ca: Canvia a un mètode MFA diferent durant el flux d'autenticació.
el: Αλλαγή σε διαφορετική μέθοδο MFA κατά τη ροή πιστοποίησης.
es: Cambia a un método MFA diferente durante el flujo de autenticación.
fi: Vaihda toiseen MFA-menetelmään tunnistautumisprosessin aikana.
kk: Аутентификация ағыны кезінде басқа MFA әдісіне ауысу.
kn: ದೃಢೀಕರಣ ಹರಿವಿನ ಸಮಯದಲ್ಲಿ ಬೇರೆ MFA ವಿಧಾನಕ್ಕೆ ಬದಲಾಯಿಸಿ.
lv: Pārslēgties uz citu MFA metodi autentifikācijas plūsmas laikā.
mk: Префрли на различна MFA метода за време на протокот на автентикација.
sv: Byt till en annan MFA-metod under autentiseringsflödet.

source: Requires valid ephemeral token from first step authentication.
be: Патрабуе дзейны часовы токен з першага крока аўтэнтыфікацыі.
ca: Requereix un token efímer vàlid del primer pas d'autenticació.
el: Απαιτεί έγκυρο προσωρινό token από την πιστοποίηση πρώτου βήματος.
es: Requiere token efímero válido del primer paso de autenticación.
fi: Vaatii voimassa olevan tilapäisen tunnisteen ensimmäisen vaiheen tunnistautumisesta.
kk: Бірінші қадам аутентификациясынан жарамды уақытша токен қажет.
kn: ಮೊದಲ ಹಂತದ ದೃಢೀಕರಣದಿಂದ ಮಾನ್ಯವಾದ ಅಸ್ಥಾಯಿ ಟೋಕನ್ ಅಗತ್ಯವಿದೆ.
lv: Nepieciešams derīgs īslaicīgs žetons no pirmā soļa autentifikācijas.
mk: Бара валиден привремен токен од автентикацијата на првиот чекор.
sv: Kräver giltig tillfällig token från första steget autentisering.

source: New ephemeral token expires in {} seconds.
be: Новы часовы токен заканчваецца праз {} секунд.
ca: El nou token efímer expira en {} segons.
el: Το νέο προσωρινό token λήγει σε {} δευτερόλεπτα.
es: El nuevo token efímero expira en {} segundos.
fi: Uusi tilapäinen tunniste vanhenee {} sekunnin kuluttua.
kk: Жаңа уақытша токеннің мерзімі {} секундтан кейін аяқталады.
kn: ಹೊಸ ಅಸ್ಥಾಯಿ ಟೋಕನ್ {} ಸೆಕೆಂಡುಗಳಲ್ಲಿ ಅವಧಿ ಮುಗಿಯುತ್ತದೆ.
lv: Jaunais īslaicīgais žetons beidzas pēc {} sekundēm.
mk: Новиот привремен токен истекува за {} секунди.
sv: Ny tillfällig token går ut om {} sekunder.

source: Resend MFA verification code using existing ephemeral token.
be: Паўторна адправіць MFA-код верыфікацыі з выкарыстаннем існуючага часовага токена.
ca: Reenvia el codi de verificació MFA utilitzant el token efímer existent.
el: Επαναποστολή κωδικού επιβεβαίωσης MFA χρησιμοποιώντας υπάρχον προσωρινό token.
es: Reenvía el código de verificación MFA usando el token efímero existente.
fi: Lähetä MFA-vahvistuskoodi uudelleen käyttäen olemassa olevaa tilapäistä tunnistetta.
kk: Қолданыстағы уақытша токенді пайдаланып MFA растау кодын қайта жіберу.
kn: ಅಸ್ತಿತ್ವದಲ್ಲಿರುವ ಅಸ್ಥಾಯಿ ಟೋಕನ್ ಅನ್ನು ಬಳಸಿ MFA ಪರಿಶೀಲನಾ ಕೋಡ್ ಅನ್ನು ಮರುಕಳುಹಿಸಿ.
lv: Atkārtoti nosūtīt MFA verifikācijas kodu, izmantojot esošu īslaicīgu žetonu.
mk: Повторно испрати MFA код за верификација користејќи постоечки привремен токен.
sv: Skicka MFA-verifieringskod igen med befintlig tillfällig token.

source: Only applicable for methods that require code dispatch (e.g., email).
be: Прымяняецца толькі для метадаў, якія патрабуюць адпраўкі кода (напрыклад, электронная пошта).
ca: Només aplicable per a mètodes que requereixen enviament de codi (per exemple, correu).
el: Εφαρμόζεται μόνο για μεθόδους που απαιτούν αποστολή κωδικού (π.χ., email).
es: Solo aplicable para métodos que requieren envío de código (ej., email).
fi: Koskee vain menetelmiä, jotka vaativat koodin lähettämisen (esim. sähköposti).
kk: Тек код жіберуді талап ететін әдістер үшін қолданылады (мысалы, эл.пошта).
kn: ಕೋಡ್ ಕಳುಹಿಸುವಿಕೆಯ ಅಗತ್ಯವಿರುವ ವಿಧಾನಗಳಿಗೆ ಮಾತ್ರ ಅನ್ವಯವಾಗುತ್ತದೆ (ಉದಾ., ಇಮೇಲ್).
lv: Attiecas tikai uz metodēm, kas prasa koda nosūtīšanu (piemēram, e-pasts).
mk: Применливо само за методи кои бараат испраќање код (на пример, емаил).
sv: Gäller endast för metoder som kräver kodsändning (t.ex. e-post).

source: List all available MFA methods with their setup and activation status. Shows which methods are configured, active, and set as primary.
be: Спіс усіх даступных метадаў MFA з іх статусам наладкі і актывацыі. Паказвае, якія метады наладжаны, актыўныя і ўстаноўлены як асноўныя.
ca: Llista tots els mètodes MFA disponibles amb el seu estat de configuració i activació. Mostra quins mètodes estan configurats, actius i establerts com a primaris.
el: Λίστα όλων των διαθέσιμων μεθόδων MFA με την κατάσταση ρύθμισης και ενεργοποίησης τους. Εμφανίζει ποιες μέθοδοι είναι ρυθμισμένες, ενεργές και ορισμένες ως κύριες.
es: Lista todos los métodos MFA disponibles con su estado de configuración y activación. Muestra qué métodos están configurados, activos y establecidos como primarios.
fi: Listaa kaikki saatavilla olevat MFA-menetelmät niiden asetukset ja aktivointitila. Näyttää mitkä menetelmät on määritetty, aktiivisia ja asetettu ensisijaisiksi.
kk: Барлық қол жетімді MFA әдістерін олардың орнату және белсендіру мәртебесімен бірге тізімдеу. Қайсы әдістер конфигурацияланған, белсенді және негізгі ретінде орнатылған екенін көрсетеді.
kn: ಅವರ ಸೆಟಪ್ ಮತ್ತು ಸಕ್ರಿಯಗೊಳಿಸುವ ಸ್ಥಿತಿಯೊಂದಿಗೆ ಲಭ್ಯವಿರುವ ಎಲ್ಲಾ MFA ವಿಧಾನಗಳನ್ನು ಪಟ್ಟಿ ಮಾಡಿ. ಯಾವ ವಿಧಾನಗಳನ್ನು ಕಾನ್ಫಿಗರ್ ಮಾಡಲಾಗಿದೆ, ಸಕ್ರಿಯಗೊಳಿಸಲಾಗಿದೆ ಮತ್ತು ಪ್ರಾಥಮಿಕವಾಗಿ ಹೊಂದಿಸಲಾಗಿದೆ ಎಂಬುದನ್ನು ತೋರಿಸುತ್ತದೆ.
lv: Saraksts ar visām pieejamām MFA metodēm ar to iestatīšanas un aktivizēšanas statusu. Rāda, kuras metodes ir konfigurētas, aktīvas un iestatītas kā primārās.
mk: Листа на сите достапни MFA методи со нивниот статус на поставување и активирање. Покажува кои методи се конфигурирани, активни и поставени како примарни.
sv: Lista alla tillgängliga MFA-metoder med deras inställnings- och aktiveringsstatus. Visar vilka metoder som är konfigurerade, aktiva och inställda som primära.

source: Initialize a new MFA method setup. Creates the method with backup codes and returns setup instructions (e.g., QR code for authenticator apps). Method must be confirmed before activation.
be: Ініцыялізаваць наладку новага метада MFA. Стварае метад з рэзервовымі кодамі і вяртае інструкцыі па наладцы (напрыклад, QR-код для прыкладанняў аўтэнтыфікатара). Метад павінен быць пацверджаны перад актывацыяй.
ca: Inicialitza la configuració d'un nou mètode MFA. Crea el mètode amb codis de còpia de seguretat i retorna instruccions de configuració (per exemple, codi QR per a aplicacions d'autenticació). El mètode s'ha de confirmar abans de l'activació.
el: Αρχικοποίηση ρύθμισης νέας μεθόδου MFA. Δημιουργεί τη μέθοδο με κωδικούς εφεδρείας και επιστρέφει οδηγίες ρύθμισης (π.χ., QR κώδικα για εφαρμογές πιστοποίησης). Η μέθοδος πρέπει να επιβεβαιωθεί πριν από την ενεργοποίηση.
es: Inicializa la configuración de un nuevo método MFA. Crea el método con códigos de respaldo y devuelve instrucciones de configuración (ej., código QR para aplicaciones de autenticación). El método debe confirmarse antes de la activación.
fi: Alusta uuden MFA-menetelmän asetukset. Luo menetelmän varmuuskoodeineen ja palauttaa asennusohjeet (esim. QR-koodi todennussovelluksille). Menetelmä on vahvistettava ennen aktivointia.
kk: Жаңа MFA әдісін орнатуды бастау. Резервті кодтармен әдісті жасайды және орнату нұсқауларын қайтарады (мысалы, аутентификатор қолданбалары үшін QR код). Әдіс белсендіру алдында расталуы тиіс.
kn: ಹೊಸ MFA ವಿಧಾನ ಸೆಟಪ್ ಅನ್ನು ಪ್ರಾರಂಭಿಸಿ. ಬ್ಯಾಕಪ್ ಕೋಡ್‌ಗಳೊಂದಿಗೆ ವಿಧಾನವನ್ನು ರಚಿಸುತ್ತದೆ ಮತ್ತು ಸೆಟಪ್ ಸೂಚನೆಗಳನ್ನು ಹಿಂದಿರುಗಿಸುತ್ತದೆ (ಉದಾ., ದೃಢೀಕರಣ ಅಪ್ಲಿಕೇಶನ್‌ಗಳಿಗೆ QR ಕೋಡ್). ಸಕ್ರಿಯಗೊಳಿಸುವ ಮೊದಲು ವಿಧಾನವನ್ನು ದೃಢೀಕರಿಸಬೇಕು.
lv: Inicializēt jaunu MFA metodes iestatīšanu. Izveido metodi ar rezerves kodiem un atgriež iestatīšanas instrukcijas (piemēram, QR kodu autentificētāju lietotnēm). Metode jāapstiprina pirms aktivizēšanas.
mk: Иницијализирај ново поставување на MFA метода. Ја создава методата со резервни кодови и враќа инструкции за поставување (на пример, QR код за автентикатор апликации). Методата мора да се потврди пред активирање.
sv: Initialisera en ny MFA-metodinställning. Skapar metoden med reservkoder och returnerar inställningsinstruktioner (t.ex. QR-kod för autentiseringsappar). Metoden måste bekräftas före aktivering.

source: Confirm and activate a newly created MFA method using verification code. Automatically sets as primary method if no other primary method exists. Required before the method can be used for authentication.
be: Пацвердзіць і актываваць нядаўна створаны метад MFA з выкарыстаннем кода верыфікацыі. Аўтаматычна ўстанаўліваецца як асноўны метад, калі іншы асноўны метад не існуе. Патрабуецца перад тым, як метад можна будзе выкарыстоўваць для аўтэнтыфікацыі.
ca: Confirma i activa un mètode MFA recentment creat utilitzant el codi de verificació. S'estableix automàticament com a mètode primari si no existeix cap altre mètode primari. Requerit abans que el mètode pugui ser utilitzat per a l'autenticació.
el: Επιβεβαίωση και ενεργοποίηση μίας νεόδημης μεθόδου MFA χρησιμοποιώντας κωδικό επιβεβαίωσης. Ορίζει αυτόματα ως κύρια μέθοδο εάν δεν υπάρχει άλλη κύρια μέθοδος. Απαιτείται πριν η μέθοδος μπορεί να χρησιμοποιηθεί για πιστοποίηση.
es: Confirma y activa un método MFA recién creado usando código de verificación. Se establece automáticamente como método primario si no existe otro método primario. Requerido antes de que el método pueda usarse para autenticación.
fi: Vahvista ja aktivoi äskettäin luotu MFA-menetelmä käyttäen vahvistuskoodia. Asettaa automaattisesti ensisijaiseksi menetelmäksi, jos muuta ensisijaista menetelmää ei ole. Vaaditaan ennen kuin menetelmää voidaan käyttää tunnistautumiseen.
kk: Растау кодын пайдаланып жаңа жасалған MFA әдісін растау және белсендіру. Басқа негізгі әдіс жоқ болса автоматты түрде негізгі әдіс ретінде орнатылады. Әдіс аутентификация үшін пайдаланылуы алдында қажет.
kn: ಪರಿಶೀಲನಾ ಕೋಡ್ ಅನ್ನು ಬಳಸಿ ಹೊಸದಾಗಿ ರಚಿಸಿದ MFA ವಿಧಾನವನ್ನು ದೃಢೀಕರಿಸಿ ಮತ್ತು ಸಕ್ರಿಯಗೊಳಿಸಿ. ಇತರ ಪ್ರಾಥಮಿಕ ವಿಧಾನ ಇಲ್ಲದಿದ್ದರೆ ಸ್ವಯಂಚಾಲಿತವಾಗಿ ಪ್ರಾಥಮಿಕ ವಿಧಾನವಾಗಿ ಹೊಂದಿಸುತ್ತದೆ. ದೃಢೀಕರಣಕ್ಕಾಗಿ ವಿಧಾನವನ್ನು ಬಳಸಬೇಕಾದರೆ ಅಗತ್ಯವಿದೆ.
lv: Apstiprināt un aktivizēt jaunu MFA metodi, izmantojot verifikācijas kodu. Automātiski iestata kā primāro metodi, ja neeksistē cita primārā metode. Nepieciešams pirms metodes var izmantot autentifikācijai.
mk: Потврди и активирај новосоздадена MFA метода користејќи код за верификација. Автоматски се поставува како примарна метода ако не постои друга примарна метода. Потребно пред методата да може да се користи за автентикација.
sv: Bekräfta och aktivera en nyligen skapad MFA-metod med hjälp av verifieringskod. Ställs automatiskt in som primär metod om ingen annan primär metod existerar. Krävs innan metoden kan användas för autentisering.
