Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.4.tar.gz/litegram-1.0.4/docs/locale/*/LC_MESSAGES/dispatcher/dependency_injection.po
Languages: ru

source: Dependency injection
ru: Ін'екция залежностей

source: Dependency injection is a programming technique that makes a class independent of its dependencies. It achieves that by decoupling the usage of an object from its creation. This helps you to follow `SOLID's <https://en.wikipedia.org/wiki/SOLID>`_ dependency inversion and single responsibility principles.
ru: Ін'екция залежностей — это техника программирования, которая робить класи незалежними от ихних залежностей. Вона досягаеться шляхом виддилення використання объекта от его створення. Це допомагае дотримуватися принципив инверсии залежностей и единои видповидальности за SOLID.

source: How it works in litegram
ru: Как это працюе в litegram

source: For each update :class:`litegram.dispatcher.dispatcher.Dispatcher` passes handling context data. Filters and middleware can also make changes to the context.
ru: Для каждого обновления :class:`litegram.dispatcher.dispatcher.Dispatcher` передае дани контексту обработки. Фильтри и промижне програмне забезпечення також могут вносити змини к контексту.

source: To access contextual data you should specify corresponding keyword parameter in handler or filter. For example, to get :class:`litegram.fsm.context.FSMContext` we do it like that:
ru: Чтобы получить доступ к контекстних данных, вы должны указать видповидний параметр ключового слова в обробнику или фильтри. Например, чтобы получить :class:`litegram.fsm.context.FSMContext`, ми робимо это так:

source: Injecting own dependencies
ru: Ін'екция власних залежностей

source: Litegram provides several ways to complement / modify contextual data.
ru: Litegram предосивляет килька способив для кповнення/модификации контекстних данных.

source: The first and easiest way is to simply specify the named arguments in :class:`litegram.dispatcher.dispatcher.Dispatcher` initialization, polling start methods or :class:`litegram.webhook.litestar_server.SimpleRequestHandler` initialization if you use webhooks.
ru: Перший и найпростиший спосиб — это просто указать именованные аргументи во время инициализации :class:`litegram.dispatcher.dispatcher.Dispatcher`, запуску методив опроса или инициализации :class:`litegram.webhook.litestar_server.SimpleRequestHandler`, если вы використовуете вебхуки.

source: Analogy for webhook:
ru: Аналогия для вебхука:

source: :class:`litegram.dispatcher.dispatcher.Dispatcher`'s workflow data also can be supplemented by setting values as in a dictionary:
ru: Дани робочого процесса :class:`litegram.dispatcher.dispatcher.Dispatcher` також могут доповнюватися шляхом встановлення значень, как в словнику:

source: The middlewares updates the context quite often. You can read more about them on this page:
ru: Промижне програмне забезпечення досить часто оновлюе контекст. Вы можете прочитать о это больше на ций сторинци:

source: :ref:`Middlewares <middlewares>`
ru: :ref:`Промеждуне програмне забезпечення <middlewares>`

source: The last way is to return a dictionary from the filter:
ru: Осинний спосиб — вернуть словник из фильтра:

source: ...or using :ref:`MagicFilter <magic-filters>` with :code:`.as_(...)` method.
ru: ...или используя :ref:`MagicFilter <magic-filters>` с методом :code:`.as_(...)`.

source: Using type hints
ru: Использование пидказок типов

source: Type-hinting middleware data is optional and is not required for the correct operation of the dispatcher. However, it is recommended to use it to improve the readability of the code.
ru: Использование пидказок типов для данных промижного програмного забезпечення необов'язкове й не потрибне для правильнои роботи диспетчера. Проте рекомендуеться использовать их для покращення читабельности коду.

source: You can use type hints to specify the type of the context data in the middlewares, filters and handlers.
ru: Вы можете использовать пидказки типов для визначення типа контекстних данных в промижному ПЗ, фильтрах и обробниках.

source: The default middleware data typed dict can be found in :class:`litegram.dispatcher.middlewares.data.MiddlewareData`.
ru: Словник типов данных по умолчанию для промижного ПЗ можна знайти в :class:`litegram.dispatcher.middlewares.data.MiddlewareData`.

source: In case when you have extended the context data, you can use the :class:`litegram.dispatcher.middlewares.data.MiddlewareData` as a base class and specify the type hints for the new fields.
ru: Якщо вы розширили контекстни дани, вы можете использовать :class:`litegram.dispatcher.middlewares.data.MiddlewareData` как базовий клас и указать пидказки типов для нових полив.

source: If you using type checking tools like mypy, you can experience warnings about that this type hint against Liskov substitution principle in due stricter type is not a subclass of :code:`dict[str, Any]`. This is a known issue and it is not a bug. You can ignore this warning or use :code:`# type: ignore` comment.
ru: Якщо вы використовуете инструменты проверки типов, такие как mypy, вы можете получить попередження о те, что эти пидказки типов порушують принцип пидстановки Лисков через те, что сувориший тип не является пидкласом :code:`dict[str, Any]`. Це видома проблема, и это не является помилкою. Вы можете проигнорувати это попередження или використати коментар :code:`# type: ignore`.

source: Example of using type hints:
ru: Пример викорисиння пидказок типов:

source: Available context data type helpers
ru: Доступни помичники для типов контекстних данных

source: Data passed to the handler by the middlewares.
ru: Дани, передани обробнику промеждуним ПЗ.

source: You can add your own data by extending this class.
ru: Ви можетте добавить власни дани, розширивши этой клас.

source: I18n related data.
ru: Дани, пов'язани с I18n.

source: Is not included by default, you need to add it to your own Data class if you need it.
ru: За замовчуванням не включено, вам потрибно додати это к власного класу Даних, если это необходимо.

source: I18n object.
ru: Объект I18n.

source: I18n middleware.
ru: Промеждуне ПЗ для I18n.
