Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.7.tar.gz/litegram-1.0.7/docs/locale/*/LC_MESSAGES/dispatcher/dispatcher.po
Languages: ru

source: Dispatcher
ru: Диспетчер

source: :ref:`Filtering events`
ru: :ref:`Фильтрация событий`

source: Root router
ru: Корневой маршрутизатор

source: Parameters
ru: Параметры

source: Storage for FSM
ru: Хранилище для конечного автомата (FSM)

source: FSM strategy
ru: Стратегия конечного автомата

source: Events isolation
ru: Изоляция событий

source: Disable FSM, note that if you disable FSM then you should not use storage and events isolation
ru: Отключение конечного автомата, заметьте, что при выключенном конечном автомате вам не следует использовать хранилище и изоляцию событий

source: Other arguments, will be passed as keyword arguments to handlers
ru: Другие аргументы будут переданы обработчикам как именованные аргументы

source: Main entry point for incoming updates with automatic Dict->Update serializer
ru: Основная точка входа для событий с автоматической сериализацией Dict->Update

source: Main entry point for incoming updates Response of this method can be used as Webhook response
ru: Основная точка входа для событий. Ответ этого метода может быть использован для ответа в Webhook

source: Run many bots with polling
ru: Запуск нескольких ботов с использованием опроса

source: Bot instances (one or more)
ru: Экземпляры ботов (один или несколько)

source: Long-polling wait time
ru: Время ожидания при долгом опросе

source: Run task for each event and no wait result
ru: Запуск задачи для кажкго события без ожидания результатов

source: backoff-retry config
ru: конфигурация повторов с задержкой

source: List of the update types you want your bot to receive
ru: Список типов обновлений, которые должен получать ваш бот

source: handle signals (SIGINT/SIGTERM)
ru: обработка сигналов (SIGINT/SIGTERM)

source: close bot sessions on shutdown
ru: закрывать сессии бота при завершении работы

source: contextual data
ru: контекстные данные

source: Returns
ru: Возвращает

source: Polling runner
ru: Запуск исполнителя опроса

source: List of the update types you want your bot to receive By default, all used update types are enabled (resolved from handlers)
ru: Список типов обновлений, которые должен получать ваш бот. По умолчанию включены все используемые типы обновлений (определяются по обработчикам)

source: Execute this method if you want to stop polling programmatically
ru: Используйте этот метод, если хотите остановить опрос программно

source: Simple usage
ru: Простое использование

source: Example:
ru: Пример:

source: Including routers
ru: Подключение роутеров

source: Handling updates
ru: Обработка обновлений

source: All updates can be propagated to the dispatcher by :meth:`~litegram.dispatcher.dispatcher.Dispatcher.feed_update` method:
ru: Все обновления могут быть переданы диспетчеру через метод :meth:`~litegram.dispatcher.dispatcher.Dispatcher.feed_update`:

source: Also you can feed raw update (dictionary) object to the dispatcher by :meth:`~litegram.dispatcher.dispatcher.Dispatcher.feed_raw_update` method:
ru: Также вы можете передать сырой объект обновления (словарь) диспетчеру через метод :meth:`~litegram.dispatcher.dispatcher.Dispatcher.feed_raw_update`:
