Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.5.tar.gz/litegram-1.0.5/docs/locale/*/LC_MESSAGES/dispatcher/observer.po
Languages: ru

source: Observer
ru: Обсервер

source: Observer is used for filtering and handling different events. That is part of internal API with some public methods and is recommended to don't use methods is not listed here.
ru: Обсервер використовуеться для фильтрации и обработки ризних событий. Це частина внутришнього API с деякими публичними методами, поэтому рекомендуеться не использовать методы, которых здесь нет.

source: In `litegram` framework is available two variants of observer:
ru: У фреймвоку `litegram` доступни два варианта обсервера:

source: Simple events observer
ru: Простий обсервер(спостеригач) событий

source: Is used for managing events is not related with Telegram (For example startup/shutdown processes)
ru: Используется для керування подиями, не пов’язаними с Telegram (например, запуску/вимкнення процесив)

source: Handlers can be registered via decorator or method
ru: Обробники(Handler) можна зарееструвати за помогою декоратора или методу

source: Register callback with filters
ru: Реестрация обробника(callback) с фильтрами

source: Propagate event to handlers. Handler will be called when all its filters is pass.
ru: Передача подии обробникам событий(handler). Обробник буде викликано, когда все его фильтри пройдено.

source: Decorator for registering event handlers
ru: Декоратор для реестрации обробника событий(handler)

source: Event observer for Telegram events
ru: Обсервер событий для событий Telegram

source: Here you can register handler with filter. This observer will stop event propagation when first handler is pass.
ru: Тут Вы можете зарееструвати обробник(handler) из фильтрами. Этот обсервер зупинить розповсюдження подии, когда справцюе перший обробник(handler).

source: Register event handler
ru: Реестрация обробника событий(handler)

source: Propagate event to handlers and stops propagation on first match. Handler will be called when all its filters is pass.
ru: Передача подии обробнику событий(handler) и зупинка при первом ж збигу. Обробник(handler) буде викликало, когда все его фильтри пройдено.
