Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.5.tar.gz/litegram-1.0.5/docs/locale/*/LC_MESSAGES/dispatcher/router.po
Languages: ru

source: Router
ru: Маршрутизатор

source: Router can route update, and it nested update types like messages, callback query, polls and all other event types.
ru: Маршрутизатор может маршрутизувати подии, а також вкладени типы оновлень, такие как сообщения, запит зворотного виклику, опроса и все инши типы событий.

source: Event handlers can be registered in observer by two ways:
ru: Обробники событий могут бути зареестровани в обсервери двома шляхами:

source: By observer method - :obj:`router.<event_type>.register(handler, <filters, ...>)`
ru: За помощью методу обсервера - :obj:`router.<event_type>.register(handler, <filters, ...>)`

source: By decorator - :obj:`@router.<event_type>(<filters, ...>)`
ru: За помогою декоратора - :obj:`@router.<event_type>(<filters, ...>)`

source: Parameters
ru: Параметры

source: Optional router name, can be useful for debugging
ru: Додаткова название маршрутизатора, может бути корисною для отлагодження

source: Attach another router.
ru: Пидключення маршрутизатора.

source: Returns
ru: Возвращает

source: Event observers
ru: Обсервери событий

source: All handlers always should be asynchronous. The name of the handler function is not important. The event argument name is also not important but it is recommended to not overlap the name with contextual data in due to function can not accept two arguments with the same name.
ru: Все обробники всегда мають бути асинхронними. Ім'я функции обработки не имеет значение. Название аргументу подии також не важлива, але рекомендуеться не накладати назву на контекстни дани, оскильки функция не может прийняти два аргументи с однаковою назвою.

source: Here is the list of available observers and examples of how to register handlers
ru: Ось список доступних обсерверив и примеры того, как зарееструвати обробники

source: In these examples only decorator-style registering handlers are used, but if you don't like @decorators just use :obj:`<event type>.register(...)` method instead.
ru: У этих прикладах використовуються только обробники реестрации в стили декоратора, але если вам не подобаються @decorators, просто используйте :obj:`<event type>.register(...)` method instead.

source: Message
ru: Повикмлення

source: Be attentive with filtering this event
ru: Будьте уважни при фильтруванни этой подии

source: You should expect that this event can be with different sets of attributes in different cases
ru: Вам следует очикувати, что эта подия может мати ризни набори атрибутив в ризних випадках

source: (For example text, sticker and document are always of different content types of message)
ru: (Например, текст, стикер и документ всегда мають ризни типы содержимого)

source: Recommended way to check field availability before usage, for example via :ref:`magic filter <magic-filters>`: :code:`F.text` to handle text, :code:`F.sticker` to handle stickers only and etc.
ru: Рекомендований спосиб проверить наявнисть полив перед використанням, например с помощью :ref:`magic filter <magic-filters>`: :code:`F.text` для обработки тексту, :code:`F.sticker` для обработки только стикерив и и т.д..

source: Edited message
ru: Видредаговане повикмлення

source: Channel post
ru: Пост на канали

source: Edited channel post
ru: Видредагований пост на канали

source: Inline query
ru: Inline запит

source: Chosen inline query
ru: Вибраний результатт inline запиту

source: Callback query
ru: Запит зворотнои ответи

source: Shipping query
ru: Запит пидтвердження ксивки

source: Pre checkout query
ru: Запит перед оформленням замовлення

source: Poll
ru: Опитування

source: Poll answer
ru: Видпооть на опроса

source: Errors
ru: Помилки

source: Nested routers
ru: Вкладени маршрутизатори

source: Routers by the way can be nested to an another routers with some limitations:
ru: До речи, маршрутизатори могут бути вкладеними в инши маршрутизатори с деякими обмеженнями:

source: 1. Router **CAN NOT** include itself 1. Routers **CAN NOT** be used for circular including (router 1 include router 2, router 2 include router 3, router 3 include router 1)
ru: 1. Маршрутизатор **НЕ МОЖЕ** включити себе 2. Маршрутизатори **НЕ МОЖНА** использовать для цикличного включення (маршрутизатор 1 включае маршрутизатор 2, маршрутизатор 2 включае маршрутизатор 3, маршрутизатор 3 включае маршрутизатор 1)

source: Example:
ru: Пример:

source: Update
ru: Оновлення

source: How it works?
ru: Как это працюе?

source: For example, dispatcher has 2 routers, the last router also has one nested router:
ru: Например, диспетчер имеет 2 маршрутизатори, останний маршрутизатор також имеет один вкладений маршрутизатор:

source: Nested routers example
ru: Пример вкладених маршрутизаторив

source: In this case update propagation flow will have form:
ru: У этому случае потик розповсюдження обновления матиме вигляд:
