Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.7.tar.gz/litegram-1.0.7/docs/locale/*/LC_MESSAGES/utils/chat_action.po
Languages: ru

source: Chat action sender
ru: Видправник дий в чати

source: Sender
ru: Видправник

source: This utility helps to automatically send chat action until long actions is done to take acknowledge bot users the bot is doing something and not crashed.
ru: Ця утилита допомагае автоматически надсилати действия чату, допоки виконуються тривали действия боттом,чтобы повидомити користувачив бота о те что бот что-то робить и не завершив роботу аварийно.

source: Provides simply to use context manager.
ru: Надае простий для викорисиння контекстний менеджер.

source: Technically sender start background task with infinity loop which works until action will be finished and sends the `chat action <https://core.telegram.org/bots/api#sendchataction>`_ every 5 seconds.
ru: Технично, видправник запускае фонову завдачу с нескинченним циклом, который працюе к завершення действия и надсилае `дию чату <https://core.telegram.org/bots/api#sendchataction>`_ кожни 5 секунд.

source: Parameters
ru: Параметры

source: instance of the bot
ru: екземпляр бота, необов'язковий параметр

source: target chat id
ru: идентификатор цильового чату

source: chat action type
ru: тип действия

source: interval between iterations
ru: интервал между итерациями

source: Create instance of the sender with `choose_sticker` action
ru: Створення екземпляру отправника с диею `choose_sticker`

source: Create instance of the sender with `find_location` action
ru: Створення екземпляру отправника с диею `find_location`

source: Create instance of the sender with `record_video` action
ru: Створення екземпляру отправника с диею `record_video`

source: Create instance of the sender with `record_video_note` action
ru: Створення екземпляру отправника с диею `record_video_note`

source: Create instance of the sender with `record_voice` action
ru: Створення екземпляру отправника с диею `record_voice`

source: Create instance of the sender with `typing` action
ru: Створення екземпляру отправника с диею `typing`

source: Create instance of the sender with `upload_document` action
ru: Створення екземпляру отправника с диею `upload_document`

source: Create instance of the sender with `upload_photo` action
ru: Створення екземпляру отправника с диею `upload_photo`

source: Create instance of the sender with `upload_video` action
ru: Створення екземпляру отправника с диею `upload_video

source: Create instance of the sender with `upload_video_note` action
ru: Створення екземпляру отправника с диею `upload_video_note`

source: Create instance of the sender with `upload_voice` action
ru: Створення екземпляру отправника с диею `upload_voice`

source: Usage
ru: Использование

source: Helps to automatically use chat action sender for all message handlers
ru: Допомагае автоматически использовать видправника дий чату для всех обработчиков сообщений

source: Before usa should be registered for the `message` event
ru: Перед викорисинням следует зарееструвати для подии `message`

source: After this action all handlers which works longer than `initial_sleep` will produce the '`typing`' chat action.
ru: После этого все обробники, что працюють довше за `initial_sleep`, виконуватимуть дию '`typing`' чату

source: Also sender can be customized via flags feature for particular handler.
ru: Також видправник может бути налаштованим с помощью функции миток для певного обробника.

source: Change only action type:
ru: Змина только типа действия:

source: Change sender configuration:
ru: Змина конфигурации отправника:
