Repository: pypi-data/pypi-mirror-402
Catalog: packages/sphinx-metadata-figure/sphinx_metadata_figure-1.4.0-py3-none-any.whl/sphinx_metadata_figure/translations/locales/*/LC_MESSAGES/sphinx_metadata_figure.po
Languages: sw

source: All Rights Reserved
sw: Haki zote zimehifadhiwa

source: Attribution
sw: Utambuzi

source: Author
sw: Mwandishi

source: Copyright
sw: Haki miliki

source: Date
sw: Tarehe

source: License
sw: Leseni

source: Pexels License
sw: Leseni ya Pexels

source: Pixabay License
sw: Leseni ya Pixabay

source: Proprietary
sw: Miliki

source: Public Domain
sw: Eneo la umma

source: Source
sw: Chanzo

source: Unsplash License
sw: Leseni ya Unsplash

source: Vecteezy Free License
sw: Leseni Inayotumika Bure ya Vecteezy
