Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.0.tar.gz/litegram-1.0.0/docs/locale/*/LC_MESSAGES/dispatcher/filters/callback_data.po
Languages: ru

source: Callback Data Factory & Filter
ru: Фабрика миток зворотнього виклику и фильтрування

source: Base class for callback data wrapper
ru: Базовий клас для обгортки митки зворотного виклику

source: This class should be used as super-class of user-defined callbacks.
ru: Этот клас следует использовать как супер-клас зворотних викликив, визначених пользователем.

source: The class-keyword :code:`prefix` is required to define prefix and also the argument :code:`sep` can be passed to define separator (default is :code:`:`).
ru: Ключове слово класу :code:`prefix` потрибне для визначення префикса, а також аргумент :code:`sep` можна передати для визначення роздильника (за замовчуванням это :code:`:`).

source: Generate callback data string
ru: Генерування рякк митки зворотного виклику

source: Returns
ru: Возвращает

source: valid callback data for Telegram Bot API
ru: дийсна митка зворотного виклику для Telegram Bot API

source: Parse callback data string
ru: Анализ рядка митки зворотного виклику

source: Parameters
ru: Параметры

source: value from Telegram
ru: значение с Telegram

source: instance of CallbackData
ru: екземпляр митки зворотного виклику

source: Generates a filter for callback query with rule
ru: Створюе фильтр для запиту зворотного виклику с правилом

source: magic rule
ru: магичне правило

source: instance of filter
ru: екземпляр фильтру

source: Usage
ru: Использование

source: Create subclass of :code:`CallbackData`:
ru: Створення пидкласу :code:`CallbackData`:

source: After that you can generate any callback based on this class, for example:
ru: После этого вы можете створити будь-который зворотний виклик на основи этого класу, например:

source: So... Now you can use this class to generate any callbacks with defined structure
ru: Отже... Тепер вы можете использовать этот клас для створення будь-которых зворотних викликив из визначеною структурою

source: ... and handle by specific rules
ru: ... и обробляти за певними правилами

source: Another abstract example:
ru: Ще один абстрактний пример:

source: Known limitations
ru: Викми обмеження

source: Allowed types and their subclasses:
ru: Дозволени типы и их пидкласи:

source: :code:`Enum` (:code:`from enum import Enum`, only for string enums)
ru: :code:`Enum` (:code:`from enum import Enum`, только для переликив рядкив)

source: :code:`IntEnum` (:code:`from enum import IntEnum`, only for int enums)
ru: :code:`IntEnum` (:code:`from enum import IntEnum`, только для переликив int)

source: Note that the integer Enum's should be always is subclasses of :code:`IntEnum` in due to parsing issues.
ru: Зауважте, что целое число Enum всегда имеет бути пидкласом :code:`IntEnum` через проблеми с синтаксичним анализом.
