Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.0.tar.gz/litegram-1.0.0/docs/locale/*/LC_MESSAGES/index.po
Languages: ru

source: Downloads
ru: Загрузки

source: Supported python versions
ru: Поддерживаемые версии Python

source: Tests
ru: Тесты

source: Codecov
ru: Покрытие кода

source: **litegram** is a modern and fully asynchronous framework for `Telegram Bot API <https://core.telegram.org/bots/api>`_ written in Python 3.10+ using `asyncio <https://docs.python.org/3/library/asyncio.html>`_ and `httpx <https://github.com/encode/httpx>`_.
ru: **litegram** — это современный и полностью асинхронный фреймворк для разработки чат-ботов `Telegram Bot API <https://core.telegram.org/bots/api>`_ на Python 3.10+ с использованием `asyncio <https://docs.python.org/3/library/asyncio.html>`_ и `httpx <https://github.com/encode/httpx>`_.

source: Make your bots faster and more powerful!
ru: Сделайте своих ботов быстрее и мощнее!

source: Documentation:
ru: Документация:

source: 🇷🇺 `Russian <https://docs.litegram.dev/ru/dev-master/>`_
ru: 🇷🇺 `Русский <https://docs.litegram.dev/ru/dev-master/>`_

source: Features
ru: Особенности

source: Asynchronous (`asyncio docs <https://docs.python.org/3/library/asyncio.html>`_, :pep:`492`)
ru: Асинхронность (`asyncio docs <https://docs.python.org/3/library/asyncio.html>`_, :pep:`492`)

source: Has type hints (:pep:`484`) and can be used with `mypy <http://mypy-lang.org/>`_
ru: Имеет аннотации типов (:pep:`484`) и может использоваться с `mypy <http://mypy-lang.org/>`_

source: Supports `PyPy <https://www.pypy.org/>`_
ru: Работает с `PyPy <https://www.pypy.org/>`_

source: Supports `Telegram Bot API 9.3 <https://core.telegram.org/bots/api>`_ and gets fast updates to the latest versions of the Bot API
ru: Поддерживает `Telegram Bot API 9.3 <https://core.telegram.org/bots/api>`_ и быстро получает обновления к последних версий API

source: Telegram Bot API integration code was `autogenerated <https://github.com/litegram/tg-codegen>`_ and can be easily re-generated when API gets updated
ru: Код интеграции с Telegram Bot API был `автогенерирован <https://github.com/litegram/tg-codegen>`_ и может быть легко перегенерирован при обновлении API

source: Updates router (Blueprints)
ru: Роутер обновлений (Blueprints)

source: Has Finite State Machine
ru: Имеет встроенный конечный автомат (FSM)

source: Uses powerful `magic filters <https://docs.litegram.dev/en/latest/dispatcher/filters/magic_filters.html#magic-filters>`_
ru: Использует мощные `магические фильтры <https://docs.litegram.dev/en/latest/dispatcher/filters/magic_filters.html#magic-filters>`_

source: Middlewares (incoming updates and API calls)
ru: Middlewares (для входящих обновлений и вызовов API)

source: Provides `Replies into Webhook <https://core.telegram.org/bots/faq#how-can-i-make-requests-in-response-to-updates>`_
ru: Поддерживает `ответы в вебхук <https://core.telegram.org/bots/faq#how-can-i-make-requests-in-response-to-updates>`_

source: Integrated I18n/L10n support with GNU Gettext (or Fluent)
ru: Встроенная поддержка I18n/L10n с GNU Gettext (или Fluent)

source: It is strongly advised that you have prior experience working with `asyncio <https://docs.python.org/3/library/asyncio.html>`_ before beginning to use **litegram**.
ru: Настоятельно рекомендуется иметь опыт работы с `asyncio <https://docs.python.org/3/library/asyncio.html>`_ перед тем, как приступать к использованию **litegram**.

source: If you have any questions, you can visit our community chats on Telegram:
ru: Если в вас есть вопросы, вы можете посетить наши сообщества в Telegram:

source: Simple usage
ru: Простое использование

source: Usage without dispatcher
ru: Использование без диспетчера

source: Just only interact with Bot API, without handling events
ru: Только взаимодействие с API, без обработки событий

source: Contents
ru: Содержание
