Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.2-py3-none-any.whl/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: af, ar, bg, fa, fr, gl, he, hr, id, ms, pt, sk, sr, sw, tr

source: Returns user details along with JWT access and refresh tokens with expiration times.
af: Gee gebruikersbesonderhede saam met JWT-toegang en verfris tokens met vervaldatums terug.
ar: يعيد تفاصيل المستخدم مع رموز الوصول والتحديث JWT مع أوقات الانتهاء.
bg: Връща подробности за потребителя заедно с JWT токени за достъп и обновяване с времена на изтичане.
fa: جزئیات کاربر همراه با توکن‌های دسترسی و تازه‌سازی JWT با زمان انقضا برگردانده می‌شود.
fr: Retourne les détails de l'utilisateur avec les jetons d'accès et de renouvellement JWT avec les temps d'expiration.
gl: Devolve os detalles do usuario xunto con tokens JWT de acceso e actualización con tempos de expiración.
he: מחזיר פרטי משתמש יחד עם אסימוני גישה ורענון JWT עם זמני תפוגה.
hr: Vraća korisničke podatke zajedno s JWT pristupnim i refresh tokenima s vremenom isteka.
id: Mengembalikan detail pengguna beserta token akses JWT dan token refresh dengan waktu kedaluwarsa.
ms: Memulangkan butiran pengguna bersama token akses JWT dan token penyegaran dengan masa tamat tempoh.
pt: Retorna detalhes do usuário junto com tokens de acesso e atualização JWT com tempos de expiração.
sk: Vráti detaily používateľa spolu s JWT prístupovými a obnovovacími tokenmi s časom vypršania.
sr: Vraća detalje korisnika zajedno sa JWT pristupnim i refresh tokenima sa vremenom isteka.
sw: Inarudisha maelezo ya mtumiaji pamoja na alama za JWT za ufikiaji na ubugarizi pamoja na muda wa kumalizika.
tr: JWT erişim ve yenileme tokenları ile birlikte kullanıcı detaylarını döner ve token süre sonu bilgilerini içerir.

source: Returns user details along with a DRF authentication token for API access.
af: Gee gebruikersbesonderhede saam met 'n DRF-verifikasietoken vir API-toegang terug.
ar: يعيد تفاصيل المستخدم مع رمز مصادقة DRF للوصول إلى API.
bg: Връща подробности за потребителя заедно с DRF токен за удостоверяване за API достъп.
fa: جزئیات کاربر همراه با توکن احراز هویت DRF برای دسترسی به API برگردانده می‌شود.
fr: Retourne les détails de l'utilisateur avec un jeton d'authentification DRF pour l'accès API.
gl: Devolve os detalles do usuario xunto cun token de autenticación DRF para acceso á API.
he: מחזיר פרטי משתמש יחד עם אסימון אימות DRF לגישה ל-API.
hr: Vraća korisničke podatke zajedno s DRF autentifikacijskim tokenom za API pristup.
id: Mengembalikan detail pengguna beserta token autentikasi DRF untuk akses API.
ms: Memulangkan butiran pengguna bersama token pengesahan DRF untuk akses API.
pt: Retorna detalhes do usuário junto com um token de autenticação DRF para acesso à API.
sk: Vráti detaily používateľa spolu s DRF autentifikačným tokenom pre prístup k API.
sr: Vraća detalje korisnika zajedno sa DRF autentifikacionim tokenom za pristup API-ju.
sw: Inarudisha maelezo ya mtumiaji pamoja na alama ya uthibitishaji ya DRF kwa ufikiaji wa API.
tr: API erişimi için DRF authentication tokeni ile birlikte kullanıcı detaylarını döner.

source: Returns user details along with custom authentication tokens.
af: Gee gebruikersbesonderhede saam met aangepaste verifikasietokens terug.
ar: يعيد تفاصيل المستخدم مع رموز المصادقة المخصصة.
bg: Връща подробности за потребителя заедно с персонализирани токени за удостоверяване.
fa: جزئیات کاربر همراه با توکن‌های احراز هویت سفارشی برگردانده می‌شود.
fr: Retourne les détails de l'utilisateur avec des jetons d'authentification personnalisés.
gl: Devolve os detalles do usuario xunto con tokens de autenticación personalizados.
he: מחזיר פרטי משתמש יחד עם אסימוני אימות מותאמים אישית.
hr: Vraća korisničke podatke zajedno s prilagođenim autentifikacijskim tokenima.
id: Mengembalikan detail pengguna beserta token autentikasi kustom.
ms: Memulangkan butiran pengguna bersama token pengesahan tersuai.
pt: Retorna detalhes do usuário junto com tokens de autenticação personalizados.
sk: Vráti detaily používateľa spolu s vlastnými autentifikačnými tokenmi.
sr: Vraća detalje korisnika zajedno sa prilagođenim autentifikacionim tokenima.
sw: Inarudisha maelezo ya mtumiaji pamoja na alama za uthibitishaji za kawaida.
tr: Özel authentication tokenları ile birlikte kullanıcı detaylarını döner.

source: JWT access and refresh tokens
af: JWT-toegang en verfris tokens
ar: رموز الوصول والتحديث JWT
bg: JWT токени за достъп и обновяване
fa: توکن‌های دسترسی و تازه‌سازی JWT
fr: Jetons d'accès et de renouvellement JWT
gl: Tokens JWT de acceso e actualización
he: אסימוני גישה ורענון JWT
hr: JWT pristupni i refresh tokeni
id: Token akses dan refresh JWT
ms: Token akses JWT dan token penyegaran
pt: Tokens de acesso e atualização JWT
sk: JWT prístupové a obnovovacie tokeny
sr: JWT pristupni i refresh tokeni
sw: Alama za ufikiaji na ubugarizi za JWT
tr: JWT erişim ve yenileme tokenları

source: DRF authentication token
af: DRF-verifikasietoken
ar: رمز مصادقة DRF
bg: DRF токен за удостоверяване
fa: توکن احراز هویت DRF
fr: Jeton d'authentification DRF
gl: Token de autenticación DRF
he: אסימון אימות DRF
hr: DRF autentifikacijski token
id: Token autentikasi DRF
ms: Token pengesahan DRF
pt: Token de autenticação DRF
sk: DRF autentifikačný token
sr: DRF autentifikacioni token
sw: Alama ya uthibitishaji ya DRF
tr: DRF authentication tokeni

source: custom authentication tokens
af: aangepaste verifikasietokens
ar: رموز المصادقة المخصصة
bg: персонализирани токени за удостоверяване
fa: توکن‌های احراز هویت سفارشی
fr: jetons d'authentification personnalisés
gl: tokens de autenticación personalizados
he: אסימוני אימות מותאמים אישית
hr: prilagođeni autentifikacijski tokeni
id: token autentikasi kustom
ms: token pengesahan tersuai
pt: tokens de autenticação personalizados
sk: vlastné autentifikačné tokeny
sr: prilagođeni autentifikacioni tokeni
sw: alama za uthibitishaji za kawaida
tr: özel authentication tokenları

source: Authentication cookies are set automatically for secure token storage.
af: Verifikasie-koekies word outomaties gestel vir veilige token-berging.
ar: يتم تعيين ملفات تعريف الارتباط تلقائياً لتخزين آمن للرموز.
bg: Бисквитките за удостоверяване се задават автоматично за сигурно съхранение на токени.
fa: کوکی‌های احراز هویت به طور خودکار برای ذخیره امن توکن‌ها تنظیم می‌شوند.
fr: Les cookies d'authentification sont définis automatiquement pour un stockage sécurisé des jetons.
gl: As cookies de autenticación configúranse automaticamente para almacenamento seguro de tokens.
he: עוגיות אימות מוגדרות אוטומטית לאחסון מאובטח של אסימונים.
hr: Autentifikacijski kolačići se automatski postavljaju za sigurno čuvanje tokena.
id: Cookie autentikasi diatur secara otomatis untuk penyimpanan token yang aman.
ms: Cookie pengesahan ditetapkan secara automatik untuk penyimpanan token yang selamat.
pt: Os cookies de autenticação são definidos automaticamente para armazenamento seguro de tokens.
sk: Autentifikačné súbory cookie sa nastavia automaticky pre bezpečné ukladanie tokenov.
sr: Autentifikacioni kolačići se automatski postavljaju za bezbedno čuvanje tokena.
sw: Vidakuzi vya uthibitishaji vinawekwa kiotomatiki kwa kuhifadhi alama kwa usalama.
tr: Güvenli token depolama için authentication çerezleri otomatik olarak ayarlanır.

source: Blacklists JWT refresh tokens to prevent further use.
af: Swartlys JWT-verfris tokens om verdere gebruik te voorkom.
ar: يضع رموز تحديث JWT في القائمة السوداء لمنع الاستخدام الإضافي.
bg: Добавя JWT токените за обновяване в черния списък, за да предотврати по-нататъшно използване.
fa: توکن‌های تازه‌سازی JWT را در لیست سیاه قرار می‌دهد تا از استفاده مجدد جلوگیری شود.
fr: Met les jetons de renouvellement JWT en liste noire pour empêcher leur utilisation ultérieure.
gl: Bloquea os tokens JWT de actualización para evitar o seu uso posterior.
he: מוסיף אסימוני רענון JWT לרשימה שחורה כדי למנוע שימוש נוסף.
hr: Stavlja JWT refresh tokene na crnu listu kako bi se spriječila daljnja upotreba.
id: Memblokir token refresh JWT untuk mencegah penggunaan lebih lanjut.
ms: Memasukkan token penyegaran JWT ke dalam senarai hitam untuk mencegah penggunaan selanjutnya.
pt: Inclui na lista negra os tokens de atualização JWT para prevenir uso posterior.
sk: Zakáže JWT obnovovacie tokeny, aby sa zabránilo ich ďalšiemu použitiu.
sr: Stavlja JWT refresh tokene na crnu listu kako bi sprečio dalju upotrebu.
sw: Inaweka alama za ubugarizi za JWT kwenye orodha nyeusi ili kuzuia matumizi zaidi.
tr: Daha fazla kullanımı önlemek için JWT yenileme tokenlarını kara listeye alır.

source: Deletes the DRF authentication token from the database.
af: Skrap die DRF-verifikasietoken uit die databasis.
ar: يحذف رمز مصادقة DRF من قاعدة البيانات.
bg: Изтрива DRF токена за удостоверяване от базата данни.
fa: توکن احراز هویت DRF را از پایگاه داده حذف می‌کند.
fr: Supprime le jeton d'authentification DRF de la base de données.
gl: Elimina o token de autenticación DRF da base de datos.
he: מוחק את אסימון האימות DRF ממסד הנתונים.
hr: Briše DRF autentifikacijski token iz baze podataka.
id: Menghapus token autentikasi DRF dari basis data.
ms: Memadamkan token pengesahan DRF dari pangkalan data.
pt: Exclui o token de autenticação DRF do banco de dados.
sk: Odstráni DRF autentifikačný token z databázy.
sr: Briše DRF autentifikacioni token iz baze podataka.
sw: Inafuta alama ya uthibitishaji ya DRF kutoka kwenye hifadhidata.
tr: DRF authentication tokenini veritabanından siler.

source: Invalidates custom authentication tokens.
af: Maak aangepaste verifikasietokens ongeldig.
ar: يبطل رموز المصادقة المخصصة.
bg: Обезсилва персонализираните токени за удостоверяване.
fa: توکن‌های احراز هویت سفارشی را باطل می‌کند.
fr: Invalide les jetons d'authentification personnalisés.
gl: Invalida os tokens de autenticación personalizados.
he: מבטל אסימוני אימות מותאמים אישית.
hr: Poništava prilagođene autentifikacijske tokene.
id: Membatalkan token autentikasi kustom.
ms: Membatalkan token pengesahan tersuai.
pt: Invalida os tokens de autenticação personalizados.
sk: Zneplatní vlastné autentifikačné tokeny.
sr: Poništava prilagođene autentifikacione tokene.
sw: Inabatilisha alama za uthibitishaji za kawaida.
tr: Özel authentication tokenlarını geçersiz kılar.

source: Clears authentication cookies from the browser.
af: Maak verifikasie-koekies uit die blaaier skoon.
ar: يمحو ملفات تعريف الارتباط من المتصفح.
bg: Изчиства бисквитките за удостоверяване от браузъра.
fa: کوکی‌های احراز هویت را از مرورگر پاک می‌کند.
fr: Efface les cookies d'authentification du navigateur.
gl: Limpa as cookies de autenticación do navegador.
he: מנקה עוגיות אימות מהדפדפן.
hr: Briše autentifikacijske kolačiće iz preglednika.
id: Menghapus cookie autentikasi dari browser.
ms: Membersihkan cookie pengesahan dari pelayar.
pt: Limpa os cookies de autenticação do navegador.
sk: Vymaže autentifikačné súbory cookie z prehliadača.
sr: Briše autentifikacione kolačiće iz pregledača.
sw: Inafuta vidakuzi vya uthibitishaji kutoka kwenye kivinjari.
tr: Tarayıcıdan authentication çerezlerini temizler.

source: Authenticate with username/email and password to obtain access tokens.
af: Verifieer met gebruikersnaam/e-pos en wagwoord om toegangstokens te verkry.
ar: قم بالمصادقة باسم المستخدم/البريد الإلكتروني وكلمة المرور للحصول على رموز الوصول.
bg: Удостоверяване с потребителско име/имейл и парола за получаване на токени за достъп.
fa: احراز هویت با نام کاربری/ایمیل و کلمه عبور برای دریافت توکن‌های دسترسی.
fr: Authentifiez-vous avec nom d'utilisateur/email et mot de passe pour obtenir des jetons d'accès.
gl: Autentica con nome de usuario/correo electrónico e contrasinal para obter tokens de acceso.
he: אימות עם שם משתמש/דוא״ל וסיסמה כדי לקבל אסימוני גישה.
hr: Autentificiraj se s korisničkim imenom/e-mailom i lozinkom kako bi dobio pristupne tokene.
id: Melakukan autentikasi dengan nama pengguna/email dan kata sandi untuk mendapatkan token akses.
ms: Mengesahkan dengan nama pengguna/e-mel dan kata laluan untuk mendapatkan token akses.
pt: Autentique-se com nome de usuário/email e senha para obter tokens de acesso.
sk: Autentifikujte sa pomocou používateľského mena/e-mailu a hesla na získanie prístupových tokenov.
sr: Autentifikacija sa korisničkim imenom/mejlom i lozinkom za dobijanje pristupnih tokena.
sw: Thibitisha kwa jina la mtumiaji/barua pepe na nenosiri ili kupata alama za ufikiaji.
tr: Erişim tokenları elde etmek için kullanıcı adı/e-posta ve şifre ile kimlik doğrulaması yapar.

source: Logout user and invalidate authentication tokens.
af: Teken gebruiker uit en maak verifikasietokens ongeldig.
ar: تسجيل خروج المستخدم وإبطال رموز المصادقة.
bg: Излизане на потребителя и обезсилване на токените за удостоверяване.
fa: خروج کاربر و باطل کردن توکن‌های احراز هویت.
fr: Déconnecte l'utilisateur et invalide les jetons d'authentification.
gl: Pecha a sesión do usuario e invalida os tokens de autenticación.
he: יציאה של משתמש ובטול אסימוני אימות.
hr: Odjavi korisnika i poništi autentifikacijske tokene.
id: Mengeluarkan pengguna dan membatalkan token autentikasi.
ms: Log keluar pengguna dan membatalkan token pengesahan.
pt: Desconectar usuário e invalidar tokens de autenticação.
sk: Odhlási používateľa a zneplatní autentifikačné tokeny.
sr: Odjavljuje korisnika i poništava autentifikacione tokene.
sw: Inaitoa mtumiaji na kubatilisha alama za uthibitishaji.
tr: Kullanıcıyı çıkış yapar ve authentication tokenlarını geçersiz kılar.

source: Requires authentication to ensure only valid sessions can be logged out.
af: Vereis verifikasie om te verseker dat slegs geldige sessies uitgeteken kan word.
ar: يتطلب المصادقة لضمان أن الجلسات الصحيحة فقط يمكن تسجيل الخروج منها.
bg: Изисква удостоверяване, за да се гарантира, че само валидни сесии могат да бъдат прекратени.
fa: احراز هویت مورد نیاز است تا تنها جلسات معتبر بتوانند خارج شوند.
fr: Nécessite une authentification pour s'assurer que seules les sessions valides peuvent être déconnectées.
gl: Require autenticación para asegurar que só as sesións válidas podan pecharse.
he: דורש אימות כדי לוודא שרק הפעלות תקינות יכולות להתנתק.
hr: Zahtijeva autentifikaciju kako bi se osiguralo da se mogu odjaviti samo valjane sesije.
id: Memerlukan autentikasi untuk memastikan hanya sesi yang valid yang dapat dikeluarkan.
ms: Memerlukan pengesahan untuk memastikan hanya sesi yang sah boleh dilog keluar.
pt: Requer autenticação para garantir que apenas sessões válidas possam ser desconectadas.
sk: Vyžaduje autentifikáciu na zabezpečenie, že len platné relácie môžu byť odhlásené.
sr: Zahteva autentifikaciju kako bi se osiguralo da se mogu odjaviti samo važeće sesije.
sw: Inahitaji uthibitishaji ili kuhakikisha kwamba ni vikao halali tu vinavyoweza kutolewa.
tr: Sadece geçerli oturumların çıkış yapabilmesini sağlamak için kimlik doğrulaması gerektirir.

source: Generate new JWT access tokens using refresh tokens.
af: Genereer nuwe JWT-toegangstokens met verfris tokens.
ar: إنشاء رموز وصول JWT جديدة باستخدام رموز التحديث.
bg: Генерира нови JWT токени за достъп, използвайки токени за обновяване.
fa: تولید توکن‌های دسترسی JWT جدید با استفاده از توکن‌های تازه‌سازی.
fr: Génère de nouveaux jetons d'accès JWT en utilisant les jetons de renouvellement.
gl: Xera novos tokens JWT de acceso usando tokens de actualización.
he: יצירת אסימוני גישה JWT חדשים באמצעות אסימוני רענון.
hr: Generiraj nove JWT pristupne tokene koristeći refresh tokene.
id: Menghasilkan token akses JWT baru menggunakan token refresh.
ms: Menjana token akses JWT baru menggunakan token penyegaran.
pt: Gerar novos tokens de acesso JWT usando tokens de atualização.
sk: Vygeneruje nové JWT prístupové tokeny pomocou obnovovacích tokenov.
sr: Generiše nove JWT pristupne tokene koristeći refresh tokene.
sw: Inazalisha alama mpya za ufikiaji za JWT kwa kutumia alama za ubugarizi.
tr: Yenileme tokenlarını kullanarak yeni JWT erişim tokenları oluşturur.

source: Refresh tokens can be provided in request data or extracted automatically from HTTP cookies.
af: Verfris tokens kan verskaf word in versoekdata of outomaties onttrek word uit HTTP-koekies.
ar: يمكن توفير رموز التحديث في بيانات الطلب أو استخراجها تلقائياً من ملفات تعريف الارتباط HTTP.
bg: Токените за обновяване могат да бъдат предоставени в данните на заявката или извлечени автоматично от HTTP бисквитки.
fa: توکن‌های تازه‌سازی می‌توانند در داده‌های درخواست ارائه شوند یا به طور خودکار از کوکی‌های HTTP استخراج شوند.
fr: Les jetons de renouvellement peuvent être fournis dans les données de requête ou extraits automatiquement des cookies HTTP.
gl: Os tokens de actualización poden proporcionarse nos datos da solicitude ou extraerse automaticamente das cookies HTTP.
he: אסימוני רענון יכולים להיות מסופקים בנתוני הבקשה או מחולצים אוטומטית מעוגיות HTTP.
hr: Refresh tokeni se mogu dati u podacima zahtjeva ili automatski izdvojiti iz HTTP kolačića.
id: Token refresh dapat disediakan dalam data permintaan atau diekstrak secara otomatis dari cookie HTTP.
ms: Token penyegaran boleh disediakan dalam data permintaan atau diekstrak secara automatik dari cookie HTTP.
pt: Os tokens de atualização podem ser fornecidos nos dados da solicitação ou extraídos automaticamente dos cookies HTTP.
sk: Obnovovacie tokeny môžu byť poskytnuté v údajoch požiadavky alebo automaticky extrahované z HTTP súborov cookie.
sr: Refresh tokeni mogu biti dostavljeni u podacima zahteva ili automatski izvučeni iz HTTP kolačića.
sw: Alama za ubugarizi zinaweza kutolewa katika data ya ombi au kutolewa kiotomatiki kutoka kwenye vidakuzi vya HTTP.
tr: Yenileme tokenları istek verisinde sağlanabilir veya HTTP çerezlerinden otomatik olarak çıkarılabilir.

source: Returns new access tokens with updated expiration times.
af: Gee nuwe toegangstokens met bygewerkte vervaldatums terug.
ar: يعيد رموز وصول جديدة مع أوقات انتهاء محدثة.
bg: Връща нови токени за достъп с актуализирани времена на изтичане.
fa: توکن‌های دسترسی جدید با زمان انقضای به‌روزرسانی شده برگردانده می‌شود.
fr: Retourne de nouveaux jetons d'accès avec des temps d'expiration mis à jour.
gl: Devolve novos tokens de acceso con tempos de expiración actualizados.
he: מחזיר אסימוני גישה חדשים עם זמני תפוגה מעודכנים.
hr: Vraća nove pristupne tokene s ažuriranim vremenom isteka.
id: Mengembalikan token akses baru dengan waktu kedaluwarsa yang diperbarui.
ms: Memulangkan token akses baru dengan masa tamat tempoh yang dikemas kini.
pt: Retorna novos tokens de acesso com tempos de expiração atualizados.
sk: Vráti nové prístupové tokeny s aktualizovanými časmi vypršania.
sr: Vraća nove pristupne tokene sa ažuriranim vremenom isteka.
sw: Inarudisha alama mpya za ufikiaji zilizo na muda mpya wa kumalizika.
tr: Güncellenmiş süre sonu bilgileri ile yeni erişim tokenları döner.

source: New tokens are automatically set in HTTP cookies for secure storage.
af: Nuwe tokens word outomaties in HTTP-koekies gestel vir veilige berging.
ar: يتم تعيين الرموز الجديدة تلقائياً في ملفات تعريف الارتباط HTTP للتخزين الآمن.
bg: Новите токени се задават автоматично в HTTP бисквитки за сигурно съхранение.
fa: توکن‌های جدید به طور خودکار در کوکی‌های HTTP برای ذخیره امن تنظیم می‌شوند.
fr: Les nouveaux jetons sont automatiquement définis dans les cookies HTTP pour un stockage sécurisé.
gl: Os novos tokens configúranse automaticamente nas cookies HTTP para almacenamento seguro.
he: אסימונים חדשים מוגדרים אוטומטית בעוגיות HTTP לאחסון מאובטח.
hr: Novi tokeni se automatski postavljaju u HTTP kolačiće za sigurno čuvanje.
id: Token baru secara otomatis diatur dalam cookie HTTP untuk penyimpanan yang aman.
ms: Token baru ditetapkan secara automatik dalam cookie HTTP untuk penyimpanan yang selamat.
pt: Novos tokens são automaticamente definidos em cookies HTTP para armazenamento seguro.
sk: Nové tokeny sa automaticky nastavia do HTTP súborov cookie pre bezpečné ukladanie.
sr: Novi tokeni se automatski postavljaju u HTTP kolačiće za bezbedno čuvanje.
sw: Alama mpya zinawekwa kiotomatiki katika vidakuzi vya HTTP kwa kuhifadhi kwa usalama.
tr: Güvenli depolama için yeni tokenlar otomatik olarak HTTP çerezlerinde ayarlanır.

source: Refresh tokens must be provided in the request data.
af: Verfris tokens moet in die versoekdata verskaf word.
ar: يجب توفير رموز التحديث في بيانات الطلب.
bg: Токените за обновяване трябва да бъдат предоставени в данните на заявката.
fa: توکن‌های تازه‌سازی باید در داده‌های درخواست ارائه شوند.
fr: Les jetons de renouvellement doivent être fournis dans les données de la requête.
gl: Os tokens de actualización deben proporcionarse nos datos da solicitude.
he: אסימוני רענון חייבים להיות מסופקים בנתוני הבקשה.
hr: Refresh tokeni se moraju dati u podacima zahtjeva.
id: Token refresh harus disediakan dalam data permintaan.
ms: Token penyegaran mesti disediakan dalam data permintaan.
pt: Os tokens de atualização devem ser fornecidos nos dados da solicitação.
sk: Obnovovacie tokeny musia byť poskytnuté v údajoch požiadavky.
sr: Refresh tokeni moraju biti dostavljeni u podacima zahteva.
sw: Alama za ubugarizi lazima zitolewe katika data ya ombi.
tr: Yenileme tokenları istek verisinde sağlanmalıdır.

source: Register a new user account.
af: Registreer 'n nuwe gebruikersrekening.
ar: تسجيل حساب مستخدم جديد.
bg: Регистрира нов потребителски акаунт.
fa: ثبت نام حساب کاربری جدید.
fr: Enregistre un nouveau compte utilisateur.
gl: Rexistrar unha nova conta de usuario.
he: רישום חשבון משתמש חדש.
hr: Registriraj novi korisnički račun.
id: Mendaftarkan akun pengguna baru.
ms: Daftarkan akaun pengguna baru.
pt: Registrar uma nova conta de usuário.
sk: Registruje nový používateľský účet.
sr: Registruje novi korisnički nalog.
sw: Inasajili akaunti mpya ya mtumiaji.
tr: Yeni kullanıcı hesabı kaydeder.

source: Users must verify their email address before the account is fully activated.
af: Gebruikers moet hul e-posadres verifieer voordat die rekening volledig geaktiveer is.
ar: يجب على المستخدمين التحقق من عنوان البريد الإلكتروني قبل تفعيل الحساب بالكامل.
bg: Потребителите трябва да потвърдят своя имейл адрес, преди акаунтът да бъде пълно активиран.
fa: کاربران باید آدرس ایمیل خود را قبل از فعال‌سازی کامل حساب تأیید کنند.
fr: Les utilisateurs doivent vérifier leur adresse email avant que le compte ne soit entièrement activé.
gl: Os usuarios deben verificar o seu enderezo de correo electrónico antes de que a conta sexa completamente activada.
he: המשתמשים חייבים לאמת את כתובת הדוא״ל שלהם לפני שהחשבון יופעל לחלוטין.
hr: Korisnici moraju potvrditi svoju e-mail adresu prije nego što se račun potpuno aktivira.
id: Pengguna harus memverifikasi alamat email mereka sebelum akun sepenuhnya diaktifkan.
ms: Pengguna mesti mengesahkan alamat e-mel mereka sebelum akaun diaktifkan sepenuhnya.
pt: Os usuários devem verificar seu endereço de email antes da conta ser totalmente ativada.
sk: Používatelia musia overiť svoju e-mailovú adresu pred tým, ako bude účet úplne aktivovaný.
sr: Korisnici moraju verifikovati svoju email adresu pre nego što je nalog potpuno aktiviran.
sw: Watumiaji lazima wathibitishe anwani yao ya barua pepe kabla ya akaunti kuamilishwa kikamilifu.
tr: Hesap tam olarak etkinleştirilmeden önce kullanıcılar e-posta adreslerini doğrulamalıdır.
