Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.2-py3-none-any.whl/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: af, ar, bg, fa, fr, gl, he, hr, id, ms, pt, sk, sr, sw, tr

source: Send password reset instructions to the provided email address. If the email is registered, a secure reset link will be sent. The link expires after a limited time for security.
af: Stuur wagwoord-herstel instruksies na die verskafde e-posadres. As die e-pos geregistreer is, sal 'n veilige herstel skakel gestuur word. Die skakel verval na 'n beperkte tyd vir sekuriteit.
ar: إرسال تعليمات إعادة تعيين كلمة المرور إلى عنوان البريد الإلكتروني المقدم. إذا كان البريد الإلكتروني مسجلاً، سيتم إرسال رابط إعادة تعيين آمن. ينتهي الرابط بعد وقت محدود للأمان.
bg: Изпраща инструкции за нулиране на парола до предоставения имейл адрес. Ако имейлът е регистриран, ще бъде изпратена сигурна връзка за нулиране. Връзката изтича след ограничено време за сигурност.
fa: ارسال دستورالعمل بازنشانی کلمه عبور به آدرس ایمیل ارائه شده. اگر ایمیل ثبت شده باشد، یک لینک امن بازنشانی ارسال خواهد شد. این لینک پس از مدت محدود برای امنیت منقضی می‌شود.
fr: Envoie les instructions de réinitialisation du mot de passe à l'adresse email fournie. Si l'email est enregistré, un lien de réinitialisation sécurisé sera envoyé. Le lien expire après un temps limité pour la sécurité.
gl: Envía instrucións de restablecemento de contrasinal ao enderezo de correo electrónico proporcionado. Se o correo está rexistrado, enviarase unha ligazón segura de restablecemento. A ligazón expira tras un tempo limitado por seguridade.
he: שליחת הנחיות איפוס סיסמה לכתובת הדוא״ל שסופקה. אם הדוא״ל רשום, יישלח קישור איפוס מאובטח. הקישור תפוג לאחר זמן מוגבל לביטחון.
hr: Pošalji upute za ponovnu postavku lozinke na danu e-mail adresu. Ako je e-mail registriran, poslat će se sigurna veza za resetiranje. Veza istječe nakon ograničenog vremena radi sigurnosti.
id: Mengirim instruksi reset kata sandi ke alamat email yang diberikan. Jika email terdaftar, tautan reset yang aman akan dikirim. Tautan akan kedaluwarsa setelah waktu terbatas untuk keamanan.
ms: Hantar arahan tetapan semula kata laluan ke alamat e-mel yang disediakan. Jika e-mel telah didaftarkan, pautan tetapan semula yang selamat akan dihantar. Pautan akan tamat tempoh selepas masa terhad untuk keselamatan.
pt: Enviar instruções de redefinição de senha para o endereço de email fornecido. Se o email estiver registrado, um link seguro de redefinição será enviado. O link expira após um tempo limitado por segurança.
sk: Pošle pokyny na resetovanie hesla na poskytnutú e-mailovú adresu. Ak je e-mail registrovaný, pošle sa bezpečný odkaz na resetovanie. Odkaz z bezpečnostných dôvodov vyprší po obmedzenom čase.
sr: Šalje instrukcije za resetovanje lozinke na dostavljenu email adresu. Ako je email registrovan, biće poslana bezbedna veza za resetovanje. Veza ističe nakon ograničenog vremena iz bezbednosnih razloga.
sw: Inatuma maagizo ya kuweka upya nenosiri kwenye anwani ya barua pepe iliyotolewa. Ikiwa barua pepe imesajiliwa, kiungo cha usalama cha kuweka upya kitatumwa. Kiungo kinakwisha baada ya muda mchache kwa usalama.
tr: Belirtilen e-posta adresine şifre sıfırlama talimatları gönderir. E-posta kayıtlıysa, güvenli bir sıfırlama bağlantısı gönderilir. Bağlantı güvenlik için sınırlı süre sonra süresini dolmuş olur.

source: Complete the password reset process using the token from the reset email. Requires the UID and token from the email along with the new password. The token is single-use and expires for security.
af: Voltooi die wagwoord-herstel proses met die token uit die herstel e-pos. Vereis die UID en token uit die e-pos saam met die nuwe wagwoord. Die token is eenmalig-gebruik en verval vir sekuriteit.
ar: إكمال عملية إعادة تعيين كلمة المرور باستخدام الرمز من البريد الإلكتروني لإعادة التعيين. يتطلب معرف المستخدم والرمز من البريد الإلكتروني مع كلمة المرور الجديدة. الرمز للاستخدام مرة واحدة وينتهي للأمان.
bg: Завършва процеса на нулиране на парола, използвайки токена от имейла за нулиране. Изисква UID и токен от имейла заедно с новата парола. Токенът е за еднократна употреба и изтича за сигурност.
fa: تکمیل فرآیند بازنشانی کلمه عبور با استفاده از توکن ایمیل بازنشانی. شناسه کاربری و توکن از ایمیل همراه با کلمه عبور جدید مورد نیاز است. توکن یک‌بار مصرف و برای امنیت منقضی می‌شود.
fr: Complète le processus de réinitialisation du mot de passe en utilisant le jeton de l'email de réinitialisation. Nécessite l'UID et le jeton de l'email ainsi que le nouveau mot de passe. Le jeton est à usage unique et expire pour la sécurité.
gl: Completa o proceso de restablecemento de contrasinal usando o token do correo de restablecemento. Require o UID e o token do correo xunto co novo contrasinal. O token é de uso único e expira por seguridade.
he: השלמת תהליך איפוס הסיסמה באמצעות האסימון מדוא״ל האיפוס. דורש את ה-UID והאסימון מהדוא״ל יחד עם הסיסמה החדשה. האסימון הוא לשימוש חד-פעמי ותפוג לביטחון.
hr: Završi proces ponovne postavke lozinke koristeći token iz e-maila za resetiranje. Zahtijeva UID i token iz e-maila zajedno s novom lozinkom. Token se može koristiti samo jednom i istječe radi sigurnosti.
id: Menyelesaikan proses reset kata sandi menggunakan token dari email reset. Memerlukan UID dan token dari email beserta kata sandi baru. Token hanya dapat digunakan sekali dan akan kedaluwarsa untuk keamanan.
ms: Melengkapkan proses tetapan semula kata laluan menggunakan token dari e-mel tetapan semula. Memerlukan UID dan token dari e-mel bersama dengan kata laluan baru. Token adalah untuk kegunaan sekali dan tamat tempoh untuk keselamatan.
pt: Concluir o processo de redefinição de senha usando o token do email de redefinição. Requer o UID e token do email junto com a nova senha. O token é de uso único e expira por segurança.
sk: Dokončí proces resetovania hesla pomocou tokenu z resetovacieho e-mailu. Vyžaduje UID a token z e-mailu spolu s novým heslom. Token je jednorazový a z bezpečnostných dôvodov vyprší.
sr: Završava proces resetovanja lozinke koristeći token iz email-a za resetovanje. Zahteva UID i token iz email-a zajedno sa novom lozinkom. Token je za jednu upotrebu i ističe iz bezbednosnih razloga.
sw: Inamalizia mchakato wa kuweka upya nenosiri kwa kutumia alama kutoka kwenye barua pepe ya kuweka upya. Inahitaji UID na alama kutoka kwenye barua pepe pamoja na nenosiri jipya. Alama ni ya matumizi moja na inakwisha kwa usalama.
tr: Sıfırlama e-postasından gelen tokeni kullanarak şifre sıfırlama işlemini tamamlar. Yeni şifre ile birlikte e-postadaki UID ve token gereklidir. Token tek kullanımlıktır ve güvenlik için süresini dolmuş olur.

source: Change the current user's password. Requires authentication.
af: Verander die huidige gebruiker se wagwoord. Vereis verifikasie.
ar: تغيير كلمة مرور المستخدم الحالي. يتطلب المصادقة.
bg: Променя паролата на текущия потребител. Изисква удостоверяване.
fa: تغییر کلمه عبور کاربر فعلی. احراز هویت مورد نیاز است.
fr: Change le mot de passe de l'utilisateur actuel. Nécessite une authentification.
gl: Cambiar o contrasinal do usuario actual. Require autenticación.
he: שינוי סיסמת המשתמש הנוכחי. דורש אימות.
hr: Promijeni lozinku trenutnog korisnika. Zahtijeva autentifikaciju.
id: Mengubah kata sandi pengguna saat ini. Memerlukan autentikasi.
ms: Tukar kata laluan pengguna semasa. Memerlukan pengesahan.
pt: Alterar a senha do usuário atual. Requer autenticação.
sk: Zmení heslo aktuálneho používateľa. Vyžaduje autentifikáciu.
sr: Menja lozinku trenutnog korisnika. Zahteva autentifikaciju.
sw: Inabadilisha nenosiri la mtumiaji wa sasa. Inahitaji uthibitishaji.
tr: Mevcut kullanıcının şifresini değiştirir. Kimlik doğrulaması gereklidir.

source: Confirm email address using the verification key sent via email. This activates the user account and allows login access.
af: Bevestig e-posadres met die verifikasie sleutel wat via e-pos gestuur is. Dit aktiveer die gebruikersrekening en laat inteken toe.
ar: تأكيد عنوان البريد الإلكتروني باستخدام مفتاح التحقق المرسل عبر البريد الإلكتروني. هذا ينشط حساب المستخدم ويسمح بالوصول لتسجيل الدخول.
bg: Потвърждава имейл адреса, използвайки ключа за потвърждение, изпратен по имейл. Това активира потребителския акаунт и позволява достъп за влизане.
fa: تأیید آدرس ایمیل با استفاده از کلید تأیید ارسال شده از طریق ایمیل. این عمل حساب کاربری را فعال می‌کند و دسترسی ورود را امکان‌پذیر می‌سازد.
fr: Confirme l'adresse email en utilisant la clé de vérification envoyée par email. Ceci active le compte utilisateur et permet l'accès de connexion.
gl: Confirma o enderezo de correo electrónico usando a clave de verificación enviada por correo. Isto activa a conta de usuario e permite o acceso ao inicio de sesión.
he: אישור כתובת דוא״ל באמצעות מפתח האימות שנשלח בדוא״ל. זה מפעיל את חשבון המשתמש ומאפשר גישה לכניסה.
hr: Potvrdi e-mail adresu koristeći verifikacijski ključ poslan putem e-maila. Ovo aktivira korisnički račun i omogućuje pristup prijavi.
id: Mengonfirmasi alamat email menggunakan kunci verifikasi yang dikirim melalui email. Ini mengaktifkan akun pengguna dan memungkinkan akses masuk.
ms: Sahkan alamat e-mel menggunakan kunci pengesahan yang dihantar melalui e-mel. Ini mengaktifkan akaun pengguna dan membenarkan akses log masuk.
pt: Confirmar endereço de email usando a chave de verificação enviada por email. Isso ativa a conta do usuário e permite acesso de login.
sk: Potvrdí e-mailovú adresu pomocou overovacieho kľúča zaslaného e-mailom. Toto aktivuje používateľský účet a umožní prístup na prihlásenie.
sr: Potvrđuje email adresu koristeći ključ za verifikaciju poslan putem email-a. Ovo aktivira korisnički nalog i omogućava pristup za prijavljivanje.
sw: Inathibitisha anwani ya barua pepe kwa kutumia ufunguo wa uthibitishaji uliotumwa kupitia barua pepe. Hii inaamilisha akaunti ya mtumiaji na kuruhusu ufikiaji wa kuingia.
tr: E-posta ile gönderilen doğrulama anahtarını kullanarak e-posta adresini onaylar. Bu, kullanıcı hesabını etkinleştirir ve giriş erişimi sağlar.

source: Send a new email verification message to unverified email addresses. Only works for email addresses that are registered but not yet verified.
af: Stuur 'n nuwe e-pos verifikasie boodskap na ongeverifieerde e-posadresse. Werk slegs vir e-posadresse wat geregistreer is maar nog nie geverifieer is nie.
ar: إرسال رسالة تحقق بريد إلكتروني جديدة إلى عناوين البريد الإلكتروني غير المتحققة. يعمل فقط مع عناوين البريد الإلكتروني المسجلة ولكن لم يتم التحقق منها بعد.
bg: Изпраща ново съобщение за потвърждение на имейл до непотвърдени имейл адреси. Работи само за имейл адреси, които са регистрирани, но все още не са потвърдени.
fa: ارسال پیام تأیید ایمیل جدید به آدرس‌های ایمیل تأیید نشده. فقط برای آدرس‌های ایمیل که ثبت شده اما هنوز تأیید نشده‌اند کار می‌کند.
fr: Envoie un nouveau message de vérification par email aux adresses email non vérifiées. Fonctionne uniquement pour les adresses email enregistrées mais pas encore vérifiées.
gl: Envía unha nova mensaxe de verificación de correo electrónico aos enderezos non verificados. Só funciona para enderezos de correo rexistrados pero aínda non verificados.
he: שליחת הודעת אימות דוא״ל חדשה לכתובות דוא״ל לא מאומתות. עובד רק עבור כתובות דוא״ל שרשומות אבל עדיין לא מאומתות.
hr: Pošalji novu poruku verifikacije e-maila na nepotvrđene e-mail adrese. Funkcionira samo za e-mail adrese koje su registrirane ali još nisu potvrđene.
id: Mengirim pesan verifikasi email baru ke alamat email yang belum diverifikasi. Hanya berfungsi untuk alamat email yang terdaftar tetapi belum diverifikasi.
ms: Hantar mesej pengesahan e-mel baru ke alamat e-mel yang tidak disahkan. Hanya berfungsi untuk alamat e-mel yang didaftarkan tetapi belum disahkan.
pt: Enviar uma nova mensagem de verificação de email para endereços de email não verificados. Apenas funciona para endereços de email que estão registrados mas ainda não verificados.
sk: Pošle novú správu na overenie e-mailu na neoverené e-mailové adresy. Funguje len pre e-mailové adresy, ktoré sú registrované, ale ešte neoverené.
sr: Šalje novu poruku za verifikaciju email-a na nepotvrđene email adrese. Radi samo za email adrese koje su registrovane ali još nisu potvrđene.
sw: Inatuma ujumbe mpya wa uthibitishaji wa barua pepe kwa anwani za barua pepe ambazo hazijathibitishwa. Inafanya kazi tu kwa anwani za barua pepe ambazo zimesajiliwa lakini bado hazijathibitishwa.
tr: Doğrulanmamış e-posta adreslerine yeni e-posta doğrulama mesajı gönderir. Sadece kayıtlı ancak henüz doğrulanmamış e-posta adresleri için çalışır.

source: Retrieve the authenticated user's profile information including username, email, first name, and last name. Password fields are excluded.
af: Herwin die geverifieerde gebruiker se profiel inligting insluitend gebruikersnaam, e-pos, voornaam, en van. Wagwoord velde word uitgesluit.
ar: استرداد معلومات ملف المستخدم المصادق عليه بما في ذلك اسم المستخدم، البريد الإلكتروني، الاسم الأول، واسم العائلة. حقول كلمة المرور مستبعدة.
bg: Извлича информацията за профила на удостоверения потребител, включително потребителско име, имейл, собствено име и фамилия. Полетата за парола са изключени.
fa: بازیابی اطلاعات پروفایل کاربر احراز هویت شده شامل نام کاربری، ایمیل، نام و نام خانوادگی. فیلدهای کلمه عبور حذف می‌شوند.
fr: Récupère les informations de profil de l'utilisateur authentifié incluant nom d'utilisateur, email, prénom et nom. Les champs de mot de passe sont exclus.
gl: Recupera a información do perfil do usuario autenticado incluíndo nome de usuario, correo electrónico, nome e apelidos. Os campos de contrasinal están excluídos.
he: אחזור פרטי הפרופיל של המשתמש המאומת כולל שם משתמש, דוא״ל, שם פרטי ושם משפחה. שדות סיסמה מוחרגים.
hr: Dohvati informacije o profilu autentificiranog korisnika uključujući korisničko ime, e-mail, ime i prezime. Polja lozinke su isključena.
id: Mengambil informasi profil pengguna yang terautentikasi termasuk nama pengguna, email, nama depan, dan nama belakang. Bidang kata sandi dikecualikan.
ms: Dapatkan maklumat profil pengguna yang disahkan termasuk nama pengguna, e-mel, nama pertama, dan nama akhir. Medan kata laluan dikecualikan.
pt: Recuperar as informações do perfil do usuário autenticado, incluindo nome de usuário, email, primeiro nome e último nome. Campos de senha são excluídos.
sk: Získa informácie o profile autentifikovaného používateľa vrátane používateľského mena, e-mailu, mena a priezviska. Polia hesla sú vylúčené.
sr: Dohvata informacije o profilu autentifikovanog korisnika uključujući korisničko ime, email, ime i prezime. Polja za lozinku su isključena.
sw: Inapata taarifa za profaili ya mtumiaji aliyethibitishwa ikijumuisha jina la mtumiaji, barua pepe, jina la kwanza, na jina la mwisho. Uwanda wa nenosiri haujaambatishwa.
tr: Kimlik doğrulaması yapılmış kullanıcının kullanıcı adı, e-posta, ad ve soyad dahil profil bilgilerini alır. Şifre alanları hariç tutulur.

source: Update the authenticated user's profile information. Allows modification of username, first name, and last name. Email field is read-only for security.
af: Werk die geverifieerde gebruiker se profiel inligting by. Laat wysiging van gebruikersnaam, voornaam, en van toe. E-pos veld is lees-alleen vir sekuriteit.
ar: تحديث معلومات ملف المستخدم المصادق عليه. يسمح بتعديل اسم المستخدم، الاسم الأول، واسم العائلة. حقل البريد الإلكتروني للقراءة فقط للأمان.
bg: Актуализира информацията за профила на удостоверения потребител. Позволява промяна на потребителското име, собственото име и фамилията. Полето за имейл е само за четене за сигурност.
fa: به‌روزرسانی اطلاعات پروفایل کاربر احراز هویت شده. امکان تغییر نام کاربری، نام و نام خانوادگی را فراهم می‌کند. فیلد ایمیل برای امنیت فقط خواندنی است.
fr: Met à jour les informations de profil de l'utilisateur authentifié. Permet la modification du nom d'utilisateur, prénom et nom. Le champ email est en lecture seule pour la sécurité.
gl: Actualiza a información do perfil do usuario autenticado. Permite a modificación do nome de usuario, nome e apelidos. O campo de correo electrónico é só de lectura por seguridade.
he: עדכון פרטי הפרופיל של המשתמש המאומת. מאפשר שינוי של שם משתמש, שם פרטי ושם משפחה. שדה הדוא״ל הוא לקריאה בלבד לביטחון.
hr: Ažuriraj informacije o profilu autentificiranog korisnika. Omogućuje mijenjanje korisničkog imena, imena i prezimena. E-mail polje je samo za čitanje radi sigurnosti.
id: Memperbarui informasi profil pengguna yang terautentikasi. Memungkinkan modifikasi nama pengguna, nama depan, dan nama belakang. Bidang email bersifat baca-saja untuk keamanan.
ms: Kemas kini maklumat profil pengguna yang disahkan. Membenarkan pengubahsuaian nama pengguna, nama pertama, dan nama akhir. Medan e-mel adalah baca sahaja untuk keselamatan.
pt: Atualizar as informações do perfil do usuário autenticado. Permite modificação de nome de usuário, primeiro nome e último nome. O campo de email é somente leitura por segurança.
sk: Aktualizuje informácie o profile autentifikovaného používateľa. Umožňuje úpravu používateľského mena, mena a priezviska. Pole e-mailu je z bezpečnostných dôvodov len na čítanie.
sr: Ažurira informacije o profilu autentifikovanog korisnika. Omogućava izmenu korisničkog imena, imena i prezimena. Polje email-a je samo za čitanje iz bezbednosnih razloga.
sw: Inasasisha taarifa za profaili ya mtumiaji aliyethibitishwa. Inaruhusu urekebishaji wa jina la mtumiaji, jina la kwanza, na jina la mwisho. Uwanda wa barua pepe ni wa kusoma tu kwa usalama.
tr: Kimlik doğrulaması yapılmış kullanıcının profil bilgilerini günceller. Kullanıcı adı, ad ve soyad değişikliğine izin verir. E-posta alanı güvenlik için salt okunurdur.

source: Partially update the authenticated user's profile information. Only provided fields will be updated. Email field is read-only.
af: Werk die geverifieerde gebruiker se profiel inligting gedeeltelik by. Slegs verskafde velde sal bygewerk word. E-pos veld is lees-alleen.
ar: تحديث جزئي لمعلومات ملف المستخدم المصادق عليه. الحقول المقدمة فقط سيتم تحديثها. حقل البريد الإلكتروني للقراءة فقط.
bg: Частично актуализира информацията за профила на удостоверения потребител. Ще бъдат актуализирани само предоставените полета. Полето за имейл е само за четене.
fa: به‌روزرسانی جزئی اطلاعات پروفایل کاربر احراز هویت شده. فقط فیلدهای ارائه شده به‌روزرسانی خواهند شد. فیلد ایمیل فقط خواندنی است.
fr: Met à jour partiellement les informations de profil de l'utilisateur authentifié. Seuls les champs fournis seront mis à jour. Le champ email est en lecture seule.
gl: Actualiza parcialmente a información do perfil do usuario autenticado. Só os campos proporcionados serán actualizados. O campo de correo electrónico é só de lectura.
he: עדכון חלקי של פרטי הפרופיל של המשתמש המאומת. רק השדות שסופקו יעודכנו. שדה הדוא״ל הוא לקריאה בלבד.
hr: Djelomično ažuriraj informacije o profilu autentificiranog korisnika. Ažurirat će se samo dana polja. E-mail polje je samo za čitanje.
id: Memperbarui sebagian informasi profil pengguna yang terautentikasi. Hanya bidang yang disediakan yang akan diperbarui. Bidang email bersifat baca-saja.
ms: Kemas kini sebahagian maklumat profil pengguna yang disahkan. Hanya medan yang disediakan akan dikemas kini. Medan e-mel adalah baca sahaja.
pt: Atualizar parcialmente as informações do perfil do usuário autenticado. Apenas campos fornecidos serão atualizados. O campo de email é somente leitura.
sk: Čiastočne aktualizuje informácie o profile autentifikovaného používateľa. Aktualizujú sa len poskytnuté polia. Pole e-mailu je len na čítanie.
sr: Delimično ažurira informacije o profilu autentifikovanog korisnika. Ažuriraće se samo dostavljena polja. Polje email-a je samo za čitanje.
sw: Inasasisha kwa sehemu taarifa za profaili ya mtumiaji aliyethibitishwa. Ni uwanda uliotolewa tu utakao sasishwa. Uwanda wa barua pepe ni wa kusoma tu.
tr: Kimlik doğrulaması yapılmış kullanıcının profil bilgilerini kısmen günceller. Sadece sağlanan alanlar güncellenecektir. E-posta alanı salt okunurdur.

source: The email address is not assigned to any user account.
af: Die e-posadres is nie toegeken aan enige gebruikersrekening nie.
ar: عنوان البريد الإلكتروني غير مخصص لأي حساب مستخدم.
bg: Имейл адресът не е присвоен на никой потребителски акаунт.
fa: آدرس ایمیل به هیچ حساب کاربری اختصاص داده نشده است.
fr: L'adresse email n'est assignée à aucun compte utilisateur.
gl: O enderezo de correo electrónico non está asignado a ningunha conta de usuario.
he: כתובת הדוא״ל אינה מוקצית לאף חשבון משתמש.
hr: E-mail adresa nije dodijeljena nijednom korisničkom računu.
id: Alamat email tidak ditetapkan ke akun pengguna mana pun.
ms: Alamat e-mel tidak diperuntukkan kepada mana-mana akaun pengguna.
pt: O endereço de email não está atribuído a nenhuma conta de usuário.
sk: E-mailová adresa nie je priradená k žiadnemu používateľskému účtu.
sr: Email adresa nije dodeljena nijednom korisničkom nalogu.
sw: Anwani ya barua pepe haijapangwa kwa akaunti yoyote ya mtumiaji.
tr: E-posta adresi hiçbir kullanıcı hesabına atanmamış.

source: Requested MFA method does not exist.
af: Versoekte MFA-metode bestaan nie.
ar: طريقة المصادقة متعددة العوامل المطلوبة غير موجودة.
bg: Заявеният MFA метод не съществува.
fa: روش MFA درخواست شده وجود ندارد.
fr: La méthode MFA demandée n'existe pas.
gl: O método MFA solicitado non existe.
he: שיטת האימות הרב-שלבי המבוקשת אינה קיימת.
hr: Zahtijevana MFA metoda ne postoji.
id: Metode MFA yang diminta tidak ada.
ms: Kaedah MFA yang diminta tidak wujud.
pt: O método MFA solicitado não existe.
sk: Požadovaná MFA metóda neexistuje.
sr: Zahtevana MFA metoda ne postoji.
sw: Njia ya MFA iliyoombwa haipo.
tr: İstenen MFA yöntemi mevcut değil.

source: Email message with MFA code has been sent.
af: E-pos boodskap met MFA-kode is gestuur.
ar: تم إرسال رسالة بريد إلكتروني مع رمز المصادقة متعددة العوامل.
bg: Имейл съобщение с MFA код е изпратено.
fa: پیام ایمیل همراه با کد MFA ارسال شده است.
fr: Le message email avec le code MFA a été envoyé.
gl: Enviouse unha mensaxe de correo electrónico co código MFA.
he: הודעת דוא״ל עם קוד אימות רב-שלבי נשלחה.
hr: E-mail poruka s MFA kodom je poslana.
id: Pesan email dengan kode MFA telah dikirim.
ms: Mesej e-mel dengan kod MFA telah dihantar.
pt: Mensagem de email com código MFA foi enviada.
sk: E-mailová správa s MFA kódom bola odoslaná.
sr: Email poruka sa MFA kodom je poslana.
sw: Ujumbe wa barua pepe wenye msimbo wa MFA umetumwa.
tr: MFA kodu ile e-posta mesajı gönderildi.

source: MFA code expires in {} seconds.
af: MFA-kode verval in {} sekondes.
ar: رمز المصادقة متعددة العوامل ينتهي في {} ثانية.
bg: MFA кодът изтича след {} секунди.
fa: کد MFA در {} ثانیه منقضی می‌شود.
fr: Le code MFA expire dans {} secondes.
gl: O código MFA expira en {} segundos.
he: קוד האימות הרב-שלבי תפוג בעוד {} שניות.
hr: MFA kod istječe za {} sekundi.
id: Kode MFA akan kedaluwarsa dalam {} detik.
ms: Kod MFA tamat tempoh dalam {} saat.
pt: O código MFA expira em {} segundos.
sk: MFA kód vyprší za {} sekúnd.
sr: MFA kod ističe za {} sekundi.
sw: Msimbo wa MFA unakwisha katika sekunde {}.
tr: MFA kodu {} saniye içinde süresi dolacak.
