Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.2-py3-none-any.whl/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: af, ar, bg, fa, fr, gl, he, hr, id, ms, pt, sk, sr, sw, tr

source: First step of MFA-enabled authentication. Validates credentials and initiates MFA flow.
af: Eerste stap van MFA-geaktiveerde verifikasie. Bevestig geloofsbriewe en begin MFA-vloei.
ar: الخطوة الأولى من المصادقة المفعلة بـ MFA. يتحقق من الاعتمادات و يبدأ تدفق MFA.
bg: Първа стъпка от удостоверяване с активиран MFA. Валидира удостоверяванията и започва MFA процес.
fa: مرحله اول احراز هویت با MFA فعال. اعتبارسنجی اعتبارنامه‌ها و شروع جریان MFA.
fr: Première étape de l'authentification avec MFA activée. Valide les identifiants et initie le flux MFA.
gl: Primeiro paso da autenticación con MFA activado. Valida as credenciais e inicia o fluxo MFA.
he: השלב הראשון של אימות עם אימות רב-שלבי. מאמת אישורים ומתחיל תהליך אימות רב-שלבי.
hr: Prvi korak MFA-omogućene autentifikacije. Valjaničarski podaci i pokretanje MFA tijeka.
id: Langkah pertama autentikasi yang diaktifkan MFA. Memvalidasi kredensial dan memulai alur MFA.
ms: Langkah pertama pengesahan yang dibolehkan MFA. Mengesahkan kelayakan dan memulakan aliran MFA.
pt: Primeiro passo da autenticação habilitada para MFA. Valida credenciais e inicia o fluxo MFA.
sk: Prvý krok autentifikácie s povolenou MFA. Overuje poverenia a iniciuje MFA tok.
sr: Prvi korak autentifikacije sa omogućenom MFA. Validira pristupne podatke i pokreće MFA tok.
sw: Hatua ya kwanza ya uthibitishaji uliowezeshwa na MFA. Inathibitisha hati za utambulisho na kuanzisha mtiririko wa MFA.
tr: MFA-etkin kimlik doğrulamasının ilk adımı. Kimlik bilgilerini doğrular ve MFA akışını başlatır.

source: Returns ephemeral token for MFA verification or complete {} if MFA is disabled.
af: Gee kortstondige token vir MFA-verifikasie of volledige {} as MFA gedeaktiveer is.
ar: يعيد رمز مؤقت للتحقق من MFA أو {} كاملة إذا كان MFA معطل.
bg: Връща временен токен за MFA потвърждение или пълни {}, ако MFA е деактивиран.
fa: توکن موقت برای تأیید MFA یا {} کامل در صورت غیرفعال بودن MFA برگردانده می‌شود.
fr: Retourne un jeton éphémère pour la vérification MFA ou {} complet si MFA est désactivée.
gl: Devolve un token efémero para verificación MFA ou {} completos se MFA está desactivado.
he: מחזיר אסימון זמני לאימות רב-שלבי או {} מלאים אם אימות רב-שלבי מבוטל.
hr: Vraća privremeni token za MFA verifikaciju ili kompletne {} ako je MFA onemogućen.
id: Mengembalikan token sementara untuk verifikasi MFA atau {} lengkap jika MFA dinonaktifkan.
ms: Memulangkan token sementara untuk pengesahan MFA atau lengkap {} jika MFA dilumpuhkan.
pt: Retorna token efêmero para verificação MFA ou completa {} se MFA estiver desabilitada.
sk: Vráti dočasný token na MFA overenie alebo kompletné {} ak je MFA zakázaná.
sr: Vraća privremeni token za MFA verifikaciju ili kompletne {} ako je MFA onemogućena.
sw: Inarudisha alama ya muda mfupi kwa uthibitishaji wa MFA au {} kamili ikiwa MFA imezimwa.
tr: MFA doğrulaması için geçici token döner veya MFA devre dışıysa tam {} döner.

source: Complete MFA authentication using verification code and ephemeral token.
af: Voltooi MFA-verifikasie met verifikasie kode en kortstondige token.
ar: إكمال مصادقة MFA باستخدام رمز التحقق والرمز المؤقت.
bg: Завършва MFA удостоверяването, използвайки код за потвърждение и временен токен.
fa: تکمیل احراز هویت MFA با استفاده از کد تأیید و توکن موقت.
fr: Complète l'authentification MFA en utilisant le code de vérification et le jeton éphémère.
gl: Completa a autenticación MFA usando código de verificación e token efémero.
he: השלמת אימות רב-שלבי באמצעות קוד אימות ואסימון זמני.
hr: Završi MFA autentifikaciju koristeći verifikacijski kod i privremeni token.
id: Menyelesaikan autentikasi MFA menggunakan kode verifikasi dan token sementara.
ms: Melengkapkan pengesahan MFA menggunakan kod pengesahan dan token sementara.
pt: Completar autenticação MFA usando código de verificação e token efêmero.
sk: Dokončí MFA autentifikáciu pomocou overovacieho kódu a dočasného tokenu.
sr: Završava MFA autentifikaciju koristeći kod za verifikaciju i privremeni token.
sw: Inamalizia uthibitishaji wa MFA kwa kutumia msimbo wa uthibitishaji na alama ya muda mfupi.
tr: Doğrulama kodu ve geçici token kullanarak MFA kimlik doğrulamasını tamamlar.

source: Supports both TOTP codes and backup codes for verification.
af: Ondersteun beide TOTP-kodes en rugsteun-kodes vir verifikasie.
ar: يدعم كلاً من رموز TOTP والرموز الاحتياطية للتحقق.
bg: Поддържа както TOTP кодове, така и резервни кодове за потвърждение.
fa: از کدهای TOTP و کدهای پشتیبان برای تأیید پشتیبانی می‌کند.
fr: Prend en charge les codes TOTP et les codes de secours pour la vérification.
gl: Admite tanto códigos TOTP como códigos de respaldo para verificación.
he: תומך גם בקודי TOTP וגם בקודי גיבוי לאימות.
hr: Podržava i TOTP kodove i sigurnosne kodove za verifikaciju.
id: Mendukung kode TOTP dan kode cadangan untuk verifikasi.
ms: Menyokong kod TOTP dan kod sandaran untuk pengesahan.
pt: Suporta códigos TOTP e códigos de backup para verificação.
sk: Podporuje TOTP kódy aj záložné kódy na overenie.
sr: Podržava TOTP kodove i rezervne kodove za verifikaciju.
sw: Inasaidia misimbo ya TOTP na misimbo ya kuhifadhi kwa uthibitishaji.
tr: Doğrulama için hem TOTP kodlarını hem de yedek kodları destekler.

source: Switch to a different MFA method during authentication flow.
af: Skakel na 'n ander MFA-metode tydens verifikasie-vloei.
ar: التبديل إلى طريقة MFA مختلفة أثناء تدفق المصادقة.
bg: Превключва към различен MFA метод по време на процеса на удостоверяване.
fa: تغییر به روش MFA متفاوت در طول جریان احراز هویت.
fr: Passe à une méthode MFA différente pendant le flux d'authentification.
gl: Cambiar a un método MFA diferente durante o fluxo de autenticación.
he: מעבר לשיטת אימות רב-שלבי אחרת במהלך תהליך האימות.
hr: Prebaci na drugu MFA metodu tijekom tijeka autentifikacije.
id: Beralih ke metode MFA yang berbeda selama alur autentikasi.
ms: Tukar kepada kaedah MFA yang berbeza semasa aliran pengesahan.
pt: Mudar para um método MFA diferente durante o fluxo de autenticação.
sk: Prepne na inú MFA metódu počas autentifikačného toku.
sr: Prebacuje na drugu MFA metodu tokom toka autentifikacije.
sw: Inabadilisha kwenda njia nyingine ya MFA wakati wa mtiririko wa uthibitishaji.
tr: Kimlik doğrulama akışı sırasında farklı bir MFA yöntemine geçiş yapar.

source: Requires valid ephemeral token from first step authentication.
af: Vereis geldige kortstondige token van eerste stap verifikasie.
ar: يتطلب رمز مؤقت صالح من مصادقة الخطوة الأولى.
bg: Изисква валиден временен токен от първата стъпка на удостоверяване.
fa: توکن موقت معتبر از مرحله اول احراز هویت مورد نیاز است.
fr: Nécessite un jeton éphémère valide de la première étape d'authentification.
gl: Require un token efémero válido da autenticación do primeiro paso.
he: דורש אסימון זמני תקין מהשלב הראשון של האימות.
hr: Zahtijeva valjani privremeni token iz prvog koraka autentifikacije.
id: Memerlukan token sementara yang valid dari autentikasi langkah pertama.
ms: Memerlukan token sementara yang sah dari pengesahan langkah pertama.
pt: Requer token efêmero válido da autenticação do primeiro passo.
sk: Vyžaduje platný dočasný token z prvého kroku autentifikácie.
sr: Zahteva važeći privremeni token iz prvog koraka autentifikacije.
sw: Inahitaji alama halali ya muda mfupi kutoka kwenye uthibitishaji wa hatua ya kwanza.
tr: İlk adım kimlik doğrulamasından geçerli geçici token gerektirir.

source: New ephemeral token expires in {} seconds.
af: Nuwe kortstondige token verval in {} sekondes.
ar: الرمز المؤقت الجديد ينتهي في {} ثانية.
bg: Новият временен токен изтича след {} секунди.
fa: توکن موقت جدید در {} ثانیه منقضی می‌شود.
fr: Le nouveau jeton éphémère expire dans {} secondes.
gl: O novo token efémero expira en {} segundos.
he: אסימון זמני חדש תפוג בעוד {} שניות.
hr: Novi privremeni token istječe za {} sekundi.
id: Token sementara baru akan kedaluwarsa dalam {} detik.
ms: Token sementara baru tamat tempoh dalam {} saat.
pt: Novo token efêmero expira em {} segundos.
sk: Nový dočasný token vyprší za {} sekúnd.
sr: Novi privremeni token ističe za {} sekundi.
sw: Alama mpya ya muda mfupi inakwisha katika sekunde {}.
tr: Yeni geçici token {} saniye içinde süresi dolacak.

source: Resend MFA verification code using existing ephemeral token.
af: Stuur MFA-verifikasie kode weer met bestaande kortstondige token.
ar: إعادة إرسال رمز التحقق من MFA باستخدام الرمز المؤقت الموجود.
bg: Препраща MFA кода за потвърждение, използвайки съществуващия временен токен.
fa: ارسال مجدد کد تأیید MFA با استفاده از توکن موقت موجود.
fr: Renvoie le code de vérification MFA en utilisant le jeton éphémère existant.
gl: Reenvia o código de verificación MFA usando o token efémero existente.
he: שליחה מחדש של קוד אימות רב-שלבי באמצעות אסימון זמני קיים.
hr: Pošalji ponovno MFA verifikacijski kod koristeći postojeći privremeni token.
id: Mengirim ulang kode verifikasi MFA menggunakan token sementara yang ada.
ms: Hantar semula kod pengesahan MFA menggunakan token sementara yang sedia ada.
pt: Reenviar código de verificação MFA usando token efêmero existente.
sk: Znovu pošle MFA overovací kód pomocou existujúceho dočasného tokenu.
sr: Ponovo šalje MFA kod za verifikaciju koristeći postojeći privremeni token.
sw: Inatuma tena msimbo wa uthibitishaji wa MFA kwa kutumia alama ya muda mfupi iliyopo.
tr: Mevcut geçici token kullanarak MFA doğrulama kodunu yeniden gönderir.

source: Only applicable for methods that require code dispatch (e.g., email).
af: Net van toepassing op metodes wat kode-versending vereis (bv. e-pos).
ar: ينطبق فقط على الطرق التي تتطلب إرسال رمز (مثل البريد الإلكتروني).
bg: Приложимо само за методи, които изискват изпращане на код (напр. имейл).
fa: فقط برای روش‌هایی که نیاز به ارسال کد دارند (مثلاً ایمیل) قابل اجرا است.
fr: Applicable uniquement pour les méthodes qui nécessitent l'envoi de code (par exemple, email).
gl: Só aplicable para métodos que requiren envío de código (por exemplo, correo electrónico).
he: חל רק על שיטות שדורשות שליחת קוד (למשל, דוא״ל).
hr: Primjenjivo samo za metode koje zahtijevaju slanje koda (npr. e-mail).
id: Hanya berlaku untuk metode yang memerlukan pengiriman kode (misalnya, email).
ms: Hanya terpakai untuk kaedah yang memerlukan penghantaran kod (contohnya, e-mel).
pt: Aplicável apenas para métodos que requerem envio de código (por exemplo, email).
sk: Platí len pre metódy, ktoré vyžadujú odoslanie kódu (napr. e-mail).
sr: Primenjuje se samo na metode koje zahtevaju slanje koda (npr. email).
sw: Inatumika tu kwa njia zinazohitaji utumaji wa msimbo (k.v., barua pepe).
tr: Sadece kod gönderimi gerektiren yöntemler için geçerlidir (örn., e-posta).

source: List all available MFA methods with their setup and activation status. Shows which methods are configured, active, and set as primary.
af: Lys alle beskikbare MFA-metodes met hul opstelling en aktivering status. Wys watter metodes gekonfigureer, aktief, en as primêr gestel is.
ar: قائمة بجميع طرق MFA المتاحة مع حالة الإعداد والتفعيل. يظهر الطرق المكونة والنشطة والمعينة كأساسية.
bg: Изброява всички налични MFA методи с техния статус на настройка и активиране. Показва кои методи са конфигурирани, активни и зададени като основни.
fa: فهرست تمام روش‌های MFA موجود با وضعیت راه‌اندازی و فعال‌سازی آن‌ها. نشان می‌دهد کدام روش‌ها پیکربندی شده، فعال و به عنوان اصلی تنظیم شده‌اند.
fr: Liste toutes les méthodes MFA disponibles avec leur statut de configuration et d'activation. Montre quelles méthodes sont configurées, actives et définies comme principales.
gl: Lista todos os métodos MFA dispoñibles co seu estado de configuración e activación. Mostra que métodos están configurados, activos e establecidos como primarios.
he: רשימה של כל שיטות האימות הרב-שלבי הזמינות עם מצב ההגדרה והפעלה שלהן. מציג אילו שיטות מוגדרות, פעילות, ומוגדרות כראשיות.
hr: Ispiši sve dostupne MFA metode s njihovim statusom postavke i aktivacije. Prikazuje koje su metode konfigurirane, aktivne i postavljen kao primarne.
id: Membuat daftar semua metode MFA yang tersedia dengan status pengaturan dan aktivasi mereka. Menunjukkan metode mana yang dikonfigurasi, aktif, dan ditetapkan sebagai utama.
ms: Senaraikan semua kaedah MFA yang tersedia dengan status persediaan dan pengaktifan mereka. Menunjukkan kaedah mana yang dikonfigurasi, aktif, dan ditetapkan sebagai utama.
pt: Listar todos os métodos MFA disponíveis com seus status de configuração e ativação. Mostra quais métodos estão configurados, ativos e definidos como primários.
sk: Zoznam všetkých dostupných MFA metód s ich stavom nastavenia a aktivácie. Zobrazuje, ktoré metódy sú nakonfigurované, aktívne a nastavené ako primárne.
sr: Prikazuje sve dostupne MFA metode sa njihovim statusom podešavanja i aktivacije. Pokazuje koje metode su konfigurisane, aktivne i postavljene kao primarne.
sw: Inaorodhesha njia zote za MFA zinazopatikana pamoja na hali zao za mipangilio na uamilishaji. Inaonyesha njia gani zimepangwa, ni amilifu, na zimewekwa kama za msingi.
tr: Tüm mevcut MFA yöntemlerini kurulum ve etkinleştirme durumları ile listeler. Hangi yöntemlerin yapılandırıldığını, etkin olduğunu ve birincil olarak ayarlandığını gösterir.

source: Initialize a new MFA method setup. Creates the method with backup codes and returns setup instructions (e.g., QR code for authenticator apps). Method must be confirmed before activation.
af: Inisialiseer 'n nuwe MFA-metode opstelling. Skep die metode met rugsteun-kodes en gee opstelling instruksies (bv. QR-kode vir verifikasie-apps). Metode moet bevestig word voor aktivering.
ar: تهيئة إعداد طريقة MFA جديدة. ينشئ الطريقة مع رموز احتياطية و يعيد تعليمات الإعداد (مثل رمز QR لتطبيقات المصادقة). يجب تأكيد الطريقة قبل التفعيل.
bg: Инициализира настройката на нов MFA метод. Създава метода с резервни кодове и връща инструкции за настройка (напр. QR код за приложения за удостоверяване). Методът трябва да бъде потвърден преди активиране.
fa: راه‌اندازی یک روش MFA جدید. روش را با کدهای پشتیبان ایجاد می‌کند و دستورالعمل راه‌اندازی (مثلاً QR کد برای برنامه‌های احراز هویت) برمی‌گرداند. روش باید قبل از فعال‌سازی تأیید شود.
fr: Initialise la configuration d'une nouvelle méthode MFA. Crée la méthode avec des codes de secours et retourne les instructions de configuration (par exemple, QR code pour les applications d'authentification). La méthode doit être confirmée avant l'activation.
gl: Inicializa a configuración dun novo método MFA. Crea o método con códigos de respaldo e devolve instrucións de configuración (por exemplo, código QR para aplicacións de autenticación). O método debe confirmarse antes da activación.
he: אתחול הגדרת שיטת אימות רב-שלבי חדשה. יוצר את השיטה עם קודי גיבוי ומחזיר הנחיות הגדרה (למשל, קוד QR לאפליקציות אימות). השיטה חייבת להיות מאושרת לפני הפעלה.
hr: Pokretanje nove MFA metode postavke. Stvara metodu sa sigurnosnim kodovima i vraća upute za postavku (npr. QR kod za aplikacije autentifikatora). Metoda mora biti potvrđena prije aktivacije.
id: Menginisialisasi pengaturan metode MFA baru. Membuat metode dengan kode cadangan dan mengembalikan instruksi pengaturan (misalnya, kode QR untuk aplikasi autentikator). Metode harus dikonfirmasi sebelum aktivasi.
ms: Mulakan persediaan kaedah MFA baru. Mencipta kaedah dengan kod sandaran dan memulangkan arahan persediaan (contohnya, kod QR untuk aplikasi pengesah). Kaedah mesti disahkan sebelum pengaktifan.
pt: Inicializar configuração de um novo método MFA. Cria o método com códigos de backup e retorna instruções de configuração (por exemplo, código QR para aplicativos autenticadores). O método deve ser confirmado antes da ativação.
sk: Inicializuje nastavenie novej MFA metódy. Vytvorí metódu so záložnými kódmi a vráti pokyny na nastavenie (napr. QR kód pre autentifikačné aplikácie). Metóda musí byť potvrdená pred aktiváciou.
sr: Inicijalizuje podešavanje nove MFA metode. Kreira metodu sa rezervnim kodovima i vraća instrukcije za podešavanje (npr. QR kod za aplikacije za autentifikaciju). Metoda mora biti potvrđena pre aktivacije.
sw: Inaanzisha mipangilio ya njia mpya ya MFA. Inaunda njia pamoja na misimbo ya kuhifadhi na kurudi maagizo ya mipangilio (k.v., msimbo wa QR kwa programu za uthibitishaji). Njia lazima ithibitishwe kabla ya uamilishaji.
tr: Yeni MFA yöntem kurulumunu başlatır. Yedek kodlarla yöntemi oluşturur ve kurulum talimatlarını döner (örn., authenticator uygulamaları için QR kod). Etkinleştirmeden önce yöntem onaylanmalıdır.

source: Confirm and activate a newly created MFA method using verification code. Automatically sets as primary method if no other primary method exists. Required before the method can be used for authentication.
af: Bevestig en aktiveer 'n nuutgeskepte MFA-metode met verifikasie kode. Stel outomaties as primêre metode as geen ander primêre metode bestaan nie. Vereis voor die metode gebruik kan word vir verifikasie.
ar: تأكيد وتفعيل طريقة MFA المنشأة حديثاً باستخدام رمز التحقق. يتم تعيينها تلقائياً كطريقة أساسية إذا لم توجد طريقة أساسية أخرى. مطلوب قبل أن يمكن استخدام الطريقة للمصادقة.
bg: Потвърждава и активира новосъздаден MFA метод, използвайки код за потвърждение. Автоматично се задава като основен метод, ако не съществува друг основен метод. Изисква се преди методът да може да бъде използван за удостоверяване.
fa: تأیید و فعال‌سازی روش MFA تازه ایجاد شده با استفاده از کد تأیید. به طور خودکار به عنوان روش اصلی تنظیم می‌شود اگر هیچ روش اصلی دیگری وجود نداشته باشد. قبل از استفاده روش برای احراز هویت ضروری است.
fr: Confirme et active une méthode MFA nouvellement créée en utilisant le code de vérification. Se définit automatiquement comme méthode principale si aucune autre méthode principale n'existe. Requis avant que la méthode puisse être utilisée pour l'authentification.
gl: Confirma e activa un método MFA recén creado usando código de verificación. Establécese automaticamente como método primario se non existe outro método primario. Requerido antes de que o método poida usarse para autenticación.
he: אישור והפעלה של שיטת אימות רב-שלבי חדשה שנוצרה באמצעות קוד אימות. מגדיר אוטומטית כשיטה ראשית אם לא קיימת שיטה ראשית אחרת. נדרש לפני שניתן להשתמש בשיטה לאימות.
hr: Potvrdi i aktiviraj novo stvorenu MFA metodu koristeći verifikacijski kod. Automatski postavlja kao primarnu metodu ako ne postoji druga primarna metoda. Potrebno prije nego što se metoda može koristiti za autentifikaciju.
id: Mengonfirmasi dan mengaktifkan metode MFA yang baru dibuat menggunakan kode verifikasi. Secara otomatis menetapkan sebagai metode utama jika tidak ada metode utama lain yang ada. Diperlukan sebelum metode dapat digunakan untuk autentikasi.
ms: Sahkan dan aktifkan kaedah MFA yang baru dicipta menggunakan kod pengesahan. Secara automatik menetapkan sebagai kaedah utama jika tiada kaedah utama lain wujud. Diperlukan sebelum kaedah boleh digunakan untuk pengesahan.
pt: Confirmar e ativar um método MFA recém-criado usando código de verificação. Automaticamente define como método primário se nenhum outro método primário existir. Obrigatório antes que o método possa ser usado para autenticação.
sk: Potvrdí a aktivuje novo vytvorenú MFA metódu pomocou overovacieho kódu. Automaticky sa nastaví ako primárna metóda, ak neexistuje žiadna iná primárna metóda. Vyžaduje sa pred použitím metódy na autentifikáciu.
sr: Potvrđuje i aktivira novo kreiranu MFA metodu koristeći kod za verifikaciju. Automatski postavlja kao primarnu metodu ako ne postoji druga primarna metoda. Potrebno pre nego što se metoda može koristiti za autentifikaciju.
sw: Inathibitisha na kuamilisha njia ya MFA iliyoundwa hivi karibuni kwa kutumia msimbo wa uthibitishaji. Huweka kiotomatiki kama njia ya msingi ikiwa hakuna njia nyingine ya msingi. Inahitajika kabla njia haijaweza kutumiwa kwa uthibitishaji.
tr: Doğrulama kodu kullanarak yeni oluşturulan MFA yöntemini onaylar ve etkinleştirir. Başka bir birincil yöntem yoksa otomatik olarak birincil yöntem olarak ayarlar. Yöntem kimlik doğrulaması için kullanılmadan önce gereklidir.

source: Deactivate an active MFA method. Requires verification code from the method itself. Cannot deactivate primary methods - set another method as primary first.
af: Deaktiveer 'n aktiewe MFA-metode. Vereis verifikasie kode van die metode self. Kan nie primêre metodes deaktiveer nie - stel eers 'n ander metode as primêr.
ar: إلغاء تفعيل طريقة MFA نشطة. يتطلب رمز التحقق من الطريقة نفسها. لا يمكن إلغاء تفعيل الطرق الأساسية - اعين طريقة أخرى كأساسية أولاً.
bg: Деактивира активен MFA метод. Изисква код за потвърждение от самия метод. Не може да деактивира основни методи - първо задайте друг метод като основен.
fa: غیرفعال کردن روش MFA فعال. کد تأیید از خود روش مورد نیاز است. نمی‌توان روش‌های اصلی را غیرفعال کرد - ابتدا روش دیگری را به عنوان اصلی تنظیم کنید.
fr: Désactive une méthode MFA active. Nécessite un code de vérification de la méthode elle-même. Impossible de désactiver les méthodes principales - définir d'abord une autre méthode comme principale.
gl: Desactiva un método MFA activo. Require código de verificación do propio método. Non se poden desactivar métodos primarios - establecer outro método como primario primeiro.
he: ביטול הפעלה של שיטת אימות רב-שלבי פעילה. דורש קוד אימות מהשיטה עצמה. לא ניתן לבטל שיטות ראשיות - יש להגדיר שיטה אחרת כראשית תחילה.
hr: Deaktiviraj aktivnu MFA metodu. Zahtijeva verifikacijski kod iz same metode. Ne može deaktivirati primarne metode - prvo postavi drugu metodu kao primarnu.
id: Menonaktifkan metode MFA yang aktif. Memerlukan kode verifikasi dari metode itu sendiri. Tidak dapat menonaktifkan metode utama - tetapkan metode lain sebagai utama terlebih dahulu.
ms: Nyahaktifkan kaedah MFA yang aktif. Memerlukan kod pengesahan dari kaedah itu sendiri. Tidak boleh nyahaktifkan kaedah utama - tetapkan kaedah lain sebagai utama dahulu.
pt: Desativar um método MFA ativo. Requer código de verificação do próprio método. Não é possível desativar métodos primários - defina outro método como primário primeiro.
sk: Deaktivuje aktívnu MFA metódu. Vyžaduje overovací kód z metódy samotnej. Nemôže deaktivovať primárne metódy - najprv nastavte inú metódu ako primárnu.
sr: Deaktivira aktivnu MFA metodu. Zahteva kod za verifikaciju iz same metode. Ne može deaktivirati primarne metode - prvo postavite drugu metodu kao primarnu.
sw: Inazima njia ya MFA iliyo amilifu. Inahitaji msimbo wa uthibitishaji kutoka kwenye njia hiyo hiyo. Haiwezi kuzima njia za msingi - weka njia nyingine kama ya msingi kwanza.
tr: Etkin MFA yöntemini devre dışı bırakır. Yöntemin kendisinden doğrulama kodu gerektirir. Birincil yöntemler devre dışı bırakılamaz - önce başka bir yöntemi birincil olarak ayarlayın.
