Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.2-py3-none-any.whl/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: af, ar, bg, fa, fr, gl, he, hr, id, ms, pt, sk, sr, sw, tr

source: Set an active MFA method as the primary authentication method. Primary method is used by default during login flow.
af: Stel 'n aktiewe MFA-metode as die primêre verifikasie metode. Primêre metode word by verstek gebruik tydens inteken-vloei.
ar: تعيين طريقة MFA نشطة كطريقة المصادقة الأساسية. الطريقة الأساسية تستخدم افتراضياً أثناء تدفق تسجيل الدخول.
bg: Задава активен MFA метод като основен метод за удостоверяване. Основният метод се използва по подразбиране по време на процеса на влизане.
fa: تنظیم روش MFA فعال به عنوان روش احراز هویت اصلی. روش اصلی به طور پیش‌فرض در جریان ورود استفاده می‌شود.
fr: Définit une méthode MFA active comme méthode d'authentification principale. La méthode principale est utilisée par défaut pendant le flux de connexion.
gl: Establece un método MFA activo como método de autenticación primario. O método primario úsase por defecto durante o fluxo de inicio de sesión.
he: הגדרת שיטת אימות רב-שלבי פעילה כשיטת האימות הראשית. השיטה הראשית משמשת כברירת מחדל במהלך תהליך הכניסה.
hr: Postavi aktivnu MFA metodu kao primarnu autentifikacijsku metodu. Primarna metoda se koristi po defaultu tijekom tijeka prijave.
id: Menetapkan metode MFA yang aktif sebagai metode autentikasi utama. Metode utama digunakan secara default selama alur masuk.
ms: Tetapkan kaedah MFA aktif sebagai kaedah pengesahan utama. Kaedah utama digunakan secara lalai semasa aliran log masuk.
pt: Definir um método MFA ativo como método de autenticação primário. O método primário é usado por padrão durante o fluxo de login.
sk: Nastaví aktívnu MFA metódu ako primárnu autentifikačnú metódu. Primárna metóda sa používa predvolene počas prihlasovacieho toku.
sr: Postavlja aktivnu MFA metodu kao primarnu metodu autentifikacije. Primarna metoda se koristi po defaultu tokom toka prijavljivanja.
sw: Inaweka njia ya MFA iliyo amilifu kama njia ya msingi ya uthibitishaji. Njia ya msingi inatumiwa kwa uongozi wakati wa mtiririko wa kuingia.
tr: Etkin MFA yöntemini birincil kimlik doğrulama yöntemi olarak ayarlar. Birincil yöntem giriş akışı sırasında varsayılan olarak kullanılır.

source: Only one method can be primary at a time.
af: Slegs een metode kan op 'n tyd primêr wees.
ar: طريقة واحدة فقط يمكن أن تكون أساسية في وقت واحد.
bg: Само един метод може да бъде основен по едно време.
fa: فقط یک روش می‌تواند در یک زمان اصلی باشد.
fr: Seule une méthode peut être principale à la fois.
gl: Só un método pode ser primario á vez.
he: רק שיטה אחת יכולה להיות ראשית בכל זמן.
hr: Samo jedna metoda može biti primarna u isto vrijeme.
id: Hanya satu metode yang dapat menjadi utama pada satu waktu.
ms: Hanya satu kaedah boleh menjadi utama pada satu masa.
pt: Apenas um método pode ser primário por vez.
sk: Len jedna metóda môže byť primárna naraz.
sr: Samo jedna metoda može biti primarna u isto vreme.
sw: Njia moja tu inaweza kuwa ya msingi kwa wakati mmoja.
tr: Aynı anda sadece bir yöntem birincil olabilir.

source: Requires verification code from current primary method.
af: Vereis verifikasie kode van huidige primêre metode.
ar: يتطلب رمز التحقق من الطريقة الأساسية الحالية.
bg: Изисква код за потвърждение от текущия основен метод.
fa: کد تأیید از روش اصلی فعلی مورد نیاز است.
fr: Nécessite un code de vérification de la méthode principale actuelle.
gl: Require código de verificación do método primario actual.
he: דורש קוד אימות מהשיטה הראשית הנוכחית.
hr: Zahtijeva verifikacijski kod iz trenutne primarne metode.
id: Memerlukan kode verifikasi dari metode utama saat ini.
ms: Memerlukan kod pengesahan dari kaedah utama semasa.
pt: Requer código de verificação do método primário atual.
sk: Vyžaduje overovací kód z aktuálnej primárnej metódy.
sr: Zahteva kod za verifikaciju iz trenutne primarne metode.
sw: Inahitaji msimbo wa uthibitishaji kutoka kwenye njia ya msingi ya sasa.
tr: Mevcut birincil yöntemden doğrulama kodu gerektirir.

source: Send verification code for methods that support code dispatch. Useful for testing method configuration or manual code requests.
af: Stuur verifikasie kode vir metodes wat kode-versending ondersteun. Nuttig vir toets metode konfigurasie of handmatige kode-versoeke.
ar: إرسال رمز التحقق للطرق التي تدعم إرسال الرمز. مفيد لـ اختبار تكوين الطريقة أو طلبات الرمز اليدوية.
bg: Изпраща код за потвърждение за методи, които поддържат изпращане на код. Полезно за тестване на конфигурацията на метода или ръчни заявки за код.
fa: ارسال کد تأیید برای روش‌هایی که از ارسال کد پشتیبانی می‌کنند. برای آزمایش پیکربندی روش یا درخواست‌های دستی کد مفید است.
fr: Envoie un code de vérification pour les méthodes qui prennent en charge l'envoi de code. Utile pour tester la configuration de méthode ou les demandes de code manuelles.
gl: Envía código de verificación para métodos que admiten envío de código. Útil para probar a configuración do método ou solicitudes manuais de código.
he: שליחת קוד אימות לשיטות שתומכות בשליחת קוד. שימושי לבדיקת הגדרת השיטה או בקשות קוד ידניות.
hr: Pošalji verifikacijski kod za metode koje podržavaju slanje koda. Korisno za testiranje konfiguracije metode ili ručne zahtjeve za kod.
id: Mengirim kode verifikasi untuk metode yang mendukung pengiriman kode. Berguna untuk menguji konfigurasi metode atau permintaan kode manual.
ms: Hantar kod pengesahan untuk kaedah yang menyokong penghantaran kod. Berguna untuk menguji konfigurasi kaedah atau permintaan kod manual.
pt: Enviar código de verificação para métodos que suportam envio de código. Útil para testar configuração de método ou solicitações manuais de código.
sk: Pošle overovací kód pre metódy, ktoré podporujú odosielanie kódov. Užitočné na testovanie konfigurácie metódy alebo manuálne požiadavky na kód.
sr: Šalje kod za verifikaciju za metode koje podržavaju slanje kodova. Korisno za testiranje konfiguracije metode ili ručne zahteve za kodovima.
sw: Inatuma msimbo wa uthibitishaji kwa njia zinazosaidia utumaji wa msimbo. Ni ya manufaa kwa kupima mipangilio ya njia au maombi ya mwongozo ya msimbo.
tr: Kod gönderimini destekleyen yöntemler için doğrulama kodu gönderir. Yöntem yapılandırmasını test etmek veya manuel kod istekleri için yararlıdır.

source: Permanently delete an MFA method.
af: Skrap 'n MFA-metode permanent.
ar: حذف طريقة MFA نهائياً.
bg: Изтрива окончателно MFA метод.
fa: حذف دائمی روش MFA.
fr: Supprime définitivement une méthode MFA.
gl: Eliminar permanentemente un método MFA.
he: מחיקה לצמיתות של שיטת אימות רב-שלבי.
hr: Trajno obriši MFA metodu.
id: Menghapus metode MFA secara permanen.
ms: Padamkan kaedah MFA secara kekal.
pt: Excluir permanentemente um método MFA.
sk: Trvalo odstráni MFA metódu.
sr: Trajno briše MFA metodu.
sw: Inafuta kabisa njia ya MFA.
tr: MFA yöntemini kalıcı olarak siler.

source: This action cannot be undone.
af: Hierdie aksie kan nie ongedaan gemaak word nie.
ar: هذا الإجراء لا يمكن التراجع عنه.
bg: Това действие не може да бъде отменено.
fa: این عمل قابل بازگشت نیست.
fr: Cette action ne peut pas être annulée.
gl: Esta acción non se pode desfacer.
he: פעולה זו לא ניתנת לביטול.
hr: Ova radnja se ne može poništiti.
id: Tindakan ini tidak dapat dibatalkan.
ms: Tindakan ini tidak boleh dibatalkan.
pt: Esta ação não pode ser desfeita.
sk: Túto akciu nie je možné vrátiť späť.
sr: Ova akcija se ne može poništiti.
sw: Kitendo hiki hakiwezi kutendua.
tr: Bu eylem geri alınamaz.

source: Cannot delete active methods.
af: Kan nie aktiewe metodes skrap nie.
ar: لا يمكن حذف الطرق النشطة.
bg: Не могат да бъдат изтрити активни методи.
fa: نمی‌توان روش‌های فعال را حذف کرد.
fr: Impossible de supprimer les méthodes actives.
gl: Non se poden eliminar métodos activos.
he: לא ניתן למחוק שיטות פעילות.
hr: Ne može obrisati aktivne metode.
id: Tidak dapat menghapus metode yang aktif.
ms: Tidak boleh memadam kaedah aktif.
pt: Não é possível excluir métodos ativos.
sk: Nemožno odstrániť aktívne metódy.
sr: Ne može brisati aktivne metode.
sw: Haiwezi kufuta njia amilifu.
tr: Etkin yöntemler silinemez.

source: Cannot delete primary methods.
af: Kan nie primêre metodes skrap nie.
ar: لا يمكن حذف الطرق الأساسية.
bg: Не могат да бъдат изтрити основни методи.
fa: نمی‌توان روش‌های اصلی را حذف کرد.
fr: Impossible de supprimer les méthodes principales.
gl: Non se poden eliminar métodos primarios.
he: לא ניתן למחוק שיטות ראשיות.
hr: Ne može obrisati primarne metode.
id: Tidak dapat menghapus metode utama.
ms: Tidak boleh memadam kaedah utama.
pt: Não é possível excluir métodos primários.
sk: Nemožno odstrániť primárne metódy.
sr: Ne može brisati primarne metode.
sw: Haiwezi kufuta njia za msingi.
tr: Birincil yöntemler silinemez.

source: Requires verification code for active methods.
af: Vereis verifikasie kode vir aktiewe metodes.
ar: يتطلب رمز التحقق للطرق النشطة.
bg: Изисква код за потвърждение за активни методи.
fa: کد تأیید برای روش‌های فعال مورد نیاز است.
fr: Nécessite un code de vérification pour les méthodes actives.
gl: Require código de verificación para métodos activos.
he: דורש קוד אימות לשיטות פעילות.
hr: Zahtijeva verifikacijski kod za aktivne metode.
id: Memerlukan kode verifikasi untuk metode yang aktif.
ms: Memerlukan kod pengesahan untuk kaedah aktif.
pt: Requer código de verificação para métodos ativos.
sk: Vyžaduje overovací kód pre aktívne metódy.
sr: Zahteva kod za verifikaciju za aktivne metode.
sw: Inahitaji msimbo wa uthibitishaji kwa njia amilifu.
tr: Etkin yöntemler için doğrulama kodu gerektirir.

source: user
af: gebruiker
ar: مستخدم
bg: потребител
fa: کاربر
fr: utilisateur
gl: usuario
he: משתמש
hr: korisnik
id: pengguna
ms: pengguna
pt: usuário
sk: používateľ
sr: korisnik
sw: mtumiaji
tr: kullanıcı

source: User who owns this MFA method
af: Gebruiker wat hierdie MFA-metode besit
ar: المستخدم الذي يملك طريقة المصادقة متعددة العوامل هذه
bg: Потребител, който притежава този MFA метод
fa: کاربری که مالک این روش MFA است
fr: Utilisateur qui possède cette méthode MFA
gl: Usuario que posúe este método MFA
he: משתמש שמחזיק בשיטת אימות רב-שלבי זו
hr: Korisnik koji posjeduje ovu MFA metodu
id: Pengguna yang memiliki metode MFA ini
ms: Pengguna yang memiliki kaedah MFA ini
pt: Usuário que possui este método MFA
sk: Používateľ, ktorý vlastní túto MFA metódu
sr: Korisnik koji poseduje ovu MFA metodu
sw: Mtumiaji anayemiliki njia hii ya MFA
tr: Bu MFA yöntemine sahip kullanıcı

source: name
af: naam
ar: اسم
bg: име
fa: نام
fr: nom
gl: nome
he: שם
hr: ime
id: nama
ms: nama
pt: nome
sk: názov
sr: naziv
sw: jina
tr: ad

source: MFA method name (e.g., 'app', 'email')
af: MFA-metode naam (bv., 'app', 'e-pos')
ar: اسم طريقة المصادقة متعددة العوامل (مثل 'app', 'email')
bg: Име на MFA метод (напр. 'app', 'email')
fa: نام روش MFA (مثلاً 'app', 'email')
fr: Nom de la méthode MFA (par exemple, 'app', 'email')
gl: Nome do método MFA (por exemplo, 'app', 'email')
he: שם שיטת אימות רב-שלבי (למשל, 'app', 'email')
hr: Naziv MFA metode (npr. 'app', 'email')
id: Nama metode MFA (misalnya, 'app', 'email')
ms: Nama kaedah MFA (contoh: 'app', 'email')
pt: Nome do método MFA (ex: 'app', 'email')
sk: Názov MFA metódy (napr. 'app', 'email')
sr: Naziv MFA metode (npr. 'app', 'email')
sw: Jina la njia ya MFA (mfano, 'app', 'email')
tr: MFA yöntem adı (örn. 'app', 'email')

source: secret
af: geheim
ar: سر
bg: тайна
fa: رمز
gl: secreto
he: סוד
hr: tajna
id: rahasia
ms: rahsia
pt: segredo
sk: tajomstvo
sr: tajna
sw: siri
tr: gizli

source: TOTP secret key for generating verification codes
af: TOTP-geheim sleutel vir die generering van verifikasie kodes
ar: المفتاح السري لـ TOTP لإنشاء رموز التحقق
bg: Таен ключ TOTP за генериране на кодове за потвърждение
fa: کلید محرمانه TOTP برای تولید کدهای تأیید
fr: Clé secrète TOTP pour générer des codes de vérification
gl: Clave secreta TOTP para xerar códigos de verificación
he: מפתח סוד TOTP ליצירת קודי אימות
hr: TOTP tajni ključ za generiranje verifikacijskih kodova
id: Kunci rahasia TOTP untuk menghasilkan kode verifikasi
ms: Kunci rahsia TOTP untuk menjana kod pengesahan
pt: Chave secreta TOTP para gerar códigos de verificação
sk: TOTP tajný kľúč na generovanie overovacích kódov
sr: TOTP tajni ključ za generisanje kodova za verifikaciju
sw: Ufunguo wa siri wa TOTP kwa kuzalisha misimbo ya uthibitishaji
tr: Doğrulama kodları üretmek için TOTP gizli anahtar

source: is primary
af: is primêr
ar: أساسي
bg: е основен
fa: اصلی است
fr: est principal
gl: é primario
he: ראשית
hr: je primarno
id: adalah utama
ms: adalah utama
pt: é primário
sk: je primárny
sr: je primarna
sw: ni ya msingi
tr: birincil

source: Whether this is the user's primary MFA method
af: Of dit die gebruiker se primêre MFA-metode is
ar: ما إذا كانت هذه هي طريقة المصادقة متعددة العوامل الأساسية للمستخدم
bg: Дали това е основният MFA метод на потребителя
fa: آیا این روش MFA اصلی کاربر است
fr: Si c'est la méthode MFA principale de l'utilisateur
gl: Se este é o método MFA primario do usuario
he: האם זו שיטת האימות הרב-שלבי הראשית של המשתמש
hr: Je li ovo korisnikova primarna MFA metoda
id: Apakah ini adalah metode MFA utama pengguna
ms: Sama ada ini adalah kaedah MFA utama pengguna
pt: Se este é o método MFA principal do usuário
sk: Či je toto používateľova primárna MFA metóda
sr: Da li je ovo korisnikova primarna MFA metoda
sw: Iwapo hii ni njia ya msingi ya MFA ya mtumiaji
tr: Bunun kullanıcının birincil MFA yöntemi olup olmadığı

source: is active
af: is aktief
ar: نشط
bg: е активен
fa: فعال است
fr: est actif
gl: está activo
he: פעיל
hr: je aktivno
id: aktif
ms: adalah aktif
pt: está ativo
sk: je aktívny
sr: je aktivna
sw: ni amilifu
tr: etkin

source: Whether this method is active and can be used
af: Of hierdie metode aktief is en gebruik kan word
ar: ما إذا كانت هذه الطريقة نشطة ويمكن استخدامها
bg: Дали този метод е активен и може да се използва
fa: آیا این روش فعال است و قابل استفاده است
fr: Si cette méthode est active et peut être utilisée
gl: Se este método está activo e pode ser usado
he: האם השיטה הזו פעילה וניתן להשתמש בה
hr: Je li ova metoda aktivna i može li se koristiti
id: Apakah metode ini aktif dan dapat digunakan
ms: Sama ada kaedah ini aktif dan boleh digunakan
pt: Se este método está ativo e pode ser usado
sk: Či je táto metóda aktívna a môže sa používať
sr: Da li je ova metoda aktivna i može se koristiti
sw: Iwapo njia hii ni amilifu na inaweza kutumika
tr: Bu yöntemin etkin olup kullanılabilir olduğu

source: backup codes
af: rugsteun-kodes
ar: رموز احتياطية
bg: резервни кодове
fa: کدهای پشتیبان
fr: codes de secours
gl: códigos de respaldo
he: קודי גיבוי
hr: sigurnosni kodovi
id: kode cadangan
ms: kod sandaran
pt: códigos de backup
sk: záložné kódy
sr: rezervni kodovi
sw: misimbo ya kuhifadhi
tr: yedek kodlar

source: JSON field storing backup codes for account recovery
af: JSON-veld wat rugsteun-kodes stoor vir rekening herstel
ar: حقل JSON لتخزين الرموز الاحتياطية لاستعادة الحساب
bg: JSON поле, съхраняващо резервни кодове за възстановяване на акаунта
fa: فیلد JSON برای ذخیره کدهای پشتیبان برای بازیابی حساب
fr: Champ JSON stockant les codes de secours pour la récupération de compte
gl: Campo JSON que almacena códigos de respaldo para recuperación de conta
he: שדה JSON המאחסן קודי גיבוי לשחזור חשבון
hr: JSON polje koje čuva sigurnosne kodove za oporavak računa
id: Bidang JSON yang menyimpan kode cadangan untuk pemulihan akun
ms: Medan JSON yang menyimpan kod sandaran untuk pemulihan akaun
pt: Campo JSON que armazena códigos de backup para recuperação de conta
sk: JSON pole uchovávajúce záložné kódy na obnovenie účtu
sr: JSON polje koje čuva rezervne kodove za oporavak naloga
sw: Uga wa JSON unahifadhi misimbo ya kuhifadhi kwa kurejesha akaunti
tr: Hesap kurtarma için yedek kodları saklayan JSON alanı

source: MFA Method
af: MFA-metode
ar: طريقة المصادقة متعددة العوامل
bg: MFA метод
fa: روش MFA
fr: Méthode MFA
gl: Método MFA
he: שיטת אימות רב-שלבי
hr: MFA metoda
id: Metode MFA
ms: Kaedah MFA
pt: Método MFA
sk: MFA Metóda
sr: MFA Metoda
sw: Njia ya MFA
tr: MFA Yöntemi

source: MFA Methods
af: MFA-metodes
ar: طرق المصادقة متعددة العوامل
bg: MFA методи
fa: روش‌های MFA
fr: Méthodes MFA
gl: Métodos MFA
he: שיטות אימות רב-שלבי
hr: MFA metode
id: Metode MFA
ms: Kaedah MFA
pt: Métodos MFA
sk: MFA Metódy
sr: MFA Metode
sw: Njia za MFA
tr: MFA Yöntemleri

source: Invalid code
af: Ongeldige kode
ar: رمز غير صحيح
bg: Невалиден код
fa: کد نامعتبر
fr: Code invalide
gl: Código inválido
he: קוד לא תקין
hr: Nevažeći kod
id: Kode tidak valid
ms: Kod tidak sah
pt: Código inválido
sk: Neplatný kód
sr: Neispravan kod
sw: Msimbo si sahihi
tr: Geçersiz kod

source: Invalid token
af: Ongeldige token
ar: رمز غير صحيح
bg: Невалиден токен
fa: توکن نامعتبر
fr: Jeton invalide
gl: Token inválido
he: אסימון לא תקין
hr: Nevažeći token
id: Token tidak valid
ms: Token tidak sah
pt: Token inválido
sk: Neplatný token
sr: Neispravan token
sw: Alama si sahihi
tr: Geçersiz token

source: Please select a new method
af: Kies asseblief 'n nuwe metode
ar: يرجى اختيار طريقة جديدة
bg: Моля, изберете нов метод
fa: لطفاً روش جدیدی انتخاب کنید
fr: Veuillez sélectionner une nouvelle méthode
gl: Por favor selecciona un novo método
he: אנא בחר שיטה חדשה
hr: Molimo odaberite novu metodu
id: Silakan pilih metode baru
ms: Sila pilih kaedah baru
pt: Por favor, selecione um novo método
sk: Prosím, vyberte novú metódu
sr: Molimo izaberite novu metodu
sw: Tafadhali chagua njia mpya
tr: Lütfen yeni bir yöntem seçin

source: This method is already exists
af: Hierdie metode bestaan reeds
ar: هذه الطريقة موجودة بالفعل
bg: Този метод вече съществува
fa: این روش از قبل وجود دارد
fr: Cette méthode existe déjà
gl: Este método xa existe
he: השיטה הזו כבר קיימת
hr: Ova metoda već postoji
id: Metode ini sudah ada
ms: Kaedah ini sudah wujud
pt: Este método já existe
sk: Táto metóda už existuje
sr: Ova metoda već postoji
sw: Njia hii tayari ipo
tr: Bu yöntem zaten mevcut

source: Invalid OTP code
af: Ongeldige OTP-kode
ar: رمز OTP غير صحيح
bg: Невалиден OTP код
fa: کد OTP نامعتبر
fr: Code OTP invalide
gl: Código OTP inválido
he: קוד OTP לא תקין
hr: Nevažeći OTP kod
id: Kode OTP tidak valid
ms: Kod OTP tidak sah
pt: Código OTP inválido
sk: Neplatný OTP kód
sr: Neispravan OTP kod
sw: Msimbo wa OTP si sahihi
tr: Geçersiz OTP kodu

source: Activated MFA method
af: Geaktiveerde MFA-metode
ar: تم تفعيل طريقة المصادقة متعددة العوامل
bg: Активиран MFA метод
fa: روش MFA فعال شد
fr: Méthode MFA activée
gl: Método MFA activado
he: שיטת אימות רב-שלבי הופעלה
hr: Aktivirana MFA metoda
id: Metode MFA diaktifkan
ms: Kaedah MFA diaktifkan
pt: Método MFA ativado
sk: Aktivovaná MFA metóda
sr: Aktivirana MFA metoda
sw: Njia ya MFA imeamilishwa
tr: MFA yöntemi etkinleştirildi

source: You can only deactivate non-primary MFA method.
af: Jy kan slegs nie-primêre MFA-metode deaktiveer.
ar: يمكنك فقط إلغاء تفعيل طرق المصادقة متعددة العوامل غير الأساسية.
bg: Можете да деактивирате само неосновни MFA методи.
fa: فقط می‌توانید روش MFA غیراصلی را غیرفعال کنید.
fr: Vous ne pouvez désactiver que les méthodes MFA non-principales.
gl: Só podes desactivar un método MFA non primario.
he: ניתן לבטל רק שיטת אימות רב-שלבי שאינה ראשית.
hr: Možete deaktivirati samo ne-primarnu MFA metodu.
id: Anda hanya dapat menonaktifkan metode MFA non-utama.
ms: Anda hanya boleh nyahaktifkan kaedah MFA bukan utama.
pt: Você só pode desativar métodos MFA não primários.
sk: Môžete deaktivovať len neprimárnu MFA metódu.
sr: Možete deaktivirati samo ne-primarnu MFA metodu.
sw: Unaweza kuzima tu njia ya MFA ambayo si ya msingi.
tr: Sadece birincil olmayan MFA yöntemini devre dışı bırakabilirsiniz.

source: Deactivated MFA method
af: Gedeaktiveerde MFA-metode
ar: تم إلغاء تفعيل طريقة المصادقة متعددة العوامل
bg: Деактивиран MFA метод
fa: روش MFA غیرفعال شد
fr: Méthode MFA désactivée
gl: Método MFA desactivado
he: שיטת אימות רב-שלבי בוטלה
hr: Deaktivirana MFA metoda
id: Metode MFA dinonaktifkan
ms: Kaedah MFA dinyahaktifkan
pt: Método MFA desativado
sk: Deaktivovaná MFA metóda
sr: Deaktivirana MFA metoda
sw: Njia ya MFA imezimwa
tr: MFA yöntemi devre dışı bırakıldı

source: Invalid primary method code
af: Ongeldige primêre metode kode
ar: رمز الطريقة الأساسية غير صحيح
bg: Невалиден код за основен метод
fa: کد روش اصلی نامعتبر
fr: Code de méthode principale invalide
gl: Código do método primario inválido
he: קוד שיטה ראשית לא תקין
hr: Nevažeći kod primarne metode
id: Kode metode utama tidak valid
ms: Kod kaedah utama tidak sah
pt: Código do método primário inválido
sk: Neplatný kód primárnej metódy
sr: Neispravan kod primarne metode
sw: Msimbo wa njia ya msingi si sahihi
tr: Geçersiz birincil yöntem kodu

source: Updated primary MFA method
af: Bygewerkte primêre MFA-metode
ar: تم تحديث طريقة المصادقة متعددة العوامل الأساسية
bg: Актуализиран основен MFA метод
fa: روش MFA اصلی به‌روزرسانی شد
fr: Méthode MFA principale mise à jour
gl: Método MFA primario actualizado
he: שיטת אימות רב-שלבי ראשית עודכנה
hr: Ažurirana primarna MFA metoda
id: Metode MFA utama diperbarui
ms: Kaedah MFA utama dikemas kini
pt: Método MFA primário atualizado
sk: Aktualizovaná primárna MFA metóda
sr: Ažurirana primarna MFA metoda
sw: Njia ya MFA ya msingi imesasishwa
tr: Birincil MFA yöntemi güncellendi

source: Cannot delete active MFA method
af: Kan nie aktiewe MFA-metode skrap nie
ar: لا يمكن حذف طريقة المصادقة متعددة العوامل النشطة
bg: Не може да се изтрие активен MFA метод
fa: نمی‌توان روش MFA فعال را حذف کرد
fr: Impossible de supprimer la méthode MFA active
gl: Non se pode eliminar un método MFA activo
he: לא ניתן למחוק שיטת אימות רב-שלבי פעילה
hr: Ne može obrisati aktivnu MFA metodu
id: Tidak dapat menghapus metode MFA yang aktif
ms: Tidak boleh memadam kaedah MFA aktif
pt: Não é possível excluir método MFA ativo
sk: Nemožno odstrániť aktívnu MFA metódu
sr: Ne može brisati aktivnu MFA metodu
sw: Haiwezi kufuta njia ya MFA iliyo amilifu
tr: Etkin MFA yöntemi silinemez

source: Cannot delete primary MFA method
af: Kan nie primêre MFA-metode skrap nie
ar: لا يمكن حذف طريقة المصادقة متعددة العوامل الأساسية
bg: Не може да се изтрие основен MFA метод
fa: نمی‌توان روش MFA اصلی را حذف کرد
fr: Impossible de supprimer la méthode MFA principale
gl: Non se pode eliminar un método MFA primario
he: לא ניתן למחוק שיטת אימות רב-שלבי ראשית
hr: Ne može obrisati primarnu MFA metodu
id: Tidak dapat menghapus metode MFA utama
ms: Tidak boleh memadam kaedah MFA utama
pt: Não é possível excluir método MFA primário
sk: Nemožno odstrániť primárnu MFA metódu
sr: Ne može brisati primarnu MFA metodu
sw: Haiwezi kufuta njia ya MFA ya msingi
tr: Birincil MFA yöntemi silinemez

source: Method does not exist
af: Metode bestaan nie
ar: الطريقة غير موجودة
bg: Методът не съществува
fa: روش وجود ندارد
fr: La méthode n'existe pas
gl: O método non existe
he: השיטה אינה קיימת
hr: Metoda ne postoji
id: Metode tidak ada
ms: Kaedah tidak wujud
pt: O método não existe
sk: Metóda neexistuje
sr: Metoda ne postoji
sw: Njia haipo
tr: Yöntem mevcut değil

source: Deleted MFA method
af: Geskrapte MFA-metode
ar: تم حذف طريقة المصادقة متعددة العوامل
bg: Изтрит MFA метод
fa: روش MFA حذف شد
fr: Méthode MFA supprimée
gl: Método MFA eliminado
he: שיטת אימות רב-שלבי נמחקה
hr: Obrisana MFA metoda
id: Metode MFA dihapus
ms: Kaedah MFA dipadamkan
pt: Método MFA excluído
sk: Odstránená MFA metóda
sr: Obrisana MFA metoda
sw: Njia ya MFA imefutwa
tr: MFA yöntemi silindi

source: MFA code sent
af: MFA-kode gestuur
ar: تم إرسال رمز المصادقة متعددة العوامل
bg: MFA код изпратен
fa: کد MFA ارسال شد
fr: Code MFA envoyé
gl: Código MFA enviado
he: קוד אימות רב-שלבי נשלח
hr: MFA kod poslan
id: Kode MFA dikirim
ms: Kod MFA dihantar
pt: Código MFA enviado
sk: MFA kód odoslaný
sr: MFA kod poslat
sw: Msimbo wa MFA umetumwa
tr: MFA kodu gönderildi
