Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.2-py3-none-any.whl/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: af, ar, bg, fa, fr, gl, he, hr, id, ms, pt, sk, sr, sw, tr

source: Will override cookie.
af: Sal koekie oorskryf.
ar: سيقوم باستبدال ملف تعريف الارتباط.
bg: Ще презапише бисквитката.
fa: کوکی را جایگزین خواهد کرد.
fr: Remplacera le cookie.
gl: Sobreescribirá a cookie.
he: יעקוף את העוגיה.
hr: Prepiše kolačić.
id: Akan menimpa cookie.
ms: Akan menggantikan cookie.
pt: Substituirá o cookie.
sk: Prepíše súbor cookie.
sr: Prepisaće kolačić.
sw: Itasahihisha kidakuzi.
tr: Çerez geçersiz kılınacak.

source: No valid refresh token found.
af: Geen geldige verfris token gevind nie.
ar: لم يتم العثور على رمز تحديث صالح.
bg: Не е намерен валиден токен за обновяване.
fa: هیچ توکن تازه‌سازی معتبر یافت نشد.
fr: Aucun jeton de renouvellement valide trouvé.
gl: Non se atopou un token de actualización válido.
he: לא נמצא אסימון רענון תקין.
hr: Nije pronađen valjani refresh token.
id: Tidak ditemukan token refresh yang valid.
ms: Tiada token penyegaran yang sah ditemui.
pt: Nenhum token de atualização válido encontrado.
sk: Nenašiel sa žiadny platný obnovovací token.
sr: Nije pronađen važeći refresh token.
sw: Hakuna alama halali ya ubugarizi imepatikana.
tr: Geçerli yenileme tokeni bulunamadı.

source: E-mail is not verified.
af: E-pos is nie geverifieer nie.
ar: البريد الإلكتروني غير متحقق.
bg: Имейлът не е потвърден.
fa: ایمیل تأیید نشده است.
fr: L'email n'est pas vérifié.
gl: O correo electrónico non está verificado.
he: הדוא״ל אינו מאומת.
hr: E-mail nije potvrđen.
id: E-mail belum diverifikasi.
ms: E-mel tidak disahkan.
pt: O email não está verificado.
sk: E-mail nie je overený.
sr: Email nije verifikovan.
sw: Barua pepe haijathibitishwa.
tr: E-posta doğrulanmadı.

source: Unable to log in with provided credentials.
af: Kan nie inteken met verskafde geloofsbriewe nie.
ar: غير قادر على تسجيل الدخول باستخدام اعتمادات الهوية المقدمة.
bg: Невъзможно влизане с предоставените данни за удостоверяване.
fa: امکان ورود با اعتبارنامه‌های ارائه شده وجود ندارد.
fr: Impossible de se connecter avec les identifiants fournis.
gl: Non se pode iniciar sesión coas credenciais proporcionadas.
he: לא ניתן להתחבר עם האישורים שסופקו.
hr: Nije moguće prijaviti se s danim podacima.
id: Tidak dapat masuk dengan kredensial yang diberikan.
ms: Tidak dapat log masuk dengan kelayakan yang disediakan.
pt: Não foi possível fazer login com as credenciais fornecidas.
sk: Nie je možné sa prihlásiť s poskytnutými povereniami.
sr: Nije moguće prijaviti se sa dostavljenim pristupnim podacima.
sw: Haiwezi kuingia kwa hati za utambulisho zilizotolewa.
tr: Sağlanan kimlik bilgileri ile giriş yapılamadı.

source: Invalid value
af: Ongeldige waarde
ar: قيمة غير صحيحة
bg: Невалидна стойност
fa: مقدار نامعتبر
fr: Valeur invalide
gl: Valor inválido
he: ערך לא תקין
hr: Nevažeća vrijednost
id: Nilai tidak valid
ms: Nilai tidak sah
pt: Valor inválido
sk: Neplatná hodnota
sr: Neispravna vrednost
sw: Thamani si sahihi
tr: Geçersiz değer

source: Your old password was entered incorrectly. Please enter it again.
af: Jou ou wagwoord is verkeerd ingevoer. Voer dit asseblief weer in.
ar: تم إدخال كلمة المرور القديمة بشكل غير صحيح. يرجى إدخالها مرة أخرى.
bg: Старата ви парола е въведена неправилно. Моля, въведете я отново.
fa: کلمه عبور قدیمی شما اشتباه وارد شده است. لطفاً دوباره وارد کنید.
fr: Votre ancien mot de passe a été saisi incorrectement. Veuillez le saisir à nouveau.
gl: O teu contrasinal anterior foi introducido incorrectamente. Por favor, introdúceo de novo.
he: הסיסמה הישנה שלך הוזנה בצורה שגויה. אנא הזן אותה שוב.
hr: Vaša stara lozinka je unašena netočno. Molimo unesite je ponovno.
id: Kata sandi lama Anda salah. Silakan masukkan kembali.
ms: Kata laluan lama anda dimasukkan dengan salah. Sila masukkannya semula.
pt: Sua senha antiga foi inserida incorretamente. Por favor, insira-a novamente.
sk: Vaše staré heslo bolo zadané nesprávne. Prosím, zadajte ho znovu.
sr: Vaša stara lozinka je uneta neispravno. Molimo unesite je ponovo.
sw: Nenosiri lako la zamani liliingizwa kwa makosa. Tafadhali liingie tena.
tr: Eski şifreniz yanlış girildi. Lütfen tekrar girin.

source: A user is already registered with this e-mail address.
af: 'n Gebruiker is reeds geregistreer met hierdie e-posadres.
ar: مستخدم مسجل بالفعل بهذا عنوان البريد الإلكتروني.
bg: Потребител вече е регистриран с този имейл адрес.
fa: کاربری با این آدرس ایمیل قبلاً ثبت نام کرده است.
fr: Un utilisateur est déjà enregistré avec cette adresse email.
gl: Xa hai un usuario rexistrado con este enderezo de correo electrónico.
he: משתמש כבר רשום עם כתובת דוא״ל זו.
hr: Korisnik je već registriran s ovom e-mail adresom.
id: Pengguna sudah terdaftar dengan alamat e-mail ini.
ms: Pengguna telah didaftarkan dengan alamat e-mel ini.
pt: Um usuário já está registrado com este endereço de email.
sk: Používateľ s touto e-mailovou adresou je už registrovaný.
sr: Korisnik sa ovom email adresom je već registrovan.
sw: Mtumiaji tayari amesajiliwa kwa anwani hii ya barua pepe.
tr: Bu e-posta adresi ile zaten kayıtlı bir kullanıcı var.

source: The two password fields didn't match.
af: Die twee wagwoord velde stem nie ooreen nie.
ar: حقلا كلمة المرور غير متطابقين.
bg: Двете полета за парола не съвпадат.
fa: دو فیلد کلمه عبور مطابقت نداشتند.
fr: Les deux champs de mot de passe ne correspondent pas.
gl: Os dous campos de contrasinal non coinciden.
he: שני שדות הסיסמה לא תואמים.
hr: Dva polja lozinke se ne slažu.
id: Kedua bidang kata sandi tidak cocok.
ms: Kedua-dua medan kata laluan tidak sepadan.
pt: Os dois campos de senha não corresponderam.
sk: Dve polia hesla sa nezhodujú.
sr: Dva polja za lozinku se ne poklapaju.
sw: Uwanda mbili wa nenosiri hazikuwa sawa.
tr: İki şifre alanı eşleşmedi.

source: Social account email must match your current account email.
af: Sosiale rekening e-pos moet ooreenstem met jou huidige rekening e-pos.
ar: يجب أن يتطابق بريد الحساب الاجتماعي مع بريد حسابك الحالي.
bg: Имейлът на социалния акаунт трябва да съвпада с имейла на текущия ви акаунт.
fa: ایمیل حساب اجتماعی باید با ایمیل حساب فعلی شما مطابقت داشته باشد.
fr: L'email du compte social doit correspondre à l'email de votre compte actuel.
gl: O correo electrónico da conta social debe coincidir co correo electrónico da túa conta actual.
he: דוא״ל החשבון החברתי חייב להתאים לדוא״ל החשבון הנוכחי שלך.
hr: E-mail društvenog računa mora odgovarati e-mailu vašeg trenutnog računa.
id: Email akun sosial harus sama dengan email akun Anda saat ini.
ms: E-mel akaun sosial mesti sepadan dengan e-mel akaun semasa anda.
pt: O email da conta social deve corresponder ao email da sua conta atual.
sk: E-mail sociálneho účtu sa musí zhodovať s e-mailom vášho aktuálneho účtu.
sr: Email društvenog naloga mora se poklapati sa email-om vašeg trenutnog naloga.
sw: Barua pepe ya akaunti ya kijamii lazima ilingane na barua pepe ya akaunti yako ya sasa.
tr: Sosyal hesap e-postası mevcut hesap e-postanız ile eşleşmelidir.

source: Connected
af: Verbind
ar: متصل
bg: Свързан
fa: متصل شد
fr: Connecté
gl: Conectado
he: מחובר
hr: Povezano
id: Terhubung
ms: Disambungkan
pt: Conectado
sk: Pripojené
sr: Povezano
sw: Imeunganishwa
tr: Bağlandı

source: Failed to complete OAuth flow
af: Kon nie OAuth-vloei voltooi nie
ar: فشل في إكمال تدفق OAuth
bg: Неуспешно завършване на OAuth процеса
fa: تکمیل جریان OAuth ناموفق بود
fr: Échec de la completion du flux OAuth
gl: Fallo ao completar o fluxo OAuth
he: נכשל בהשלמת תהליך OAuth
hr: Neuspješno završavanje OAuth tijeka
id: Gagal menyelesaikan alur OAuth
ms: Gagal melengkapkan aliran OAuth
pt: Falha ao completar o fluxo OAuth
sk: Nepodarilo sa dokončiť OAuth tok
sr: Neuspešno završavanje OAuth toka
sw: Imeshindwa kumalizia mtiririko wa OAuth
tr: OAuth akışı tamamlanamadı

source: User is already registered with this e-mail address.
af: Gebruiker is reeds geregistreer met hierdie e-posadres.
ar: المستخدم مسجل بالفعل بهذا عنوان البريد الإلكتروني.
bg: Потребител вече е регистриран с този имейл адрес.
fa: کاربر با این آدرس ایمیل قبلاً ثبت نام کرده است.
fr: L'utilisateur est déjà enregistré avec cette adresse email.
gl: O usuario xa está rexistrado con este enderezo de correo electrónico.
he: משתמש כבר רשום עם כתובת דוא״ל זו.
hr: Korisnik je već registriran s ovom e-mail adresom.
id: Pengguna sudah terdaftar dengan alamat e-mail ini.
ms: Pengguna telah didaftarkan dengan alamat e-mel ini.
pt: O usuário já está registrado com este endereço de email.
sk: Používateľ s touto e-mailovou adresou je už registrovaný.
sr: Korisnik sa ovom email adresom je već registrovan.
sw: Mtumiaji tayari amesajiliwa kwa anwani hii ya barua pepe.
tr: Kullanıcı bu e-posta adresi ile zaten kayıtlı.

source: Failed to exchange code for access token
af: Kon nie kode vir toegangstoken uitruil nie
ar: فشل في استبدال الرمز برمز الوصول
bg: Неуспешна размяна на код за токен за достъп
fa: تبدیل کد به توکن دسترسی ناموفق بود
fr: Échec de l'échange du code pour le jeton d'accès
gl: Fallo ao intercambiar código por token de acceso
he: נכשל בהחלפת קוד לאסימון גישה
hr: Neuspješna razmjena koda za pristupni token
id: Gagal menukar kode untuk token akses
ms: Gagal menukar kod untuk token akses
pt: Falha ao trocar código por token de acesso
sk: Nepodarilo sa vymeniť kód za prístupový token
sr: Neuspešna razmena koda za pristupni token
sw: Imeshindwa kubadilishana msimbo kwa alama ya ufikiaji
tr: Kod erişim tokeni ile değiştirilemedi

source: Authenticate with {} using OAuth2/OpenID Connect authorization code to obtain access tokens.
af: Verifieer met {} deur OAuth2/OpenID Connect magtigingskode te gebruik om toegangstokens te verkry.
ar: قم بالمصادقة مع {} باستخدام رمز التفويض OAuth2/OpenID Connect للحصول على رموز الوصول.
bg: Удостоверяване с {}, използвайки OAuth2/OpenID Connect код за оторизация за получаване на токени за достъп.
fa: احراز هویت با {} با استفاده از کد مجوز OAuth2/OpenID Connect برای دریافت توکن‌های دسترسی.
fr: Authentifiez-vous avec {} en utilisant le code d'autorisation OAuth2/OpenID Connect pour obtenir des jetons d'accès.
gl: Autentica con {} usando código de autorización OAuth2/OpenID Connect para obter tokens de acceso.
he: אימות עם {} באמצעות קוד הרשאה OAuth2/OpenID Connect כדי לקבל אסימוני גישה.
hr: Autentificiraj se s {} koristeći OAuth2/OpenID Connect autorizacijski kod kako bi dobio pristupne tokene.
id: Melakukan autentikasi dengan {} menggunakan kode otorisasi OAuth2/OpenID Connect untuk mendapatkan token akses.
ms: Mengesahkan dengan {} menggunakan kod kebenaran OAuth2/OpenID Connect untuk mendapatkan token akses.
pt: Autentique-se com {} usando código de autorização OAuth2/OpenID Connect para obter tokens de acesso.
sk: Autentifikujte sa pomocou {} pomocou autorizačného kódu OAuth2/OpenID Connect na získanie prístupových tokenov.
sr: Autentifikacija sa {} koristeći autorizacioni kod OAuth2/OpenID Connect za dobijanje pristupnih tokena.
sw: Thibitisha kwa {} kwa kutumia msimbo wa idhini wa OAuth2/OpenID Connect ili kupata alama za ufikiaji.
tr: Erişim tokenları elde etmek için OAuth2/OpenID Connect yetkilendirme kodunu kullanarak {} ile kimlik doğrulaması yapar.

source: Connect a {} account to the current user's account. This allows the user to login using their existing {} account in the future.
af: Verbind 'n {}-rekening aan die huidige gebruiker se rekening. Dit laat die gebruiker toe om in die toekoms met hul bestaande {}-rekening in te teken.
ar: ربط حساب {} بحساب المستخدم الحالي. هذا يسمح للمستخدم بتسجيل الدخول باستخدام حساب {} الموجود في المستقبل.
bg: Свързва {} акаунт към акаунта на текущия потребител. Това позволява на потребителя да влиза, използвайки съществуващия си {} акаунт в бъдеще.
fa: اتصال حساب {} به حساب کاربر فعلی. این امکان ورود کاربر با استفاده از حساب {} موجود در آینده را فراهم می‌کند.
fr: Connecte un compte {} au compte de l'utilisateur actuel. Cela permet à l'utilisateur de se connecter en utilisant son compte {} existant à l'avenir.
gl: Conecta unha conta {} á conta do usuario actual. Isto permite ao usuario iniciar sesión usando a súa conta {} existente no futuro.
he: חיבור חשבון {} לחשבון המשתמש הנוכחי. זה מאפשר למשתמש להתחבר באמצעות חשבון {} הקיים שלו בעתיד.
hr: Poveži {} račun s trenutnim korisničkim računom. Ovo omogućuje korisniku da se prijavi koristeći postojeći {} račun u budućnosti.
id: Menghubungkan akun {} ke akun pengguna saat ini. Ini memungkinkan pengguna untuk masuk menggunakan akun {} yang sudah ada di masa depan.
ms: Sambungkan akaun {} ke akaun pengguna semasa. Ini membolehkan pengguna log masuk menggunakan akaun {} sedia ada mereka pada masa akan datang.
pt: Conectar uma conta {} à conta do usuário atual. Isso permite ao usuário fazer login usando sua conta {} existente no futuro.
sk: Pripojí {} účet k účtu aktuálneho používateľa. Toto umožní používateľovi prihlásiť sa pomocou existujúceho {} účtu v budúcnosti.
sr: Povezuje {} nalog sa nalogom trenutnog korisnika. Ovo omogućava korisniku da se ubuduće prijavljuje koristeći postojeji {} nalog.
sw: Unganisha akaunti ya {} na akaunti ya mtumiaji wa sasa. Hii inaruhusu mtumiaji kuingia kwa kutumia akaunti yao ya {} iliyopo katika siku zijazo.
tr: {} hesabını mevcut kullanıcının hesabına bağlar. Bu, kullanıcının gelecekte mevcut {} hesabını kullanarak giriş yapmasına olanak tanır.

source: Requires authentication and a valid OAuth2/OpenID Connect authorization code from {}.
af: Vereis verifikasie en 'n geldige OAuth2/OpenID Connect magtigingskode van {}.
ar: يتطلب المصادقة ورمز تفويض OAuth2/OpenID Connect صالح من {}.
bg: Изисква удостоверяване и валиден OAuth2/OpenID Connect код за оторизация от {}.
fa: احراز هویت و کد مجوز OAuth2/OpenID Connect معتبر از {} مورد نیاز است.
fr: Nécessite une authentification et un code d'autorisation OAuth2/OpenID Connect valide de {}.
gl: Require autenticación e un código de autorización OAuth2/OpenID Connect válido de {}.
he: דורש אימות וקוד הרשאה OAuth2/OpenID Connect תקין מ-{}.
hr: Zahtijeva autentifikaciju i valjani OAuth2/OpenID Connect autorizacijski kod od {}.
id: Memerlukan autentikasi dan kode otorisasi OAuth2/OpenID Connect yang valid dari {}.
ms: Memerlukan pengesahan dan kod kebenaran OAuth2/OpenID Connect yang sah dari {}.
pt: Requer autenticação e um código de autorização OAuth2/OpenID Connect válido de {}.
sk: Vyžaduje autentifikáciu a platný autorizačný kód OAuth2/OpenID Connect od {}.
sr: Zahteva autentifikaciju i važeći autorizacioni kod OAuth2/OpenID Connect od {}.
sw: Inahitaji uthibitishaji na msimbo halali wa idhini wa OAuth2/OpenID Connect kutoka {}.
tr: Kimlik doğrulaması ve {}'den geçerli OAuth2/OpenID Connect yetkilendirme kodu gerektirir.

source: On success, the {} account is linked and can be used for future logins.
af: Met sukses word die {}-rekening gekoppel en kan vir toekomstige intekeninge gebruik word.
ar: عند النجاح، يتم ربط حساب {} ويمكن استخدامه لتسجيل الدخول في المستقبل.
bg: При успех {} акаунтът се свързва и може да се използва за бъдещи влизания.
fa: در صورت موفقیت، حساب {} پیوند داده می‌شود و می‌تواند برای ورود‌های آینده استفاده شود.
fr: En cas de succès, le compte {} est lié et peut être utilisé pour les connexions futures.
gl: En caso de éxito, a conta {} está vinculada e pode usarse para futuros inicios de sesión.
he: בהצלחה, חשבון {} מקושר וניתן להשתמש בו להתחברויות עתידיות.
hr: Uspješno, {} račun je povezan i može se koristiti za buduće prijave.
id: Jika berhasil, akun {} terhubung dan dapat digunakan untuk masuk di masa depan.
ms: Apabila berjaya, akaun {} dipautkan dan boleh digunakan untuk log masuk pada masa akan datang.
pt: Em caso de sucesso, a conta {} é vinculada e pode ser usada para logins futuros.
sk: Pri úspechu je {} účet prepojený a môže sa použiť pre budúce prihlásenia.
sr: Kod uspeha, {} nalog je povezan i može se koristiti za buduće prijavljivanja.
sw: Ikiwa imefanikiwa, akaunti ya {} itaunganishwa na inaweza kutumiwa kwa kuingia katika siku zijazo.
tr: Başarı durumunda, {} hesabı bağlanır ve gelecekteki girişler için kullanılabilir.

source: List all social accounts connected to the current user. Shows account details including provider, UID, and connection dates.
af: Lys alle sosiale rekeninge wat aan die huidige gebruiker gekoppel is. Wys rekening besonderhede insluitend verskaffer, UID, en verbindingsdatums.
ar: قائمة بجميع الحسابات الاجتماعية المتصلة بالمستخدم الحالي. يظهر تفاصيل الحساب بما في ذلك المزود، معرف المستخدم، وتواريخ الاتصال.
bg: Изброява всички социални акаунти, свързани с текущия потребител. Показва подробности за акаунта, включително доставчик, UID и дати на свързване.
fa: فهرست تمام حساب‌های اجتماعی متصل به کاربر فعلی. جزئیات حساب شامل ارائه‌دهنده، شناسه منحصر به فرد و تاریخ اتصال را نشان می‌دهد.
fr: Liste tous les comptes sociaux connectés à l'utilisateur actuel. Affiche les détails du compte incluant le fournisseur, l'UID et les dates de connexion.
gl: Lista todas as contas sociais conectadas ao usuario actual. Mostra os detalles da conta incluíndo provedor, UID e datas de conexión.
he: רשימת כל החשבונות החברתיים המחוברים למשתמש הנוכחי. מציגה פרטי החשבון כולל ספק, UID ותאריכי חיבור.
hr: Ispiši sve društvene račune povezane s trenutnim korisnikom. Prikazuje detalje računa uključujući pružatelja, UID i datume povezivanja.
id: Daftar semua akun sosial yang terhubung ke pengguna saat ini. Menampilkan detail akun termasuk penyedia, UID, dan tanggal koneksi.
ms: Senaraikan semua akaun sosial yang disambungkan kepada pengguna semasa. Menunjukkan butiran akaun termasuk penyedia, UID, dan tarikh sambungan.
pt: Listar todas as contas sociais conectadas ao usuário atual. Mostra detalhes da conta incluindo provedor, UID e datas de conexão.
sk: Zoznam všetkých sociálnych účtov pripojených k aktuálnemu používateľovi. Zobrazuje detaily účtu vrátane poskytovateľa, UID a dátumov pripojenia.
sr: Lista svih društvenih naloga povezanih sa trenutnim korisnikom. Prikazuje detalje naloga uključujući pružaoca, UID i datume povezivanja.
sw: Inaorodhesha akaunti zote za kijamii zilizounganishwa na mtumiaji wa sasa. Inaonyesha maelezo ya akaunti ikijumuisha mtoa huduma, UID, na tarehe za muunganisho.
tr: Mevcut kullanıcıya bağlı tüm sosyal hesapları listeler. Sağlayıcı, UID ve bağlantı tarihleri dahil hesap detaylarını gösterir.

source: Disconnect a social account from the current user. Removes the social account connection and prevents future logins via that provider. Requires authentication and the account must belong to the current user.
af: Ontkoppel 'n sosiale rekening van die huidige gebruiker. Verwyder die sosiale rekening verbinding en voorkom toekomstige intekeninge via daardie verskaffer. Vereis verifikasie en die rekening moet aan die huidige gebruiker behoort.
ar: قطع اتصال حساب اجتماعي من المستخدم الحالي. يزيل اتصال الحساب الاجتماعي ويمنع تسجيل الدخول في المستقبل عبر هذا المزود. يتطلب المصادقة ويجب أن يكون الحساب ملكاً للمستخدم الحالي.
bg: Откачва социален акаунт от текущия потребител. Премахва връзката със социалния акаунт и предотвратява бъдещи влизания чрез този доставчик. Изисква удостоверяване и акаунтът трябва да принадлежи на текущия потребител.
fa: قطع اتصال حساب اجتماعی از کاربر فعلی. اتصال حساب اجتماعی را حذف می‌کند و از ورود‌های آینده از طریق آن ارائه‌دهنده جلوگیری می‌کند. احراز هویت مورد نیاز است و حساب باید متعلق به کاربر فعلی باشد.
fr: Déconnecte un compte social de l'utilisateur actuel. Supprime la connexion du compte social et empêche les connexions futures via ce fournisseur. Nécessite une authentification et le compte doit appartenir à l'utilisateur actuel.
gl: Desconecta unha conta social do usuario actual. Elimina a conexión da conta social e evita futuros inicios de sesión a través dese provedor. Require autenticación e a conta debe pertencer ao usuario actual.
he: ניתוק חשבון חברתי מהמשתמש הנוכחי. מסיר את חיבור החשבון החברתי ומונע התחברויות עתידיות דרך אותו ספק. דורש אימות והחשבון חייב להשתייך למשתמש הנוכחי.
hr: Prekini vezu društvenog računa s trenutnim korisnikom. Uklanja vezu društvenog računa i sprečava buduće prijave preko tog pružatelja. Zahtijeva autentifikaciju i račun mora pripadati trenutnom korisniku.
id: Memutuskan akun sosial dari pengguna saat ini. Menghapus koneksi akun sosial dan mencegah masuk di masa depan melalui penyedia tersebut. Memerlukan autentikasi dan akun harus milik pengguna saat ini.
ms: Putuskan sambungan akaun sosial dari pengguna semasa. Menghapuskan sambungan akaun sosial dan mencegah log masuk masa depan melalui penyedia tersebut. Memerlukan pengesahan dan akaun mesti milik pengguna semasa.
pt: Desconectar uma conta social do usuário atual. Remove a conexão da conta social e impede logins futuros por meio desse provedor. Requer autenticação e a conta deve pertencer ao usuário atual.
sk: Odpojí sociálny účet od aktuálneho používateľa. Odstráni spojenie sociálneho účtu a zabraňuje budúcim prihlásením cez tohto poskytovateľa. Vyžaduje autentifikáciu a účet musí patriť aktuálnemu používateľovi.
sr: Prekida vezu društvenog naloga sa trenutnim korisnikom. Uklanja konekciju društvenog naloga i sprečava buduća prijavljivanja kroz tog pružaoca. Zahteva autentifikaciju i nalog mora pripadati trenutnom korisniku.
sw: Inakatisha muunganisho wa akaunti ya kijamii kutoka kwa mtumiaji wa sasa. Inaondoa muunganisho wa akaunti ya kijamii na kuzuia kuingia kwa siku zijazo kupitia mtoa huduma huyo. Inahitaji uthibitishaji na akaunti lazima iwe ya mtumiaji wa sasa.
tr: Sosyal hesabı mevcut kullanıcıdan ayırır. Sosyal hesap bağlantısını kaldırır ve bu sağlayıcı üzerinden gelecekteki girişleri engeller. Kimlik doğrulaması gerektirir ve hesap mevcut kullanıcıya ait olmalıdır.

source: adapter_class is not defined
af: adapter_class is nie gedefinieer nie
ar: adapter_class غير معرف
bg: adapter_class не е дефиниран
fa: adapter_class تعریف نشده است
fr: adapter_class n'est pas défini
gl: adapter_class non está definido
he: adapter_class אינו מוגדר
hr: adapter_class nije definiran
id: adapter_class tidak didefinisikan
ms: adapter_class tidak ditakrifkan
pt: adapter_class não está definido
sk: adapter_class nie je definovaný
sr: adapter_class nije definisan
sw: adapter_class haijafafanuliwa
tr: adapter_class tanımlanmadı

source: Refresh token was not included in cookie data.
af: Verfris token is nie in koekie data ingesluit nie.
ar: رمز التحديث لم يكن مضمناً في بيانات ملف تعريف الارتباط.
bg: Токенът за обновяване не е включен в данните на бисквитката.
fa: توکن تازه‌سازی در داده‌های کوکی موجود نبود.
fr: Le jeton de renouvellement n'était pas inclus dans les données du cookie.
gl: O token de actualización non foi incluído nos datos da cookie.
he: אסימון רענון לא נכלל בנתוני העוגיה.
hr: Refresh token nije uključen u podatke kolačića.
id: Token refresh tidak disertakan dalam data cookie.
ms: Token penyegaran tidak disertakan dalam data cookie.
pt: Token de atualização não foi incluído nos dados do cookie.
sk: Obnovovací token nebol zahrnutý v údajoch súboru cookie.
sr: Refresh token nije uključen u podatke kolačića.
sw: Alama ya ubugarizi haikujumuishwa katika data ya kidakuzi.
tr: Yenileme tokeni çerez verisinde dahil edilmedi.
