Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.2-py3-none-any.whl/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: af, ar, bg, fa, fr, gl, he, hr, id, ms, pt, sk, sr, sw, tr

source: Refresh token was not included in request data.
af: Verfris token is nie in versoek data ingesluit nie.
ar: رمز التحديث لم يكن مضمناً في بيانات الطلب.
bg: Токенът за обновяване не е включен в данните на заявката.
fa: توکن تازه‌سازی در داده‌های درخواست موجود نبود.
fr: Le jeton de renouvellement n'était pas inclus dans les données de la requête.
gl: O token de actualización non foi incluído nos datos da solicitude.
he: אסימון רענון לא נכלל בנתוני הבקשה.
hr: Refresh token nije uključen u podatke zahtjeva.
id: Token refresh tidak disertakan dalam data permintaan.
ms: Token penyegaran tidak disertakan dalam data permintaan.
pt: Token de atualização não foi incluído nos dados da solicitação.
sk: Obnovovací token nebol zahrnutý v údajoch požiadavky.
sr: Refresh token nije uključen u podatke zahteva.
sw: Alama ya ubugarizi haikujumuishwa katika data ya ombi.
tr: Yenileme tokeni istek verisinde dahil edilmedi.

source: An error has occurred.
af: 'n Fout het voorgekom.
ar: حدث خطأ.
bg: Възникна грешка.
fa: خطایی رخ داده است.
fr: Une erreur s'est produite.
gl: Ocorreu un erro.
he: אירעה שגיאה.
hr: Dogodila se greška.
id: Terjadi kesalahan.
ms: Ralat telah berlaku.
pt: Ocorreu um erro.
sk: Vyskytla sa chyba.
sr: Došlo je do greške.
sw: Kosa limetokea.
tr: Bir hata oluştu.

source: Successfully logged out.
af: Suksesvol uitgeteken.
ar: تم تسجيل الخروج بنجاح.
bg: Успешно излизане.
fa: با موفقیت خارج شدید.
fr: Déconnexion réussie.
gl: Sesión pechada correctamente.
he: התנתקות הושלמה בהצלחה.
hr: Uspješno odjavljeno.
id: Berhasil keluar.
ms: Berjaya log keluar.
pt: Desconectado com sucesso.
sk: Úspešne odhlásený.
sr: Uspešno odjavljen.
sw: Umetoka kwa mafanikio.
tr: Başarıyla çıkış yapıldı.

source: Password reset e-mail has been sent.
af: Wagwoord-herstel e-pos is gestuur.
ar: تم إرسال بريد إلكتروني لإعادة تعيين كلمة المرور.
bg: Имейл за нулиране на парола е изпратен.
fa: ایمیل بازنشانی کلمه عبور ارسال شد.
fr: L'email de réinitialisation du mot de passe a été envoyé.
gl: Enviouse o correo electrónico de restablecemento de contrasinal.
he: דוא״ל איפוס סיסמה נשלח.
hr: E-mail za ponovnu postavku lozinke je poslan.
id: E-mail reset kata sandi telah dikirim.
ms: E-mel tetapan semula kata laluan telah dihantar.
pt: Email de redefinição de senha foi enviado.
sk: E-mail na resetovanie hesla bol odoslaný.
sr: Email za resetovanje lozinke je poslat.
sw: Barua pepe ya kuweka upya nenosiri imetumwa.
tr: Şifre sıfırlama e-postası gönderildi.

source: Password has been reset with the new password.
af: Wagwoord is herstel met die nuwe wagwoord.
ar: تم إعادة تعيين كلمة المرور بكلمة المرور الجديدة.
bg: Паролата е нулирана с новата парола.
fa: کلمه عبور با کلمه عبور جدید بازنشانی شد.
fr: Le mot de passe a été réinitialisé avec le nouveau mot de passe.
gl: O contrasinal foi restablecido co novo contrasinal.
he: הסיסמה אופסה עם הסיסמה החדשה.
hr: Lozinka je resetirana s novom lozinkom.
id: Kata sandi telah direset dengan kata sandi baru.
ms: Kata laluan telah ditetapkan semula dengan kata laluan baru.
pt: A senha foi redefinida com a nova senha.
sk: Heslo bolo resetované novým heslom.
sr: Lozinka je resetovana sa novom lozinkom.
sw: Nenosiri limewekwa upya kwa nenosiri jipya.
tr: Şifre yeni şifre ile sıfırlandı.

source: New password has been saved.
af: Nuwe wagwoord is gestoor.
ar: تم حفظ كلمة المرور الجديدة.
bg: Новата парола е запазена.
fa: کلمه عبور جدید ذخیره شد.
fr: Le nouveau mot de passe a été sauvegardé.
gl: O novo contrasinal foi gardado.
he: הסיסמה החדשה נשמרה.
hr: Nova lozinka je spremljena.
id: Kata sandi baru telah disimpan.
ms: Kata laluan baru telah disimpan.
pt: A nova senha foi salva.
sk: Nové heslo bolo uložené.
sr: Nova lozinka je sačuvana.
sw: Nenosiri jipya limehifadhiwa.
tr: Yeni şifre kaydedildi.

source: Verification e-mail sent.
af: Verifikasie e-pos gestuur.
ar: تم إرسال بريد إلكتروني للتحقق.
bg: Имейл за потвърждение изпратен.
fa: ایمیل تأیید ارسال شد.
fr: Email de vérification envoyé.
gl: Correo electrónico de verificación enviado.
he: דוא״ל אימות נשלח.
hr: Verifikacijski e-mail poslan.
id: E-mail verifikasi dikirim.
ms: E-mel pengesahan dihantar.
pt: Email de verificação enviado.
sk: Overovací e-mail odoslaný.
sr: Email za verifikaciju poslat.
sw: Barua pepe ya uthibitishaji imetumwa.
tr: Doğrulama e-postası gönderildi.

source: Successfully registered.
af: Suksesvol geregistreer.
ar: تم التسجيل بنجاح.
bg: Успешно регистриране.
fa: با موفقیت ثبت نام شد.
fr: Enregistrement réussi.
gl: Rexistrado correctamente.
he: הרישום הושלם בהצלחה.
hr: Uspješno registrirano.
id: Berhasil terdaftar.
ms: Berjaya didaftarkan.
pt: Registrado com sucesso.
sk: Úspešne registrovaný.
sr: Uspešno registrovan.
sw: Umesajiliwa kwa mafanikio.
tr: Başarıyla kaydedildi.

source: ok
ar: موافق
bg: добре
fa: تأیید
gl: vale
he: בסדר
hr: u redu
ms: baik
sr: u redu
sw: sawa
tr: tamam

source: Personal info
af: Persoonlike inligting
ar: معلومات شخصية
bg: Лична информация
fa: اطلاعات شخصی
fr: Informations personnelles
gl: Información persoal
he: מידע אישי
hr: Osobni podaci
id: Informasi pribadi
ms: Maklumat peribadi
pt: Informações pessoais
sk: Osobné informácie
sr: Lični podaci
sw: Taarifa za kibinafsi
tr: Kişisel bilgi

source: Permissions
af: Toestemmings
ar: أذونات
bg: Разрешения
fa: مجوزها
gl: Permisos
he: הרשאות
hr: Dozvole
id: Izin
ms: Kebenaran
pt: Permissões
sk: Oprávnenia
sr: Dozvole
sw: Ruhusa
tr: İzinler

source: Important dates
af: Belangrike datums
ar: تواريخ مهمة
bg: Важни дати
fa: تاریخ‌های مهم
fr: Dates importantes
gl: Datas importantes
he: תאריכים חשובים
hr: Važni datumi
id: Tanggal penting
ms: Tarikh penting
pt: Datas importantes
sk: Dôležité dátumy
sr: Važni datumi
sw: Tarehe muhimu
tr: Önemli tarihler
