Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.2.tar.gz/litegram-1.0.2/docs/locale/*/LC_MESSAGES/api/download_file.po
Languages: ru

source: How to download file?
ru: Как скачать файл?

source: Download file manually
ru: Загрузка файла вручную

source: First, you must get the `file_id` of the file you want to download. Information about files sent to the bot is contained in `Message <types/message.html>`__.
ru: Во-первых, вы должны получить `file_id` файлу, который вы хотите скачать. Информация о файлы, отправленные боту, содержится в `Message <types/message.html>`__.

source: For example, download the document that came to the bot.
ru: Например, скачайте документ, который пришел боту.

source: Then use the `getFile <methods/get_file.html>`__ method to get `file_path`.
ru: Затем воспользуйтесь методом `getFile <methods/get_file.html>`__, чтобы получить `file_path`.

source: After that, use the `download_file <#download-file>`__ method from the bot object.
ru: После этого воспользуйтесь методом `download_file <#download-file>`__ с объекта бота.

source: Download file by `file_path` to destination.
ru: Загружает файл за `file_path` в указанное место.

source: If you want to automatically create destination (:obj:`io.BytesIO`) use default value of destination and handle result of this method.
ru: Если вы хотите автоматически создать место назначения (io.BytesIO), используйте значение назначения по умолчанию и обработайте результат этого методу.

source: Download file by file_path to destination.
ru: Загружает файл с file_path в указанное место.

source: If you want to automatically create destination (:class:`io.BytesIO`) use default value of destination and handle result of this method.
ru: Если вы хотите автоматически создать место назначения (io.BytesIO), используйте значение назначения по умолчанию и обработайте результат этого методу.

source: Parameters
ru: Параметры

source: File path on Telegram server (You can get it from :obj:`litegram.types.File`)
ru: Путь к файлу на сервере Telegram (Вы можете получить его с :obj:`litegram.types.File`)

source: Filename, file path or instance of :class:`io.IOBase`. For e.g. :class:`io.BytesIO`, defaults to None
ru: Ім’я файлу, шлях к файлу или екземпляр :class:`io.IOBase`. Для напр. :class:`io.BytesIO`, по умолчанию нет

source: Total timeout in seconds, defaults to 30
ru: Общее время ожидания в секундах, по умолчанию 30

source: File chunks size, defaults to 64 kb
ru: Розмир фрагментов файлу, по умолчанию 64 Кб

source: Go to start of file when downloading is finished. Used only for destination with :class:`typing.BinaryIO` type, defaults to True
ru: Перейти в начало файлу, когда загрузка закончится. Используется только для назначения с типом :class:`typing.BinaryIO`, по умолчанию значение True

source: There are two options where you can download the file: to **disk** or to **binary I/O object**.
ru: Існуе два варианта загрузка файлу: на **disk** или на **binary I/O object**.

source: Download file to disk
ru: Загрузка файлу на диск

source: To download file to disk, you must specify the file name or path where to download the file. In this case, the function will return nothing.
ru: Чтобы скачать файл на диск, необходимо указать имя файлу или шлях, куда его скачать. У этому случае функция ничего не вернет.

source: Download file to binary I/O object
ru: Загрузка файлу в оперативну пам'ять

source: To download file to binary I/O object, you must specify an object with the :obj:`typing.BinaryIO` type or use the default (:obj:`None`) value.
ru: Чтобы скачать файл к оперативную память, вы должны указать объект из типом :obj:`typing.BinaryIO` или використати значение по умолчанию (:obj:`None`).

source: In the first case, the function will return your object:
ru: У первом случае функция вернет ваш объект:

source: If you leave the default value, an :obj:`io.BytesIO` object will be created and returned.
ru: Якщо залишити значение по умолчанию, буде створено и повернено объект :obj:`io.BytesIO`.

source: Download file in short way
ru: Загрузка файла коротким путем

source: Getting `file_path` manually every time is boring, so you should use the `download <#download>`__ method.
ru: Каждый раз добывать `file_path` вручную скучно, поэтому вам следует использовать метод `download <#download>`__.

source: Download file by `file_id` or `Downloadable` object to destination.
ru: Загружает файл за `file_id` или `Downloadable` объектом в указанное место.

source: Download file by file_id or Downloadable object to destination.
ru: Загружает файл за file_id или Downloadable объектом в указанное место.

source: file_id or Downloadable object
ru: file_id или Downloadable объект

source: It differs from `download_file <#download-file>`__ **only** in that it accepts `file_id` or an `Downloadable` object (object that contains the `file_id` attribute) instead of `file_path`.
ru: Он отличается от `download_file <#download-file>`__ **только** тем, что принимает `file_id` или `Downloadable` объект (объект, который содержит атрибут `file_id`) вместо `file_path`.

source: You can download a file to `disk <#download-file-to-disk>`__ or to a `binary I/O <#download-file-to-binary-io-object>`__ object in the same way.
ru: Вы можете скачать файл на `disk <#download-file-to-disk>`__ или в `binary I/O object <#download-file-to-binary-io-object>`__ так же.

source: Example:
ru: Пример:
