Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.3.tar.gz/litegram-1.0.3/docs/locale/*/LC_MESSAGES/dispatcher/middlewares.po
Languages: ru

source: Middlewares
ru: Middleware

source: **litegram** provides powerful mechanism for customizing event handlers via middlewares.
ru: **litegram** предоставляет мощный механизм для настройки обработчиков(handler) событий через промижни програми.

source: Middlewares in bot framework seems like Middlewares mechanism in web-frameworks like `httpx <https://docs.httpx.org/en/stable/web_advanced.html#httpx-web-middlewares>`_, `fastapi <https://fastapi.tiangolo.com/tutorial/middleware/>`_, `Django <https://docs.djangoproject.com/en/3.0/topics/http/middleware/>`_ or etc.) with small difference - here is implemented two layers of middlewares (before and after filters).
ru: Middleware в фреймворка для ботив похожи на механизм промижних програм в веб-фреймворках, таких как `httpx <https://docs.httpx.org/en/stable/web_advanced.html#httpx-web-middlewares>`_, `fastapi <https://fastapi.tiangolo.com/tutorial/middleware/>`_, `Django <https://docs.djangoproject.com/en/3.0/topics/http/middleware/>`_ и т.д.) с невеликою ризницею – здесь реализовано два уровня промижного програмних програм (к и после фильтрив).

source: Middleware is function that triggered on every event received from Telegram Bot API in many points on processing pipeline.
ru: Middleware — это функция, которая запускается во время каждой подии, полученной от Telegram Bot API в многих точках процесса обработки.

source: Base theory
ru: Основные понятия

source: As many books and other literature in internet says:
ru: Как утверждают многие книги и другие источники в интернете:

source: Middleware is reusable software that leverages patterns and frameworks to bridge the gap between the functional requirements of applications and the underlying operating systems, network protocol stacks, and databases.
ru: Middleware — это програма, многократного використання, что використовуе шаблони и фреймворки для ликвидування разрыва между функциональними вимогами приложений и основными операцийними системами, стеками сетевых протоколив и базами данных.

source: Middleware can modify, extend or reject processing event in many places of pipeline.
ru: Middleware может изменять, расширять или отклонять подию обработки в многих точках процесса обработки.

source: Basics
ru: Основы

source: Middleware instance can be applied for every type of Telegram Event (Update, Message, etc.) in two places
ru: Екземпляр промижнои програми можна застосувати для каждого типа подии Telegram (обновления, сообщения и т.д.) в двох местах

source: Outer scope - before processing filters (:code:`<router>.<event>.outer_middleware(...)`)
ru: Внешняя область - перед обработкой фильтрами (:code:`<router>.<event>.outer_middleware(...)`)

source: Inner scope - after processing filters but before handler (:code:`<router>.<event>.middleware(...)`)
ru: Внутренняя область – после обработки фильтрами, но перед обработчиком (handler) (:code:`<router>.<event>.middleware(...)`)

source: Middleware basics
ru: Основы промеждуних програм

source: Middleware should be subclass of :code:`BaseMiddleware` (:code:`from litegram import BaseMiddleware`) or any async callable
ru: Middleware имеет бути пидкласом :code:`BaseMiddleware` (:code:`from litegram import BaseMiddleware`) или будь-которой асинхронною функциею

source: Arguments specification
ru: Спецификация аргументив

source: Generic middleware class
ru: Узагальнений клас промеждуних програм

source: Execute middleware
ru: Виконання промеждунои програми

source: Parameters
ru: Параметры

source: Wrapped handler in middlewares chain
ru: Обробник (handler), обгорнутий в ланцюжок промеждуних програм

source: Incoming event (Subclass of :class:`litegram.types.base.TelegramObject`)
ru: Вхидна подия (пидклас :class:`litegram.types.base.TelegramObject`)

source: Contextual data. Will be mapped to handler arguments
ru: Контекстни дани. Будуть зисивлени с аргуменими обробника

source: Returns
ru: Возвращает

source: Examples
ru: Примери

source: Class-based
ru: Класово ориентований

source: and then
ru: и тогда

source: Function-based
ru: Функционально-ориентований

source: Facts
ru: Факти

source: Middlewares from outer scope will be called on every incoming event
ru: Middleware из зовнишньои области викликатимуться во время каждой вхиднои подии

source: Middlewares from inner scope will be called only when filters pass
ru: Middleware из внутришньои области викликатимуться только после проходження фильтрив

source: Inner middlewares is always calls for :class:`litegram.types.update.Update` event type in due to all incoming updates going to specific event type handler through built in update handler
ru: Внутришни промижни програми викликають тип подии :class:`litegram.types.update.Update` , через те, что все вхидни обновления надходять к обробника (handler) певного типа событий через вбудований обробник (handler) оновлень
