Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.3.tar.gz/litegram-1.0.3/docs/locale/*/LC_MESSAGES/dispatcher/filters/magic_filters.po
Languages: ru

source: Magic filters
ru: ✨ Магични 🔮 фильтри ✨

source: This page still in progress. Has many incorrectly worded sentences.
ru: Ця сторинка все еще в разработке. Мае много неправильно сформульованих речень.

source: Is external package maintained by *litegram* core team.
ru: Це зовнишний пакет, который пидтримуеться основною командою розробки *litegram*.

source: By default installs with *litegram* and also is available on `PyPi - magic-filter <https://pypi.org/project/magic-filter/>`_. That's mean you can install it and use with any other libraries and in own projects without depending *litegram* installed.
ru: За замовчуванням встановлюеться разом с *litegram* и, також, доступний в `PyPi - magic-filter <https://pypi.org/project/magic-filter/>`_. Це означае, что Вы можете встановити его и использовать с будь-которыми иншими библиотеками и в власних проектах, незалежно от того встановлено *litegram* чи ни.

source: Usage
ru: Использование

source: The **magic_filter** package implements class shortly named :class:`magic_filter.F` that's mean :code:`F` can be imported from :code:`litegram` or :code:`magic_filter`. :class:`F` is alias for :class:`MagicFilter`.
ru: Пакет **magic_filter** реализует клас из короткою назвою :class:`magic_filter.F`, тобто :code:`F` можна импортувати с :code:`litegram` или :code:`magic_filter`. :class:`F` является псевдонимом для :class:`MagicFilter`.

source: Note that *litegram* has an small extension over magic-filter and if you want to use this extension you should import magic from *litegram* instead of *magic_filter* package
ru: Зауважте, что *litegram* имеет невелике розширення для magic-filter, и если Ви хотите использовать это розширення, вам следует импортувати магию с *litegram* вместо пакета *magic_filter*

source: The :class:`MagicFilter` object is callable, supports :ref:`some actions <magic-filter-possible-actions>` and memorize the attributes chain and the action which should be checked on demand.
ru: Объект классу :class:`MagicFilter` можна викликати, поддерживает :ref:`деяки действия <magic-filter-possible-actions>` и запам’ятовуе ланцюжок атрибутив и дию, которую следует перевиряти на вимогу.

source: So that's mean you can chain attribute getters, describe simple data validations and then call the resulted object passing single object as argument, for example make attributes chain :code:`F.foo.bar.baz` then add action ':code:`F.foo.bar.baz == 'spam'` and then call the resulted object - :code:`(F.foo.bar.baz == 'spam').resolve(obj)`
ru: Тож это означае, что вы можете ланцюжком получить атрибути, описати простые проверки данных, а потим викликати отриманий объект, передаючи один объект как аргумент, например, створити ланцюжок атрибутив :code:`F.foo.bar.baz`, а потим додати дию ':code:`F.foo.bar.baz == 'spam'`, после чого викликати отриманий объект - :code:`(F.foo.bar.baz == 'spam').resolve(obj)`

source: Possible actions
ru: Можливи действия

source: Magic filter object supports some of basic logical operations over object attributes
ru: Объект магичного фильтра поддерживает деяки основни логични операции над атрибутами объекта

source: Exists or not None
ru: Атрибут существует, или не "None"

source: Default actions.
ru: Дии по умолчанию.

source: Equals
ru: Проверка на однаковисть

source: Is one of
ru: Проверка на приналежнисть

source: Can be used as method named :code:`in_` or as matmul operator :code:`@` with any iterable
ru: Може использоваться как метод из назвою :code:`in_` или как оператор matmul :code:`@` с будь-которым итерованим

source: Contains
ru: Проверка на наявнисть

source: String startswith/endswith
ru: Рякк починаеться/закинчуеться на

source: Can be applied only for text attributes
ru: Може застосовуватися только для текстовых атрибутив

source: Regexp
ru: Проверка регулярними виразами

source: Custom function
ru: Власни функции

source: Accepts any callable. Callback will be called when filter checks result
ru: Приймае будь-которую функцию

source: Inverting result
ru: Інвертування результатту

source: Any of available operation can be inverted by bitwise inversion - :code:`~`
ru: Будь-которая доступна операция может бути инвертована с помощью побитовои инверсии - :code:`~`

source: Combining
ru: Комбинация

source: All operations can be combined via bitwise and/or operators - :code:`&`/:code:`|`
ru: Все операции можна комбинувати с помощью побитових и/или операторив - :code:`&`/:code:`|`

source: Attribute modifiers - string manipulations
ru: Модификатори атрибутив - манипуляции с рядками

source: Make text upper- or lower-case
ru: Робить текст верхним или нижним регистром

source: Can be used only with string attributes.
ru: Можна использовать только с рядковими атрибуими.

source: Get filter result as handler argument
ru: Отримати результатт фильтра как аргумент обробника

source: This part is not available in *magic-filter* directly but can be used with *litegram*
ru: Ця частина недоступна непосредственно в *magic-filter*, але ии можна использовать с *litegram*

source: Usage in *litegram*
ru: Использование в *litegram*
