Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.2.tar.gz/litegram-1.0.2/docs/locale/*/LC_MESSAGES/api/enums/chat_action.po
Languages: ru

source: This object represents bot actions.
ru: Этот объект представляет действия бота.

source: Choose one, depending on what the user is about to receive:
ru: Выберите один в зависимости от того, что пользователь собирается получить:

source: typing for text messages,
ru: typing для текстовых сообщений,

source: upload_photo for photos,
ru: upload_photo для фотографий,

source: record_video or upload_video for videos,
ru: record_video или upload_video для видео,

source: record_voice or upload_voice for voice notes,
ru: record_voice или upload_voice для голосовых сообщений,

source: upload_document for general files,
ru: upload_document для общих файлов,

source: choose_sticker for stickers,
ru: choose_sticker для наклеек,

source: find_location for location data,
ru: find_location для данних о место нахождении,

source: record_video_note or upload_video_note for video notes.
ru: record_video_note или upload_video_note для видео кружков.

source: Source: https://core.telegram.org/bots/api#sendchataction
ru: Источник: https://core.telegram.org/bots/api#sendchataction
