Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.0.tar.gz/litegram-1.0.0/docs/locale/*/LC_MESSAGES/dispatcher/finite_state_machine/index.po
Languages: ru

source: Finite State Machine
ru: Кинэтовий автомат (FSM)

source: A finite-state machine (FSM) or finite-state automaton (FSA, plural: automata), finite automaton, or simply a state machine, is a mathematical model of computation.
ru: Кинцевий автомат, кинцевий автоматон, или машина станив (FSM, FSA, finite automaton, state machine) - это математична модель обчислень.

source: It is an abstract machine that can be in exactly one of a finite number of states at any given time. The FSM can change from one state to another in response to some inputs; the change from one state to another is called a transition.
ru: Це абстрактна машина, которая может перебувати в одному зи скинченнои килькости станив в будь-который момент часу. Кинцевий автомат может переходити с одного стану в инший в ответ на деяки вхидни дани; перехид с одного стану в инший називаеться переходом.

source: An FSM is defined by a list of its states, its initial state, and the inputs that trigger each transition.
ru: Кинцевий автомат визначаеться списком его станив, початковим станом и вхидними даними, которые запускають каждый перехид.

source: Source: `WikiPedia <wiki>`_
ru: Источник: `WikiPedia <wiki>`_

source: Usage example
ru: Пример викорисиння

source: Not all functionality of the bot can be implemented as single handler, for example you will need to collect some data from user in separated steps you will need to use FSM.
ru: Не все функции бота можна реализувати как единий обробник (handler), например, если Вам потрибно буде збирати деяки дани от пользователя в окремих кроках, вам потрибно буде использовать FSM.

source: FSM Example
ru: Пример кинэтового автомату

source: Let's see how to do that step-by-step
ru: Гайда, подивимось как реализувати это крок за кроком

source: Step by step
ru: Крок за кроком

source: Before handle any states you will need to specify what kind of states you want to handle
ru: Перед обробкою будь-которых станив Вам потрибно буде указать тип станив, которые Ви хотите обробляти

source: And then write handler for each state separately from the start of dialog
ru: А потим напишить обробник (handler) для каждого стану окремо от початку диалогу

source: Here is dialog can be started only via command :code:`/start`, so lets handle it and make transition user to state :code:`Form.name`
ru: Тут диалог можна почати только с помощью команды :code:`/start`, поэтому давайте обробимо ии и зробимо перехид пользователя к стану :code:`Form.name`

source: After that you will need to save some data to the storage and make transition to next step.
ru: После этого Вам потрибно буде зберегти деяки дани в пам’яти и перейти к наступного кроку.

source: At the next steps user can make different answers, it can be `yes`, `no` or any other
ru: На наступних кроках пользователь может дати ризни видповиди, это может бути «так», «ни» или будь-что инше

source: Handle :code:`yes` and soon we need to handle :code:`Form.language` state
ru: Обробка :code:`yes` и скоро нам потрибно буде обробити стан :code:`Form.language`

source: Handle :code:`no`
ru: Обробка :code:`no`

source: And handle any other answers
ru: І обробка будь-которых других ответов

source: All possible cases of `like_bots` step was covered, let's implement finally step
ru: Вси можливи випадки кроку `like_bots` було розглянуто, нумо реализуемо останний крок

source: And now you have covered all steps from the image, but you can make possibility to cancel conversation, lets do that via command or text
ru: І теперь Ви виконали все кроки на зображенни, але вы можете зробити можливисть скасувати диалог, давайте зробимо это с помощью команды или тексту

source: Complete example
ru: Повний пример

source: Read more
ru: Чиийте икож
