Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.9.tar.gz/litegram-1.0.9/docs/locale/*/LC_MESSAGES/dispatcher/filters/command.po
Languages: ru

source: Command
ru: Команды

source: Usage
ru: Использование

source: Filter single variant of commands: :code:`Command("start")`
ru: Фильтр одиночного варианта команд: :code:`Command("start")`

source: Handle commands in public chats intended for other bots: :code:`Command("command", ignore_mention=True)`
ru: Обработка команды в публичных чатах, предназначенных для других ботов: :code:`Command("command", ignore_mention=True)`

source: Use :class:`litegram.types.bot_command.BotCommand` object as command reference :code:`Command(BotCommand(command="command", description="My awesome command")`
ru: Использование объекта :class:`litegram.types.bot_command.BotCommand` как ссылку на команду :code:`Command(BotCommand(command="command", description="My awesome command")`

source: Command cannot include spaces or any whitespace
ru: Команда не может содержать пробелы или любые другие пробельные символы

source: This filter can be helpful for handling commands from the text messages.
ru: Этот фильтр может быть полезен для обработки команд из текстовых сообщений.

source: Works only with :class:`litegram.types.message.Message` events which have the :code:`text`.
ru: Работает только с событиями :class:`litegram.types.message.Message`, которые имеют :code:`text`.

source: List of commands (string or compiled regexp patterns)
ru: Список команд (строки или скомпилированные регулярные выражения)

source: Parameters
ru: Параметры

source: Prefix for command. Prefix is always a single char but here you can pass all of allowed prefixes, for example: :code:`"/!"` will work with commands prefixed by :code:`"/"` or :code:`"!"`.
ru: Префикс для команды. Префикс всегда состоит из одного символа, но здесь вы можете передать все разрешенные префиксы, например: :code:`"/!"` будет работать с командами с префиксом :code:`"/"` или :code:`"!"`.

source: Ignore case (Does not work with regexp, use flags instead)
ru: Игнорировать регистр (не работает с регулярным выражением, вместо этого используйте флаги)

source: Ignore bot mention. By default, bot can not handle commands intended for other bots
ru: Игнорировать упоминание бота. По умолчанию бот не может обрабатывать команды, предназначенные для других ботов

source: Validate command object via Magic filter after all checks done
ru: Проверка объекта команды с помощью магического фильтра после выполнения всех проверок

source: When filter is passed the :class:`litegram.filters.command.CommandObject` will be passed to the handler argument :code:`command`
ru: Когда фильтр пройден, :class:`litegram.filters.command.CommandObject` будет передан аргументу обработчика :code:`command`

source: Instance of this object is always has command and it prefix. Can be passed as keyword argument **command** to the handler
ru: Экземпляр этого объекта всегда имеет команду и её префикс. Можно передать обработчику (handler) как аргумент ключевого слова **command**

source: Command prefix
ru: Префикс команды

source: Command without prefix and mention
ru: Команда без префикса и упоминания

source: Mention (if available)
ru: Упоминание (если доступно)

source: Command argument
ru: Аргумент команды

source: Will be presented match result if the command is presented as regexp in filter
ru: Будет представлен результат соответствия, если команда представлена как регулярное выражение в фильтре

source: This command has mention?
ru: Эта команда содержит упоминание?

source: Generate original text from object
ru: Создание оригинального текста из объекта

source: Allowed handlers
ru: Разрешенные обработчики (handler)

source: Allowed update types for this filter:
ru: Разрешенные типы обновлений для этого фильтра:
