Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.9.tar.gz/litegram-1.0.9/docs/locale/*/LC_MESSAGES/dispatcher/filters/index.po
Languages: ru

source: Filtering events
ru: Фильтрация событий

source: Builtin filters
ru: Встроенные фильтры

source: Here is list of builtin filters:
ru: Вот список встроенных фильтров:

source: Writing own filters
ru: Написание собственных фильтров

source: Filters can be:
ru: Фильтры могут быть:

source: Asynchronous function (:code:`async def my_filter(*args, **kwargs): pass`)
ru: Асинхронной функцией (:code:`async def my_filter(*args, **kwargs): pass`)

source: Synchronous function (:code:`def my_filter(*args, **kwargs): pass`)
ru: Синхронной функцией (:code:`def my_filter(*args, **kwargs): pass`)

source: Anonymous function (:code:`lambda event: True`)
ru: Анонимной функцией (:code:`lambda event: True`)

source: Any awaitable object
ru: Любым ожидаемым объектом (awaitable object)

source: Subclass of :class:`litegram.filters.base.Filter`
ru: Подклассом :class:`litegram.filters.base.Filter`

source: Instances of :ref:`MagicFilter <magic-filters>`
ru: Экземпляром :ref:`MagicFilter <magic-filters>`

source: and should return bool or dict. If the dictionary is passed as result of filter - resulted data will be propagated to the next filters and handler as keywords arguments.
ru: и должен возвращать bool или dict. Если в качестве результата фильтра передан словарь — полученные данные будут переданы следующим фильтрам и обработчику в качестве именованных аргументов (keywords arguments).

source: Base class for own filters
ru: Базовый класс для собственных фильтров

source: If you want to register own filters like builtin filters you will need to write subclass of this class with overriding the :code:`__call__` method and adding filter attributes.
ru: Если вы хотите зарегистрировать собственные фильтры, как встроенные фильтры, вам нужно будет написать подкласс этого класса с переопределением метода :code:`__call__` и добавлением атрибутов фильтра.

source: This method should be overridden.
ru: Этот метод следует переопределить.

source: Accepts incoming event and should return boolean or dict.
ru: Принимает входящее событие и должен вернуть логическое (bool) значение или dict.

source: Returns
ru: Возвращает

source: Also if you want to extend handler flags with using this filter you should implement this method
ru: Кроме того, если вы хотите расширить флаги обработчика (handler) с помощью этого фильтра, вам следует реализовать этот метод

source: Parameters
ru: Параметры

source: existing flags, can be updated directly
ru: существующие флаги, можно обновить напрямую

source: Own filter example
ru: Пример собственного фильтра

source: For example if you need to make simple text filter:
ru: Например, если вам нужно создать простой текстовый фильтр:

source: Combining Filters
ru: Комбинирование фильтров

source: In general, all filters can be combined in two ways
ru: В целом, все фильтры можно комбинировать двумя способами

source: Recommended way
ru: Рекомендуемый способ

source: If you specify multiple filters in a row, it will be checked with an "and" condition:
ru: Если вы укажете несколько фильтров подряд, они будут проверены по условию "and":

source: Also, if you want to use two alternative ways to run the same handler ("or" condition) you can register the handler twice or more times as you like
ru: Кроме того, если вы хотите использовать два альтернативных способа запуска одного и того же обработчика (условие "or"), вы можете зарегистрировать обработчик дважды или более раз, как вам удобно

source: Also sometimes you will need to invert the filter result, for example you have an *IsAdmin* filter and you want to check if the user is not an admin
ru: Также иногда вам нужно будет инвертировать результат фильтра, например, у вас есть фильтр *IsAdmin* и вы хотите проверить, не является ли пользователь администратором

source: Another possible way
ru: Другой возможный способ

source: An alternative way is to combine using special functions (:func:`and_f`, :func:`or_f`, :func:`invert_f` from :code:`litegram.filters` module):
ru: Альтернативным способом является объединение с помощью специальных функций (:func:`and_f`, :func:`or_f`, :func:`invert_f` из модуля :code:`litegram.filters`):
