Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.3.tar.gz/drf_auth_kit-1.1.3/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: az, bs, cs, hu, hy, is, it, mr, ne, pl, sl, th, uk, ur

source: Send verification code for methods that support code dispatch. Useful for testing method configuration or manual code requests.
az: Kod göndərmə dəstəkləyən metodlar üçün təsdiq kodu göndər. Metod konfiqurasiyasını test etmək və ya əl ilə kod tələbləri üçün faydalıdır.
bs: Pošaljite verifikacioni kod za metode koje podržavaju slanje koda. Korisno za testiranje konfiguracije metode ili ručne zahtjeve za kodove.
cs: Odešle verifikační kód pro metody, které podporují odeslání kódu. Užitečné pro testování konfigurace metody nebo ruční žádosti o kód.
hu: Ellenőrző kód küldése olyan módszerekhez, amelyek támogatják a kódküldést. Hasznos a módszer konfigurációjának tesztelésához vagy manuális kód kérésekhez.
hy: Ուղարկել հաստատման ծածկագիր մեթոդների համար, որոնք աջակցում են ծածկագրի առաքմանը: Օգտակար է մեթոդի կարգավորման փորձարկման կամ ձեռքի ծածկագրի հարցումների համար:
is: Senda staðfestingarkóða fyrir aðferðir sem styðja kóðasendingu. Gagnlegt til að prófa aðferðarstillingu eða handvirkar kóðabeiðnir.
it: Invia il codice di verifica per metodi che supportano l'invio di codici. Utile per testare la configurazione del metodo o richieste manuali di codici.
mr: कोड पाठवण्याला समर्थन देणाऱ्या पद्धतींसाठी वेरिफिकेशन कोड पाठवा. पद्धत कॉन्फिगरेशन चाचणी किंवा मॅन्युअल कोड विनंत्यांसाठी उपयुक्त.
ne: कोड पठाउने समर्थन गर्ने विधिहरूको लागि प्रमाणीकरण कोड पठाउनुहोस्। विधि कन्फिगरेसन परीक्षण वा म्यानुअल कोड अनुरोधहरूको लागि उपयोगी।
pl: Wyślij kod weryfikacyjny dla metod obsługujących wysyłanie kodu. Przydatne do testowania konfiguracji metody lub ręcznych żądań kodu.
sl: Pošlje verifikacijsko kodo za metode, ki podpirajo pošiljanje kod. Uporabno za testiranje konfiguracije metode ali ročne zahteve kod.
th: ส่งรหัสยืนยันสำหรับวิธีที่รองรับการส่งรหัส มีประโยชน์สำหรับการทดสอบการกำหนดค่าวิธีหรือคำขอรหัสด้วยตนเอง
uk: Надіслати код перевірки для методів, які підтримують відправку коду. Корисно для тестування конфігурації методу або ручних запитів коду.
ur: کوڈ بھیجنے کو سپورٹ کرنے والے طریقوں کے لیے تصدیقی کوڈ بھیجیں۔ طریقہ کی ترتیب کو جانچنے یا دستی کوڈ کی درخواست کے لیے مفید ہے۔

source: Permanently delete an MFA method.
az: MFA metodunu həmişəlik silin.
bs: Trajno obriši MFA metodu.
cs: Trvale smaže MFA metodu.
hu: MFA módszer végleges törlése.
hy: Մշտապես ջնջել MFA մեթոդը:
is: Eyða MFA aðferð varanlega.
it: Elimina permanentemente un metodo MFA.
mr: MFA पद्धत कायमची काढून टाका.
ne: MFA विधि स्थायी रूपमा मेटाउनुहोस्।
pl: Trwale usuń metodę MFA.
sl: Trajno izbriše MFA metodo.
th: ลบวิธี MFA อย่างถาวร
uk: Назавжди видалити метод MFA.
ur: MFA طریقے کو مستقل طور پر ڈیلیٹ کریں۔

source: This action cannot be undone.
az: Bu əməliyyat geri qaytarıla bilməz.
bs: Ova radnja se ne može poništiti.
cs: Tuto akci nelze vrátit zpět.
hu: Ez a művelet nem vonható vissza.
hy: Այս գործողությունը հնարավոր չէ հետարկել:
is: Þessa aðgerð er ekki hægt að afturkalla.
it: Questa azione non può essere annullata.
mr: ही क्रिया पूर्ववत करता येणार नाही.
ne: यो कार्य पूर्ववत गर्न सकिँदैन।
pl: Ta akcja nie może zostać cofnięta.
sl: To dejanje ni mogoče razveljaviti.
th: การดำเนินการนี้ไม่สามารถย้อนกลับได้
uk: Цю дію неможливо скасувати.
ur: یہ عمل واپس نہیں کیا جا سکتا۔

source: Cannot delete active methods.
az: Aktiv metodları silə bilməz.
bs: Ne možete obrisati aktivne metode.
cs: Nelze smazat aktivní metody.
hu: Nem lehet törölni az aktív módszereket.
hy: Հնարավոր չէ ջնջել ակտիվ մեթոդները:
is: Getur ekki eytt virkum aðferðum.
it: Impossibile eliminare metodi attivi.
mr: सक्रिय पद्धती काढून टाकू शकत नाही.
ne: सक्रिय विधिहरू मेटाउन सकिँदैन।
pl: Nie można usunąć aktywnych metod.
sl: Ni mogoče izbrisati aktivnih metod.
th: ไม่สามารถลบวิธีที่เปิดใช้งานอยู่
uk: Неможливо видалити активні методи.
ur: فعال طریقوں کو ڈیلیٹ نہیں کر سکتے۔

source: Cannot delete primary methods.
az: Əsas metodları silə bilməz.
bs: Ne možete obrisati primarne metode.
cs: Nelze smazat primární metody.
hu: Nem lehet törölni az elsődleges módszereket.
hy: Հնարավոր չէ ջնջել առաջնային մեթոդները:
is: Getur ekki eytt aðalaðferðum.
it: Impossibile eliminare metodi primari.
mr: प्राथमिक पद्धती काढून टाकू शकत नाही.
ne: प्राथमिक विधिहरू मेटाउन सकिँदैन।
pl: Nie można usunąć metod głównych.
sl: Ni mogoče izbrisati primarnih metod.
th: ไม่สามารถลบวิธีหลัก
uk: Неможливо видалити основні методи.
ur: بنیادی طریقوں کو ڈیلیٹ نہیں کر سکتے۔

source: Requires verification code for active methods.
az: Aktiv metodlar üçün təsdiq kodu tələb edir.
bs: Zahtijeva verifikacioni kod za aktivne metode.
cs: Vyžaduje verifikační kód pro aktivní metody.
hu: Ellenőrző kódot igényel az aktív módszerekhez.
hy: Պահանջում է հաստատման ծածկագիր ակտիվ մեթոդների համար:
is: Krefst staðfestingarkóða fyrir virkar aðferðir.
it: Richiede il codice di verifica per metodi attivi.
mr: सक्रिय पद्धतींसाठी वेरिफिकेशन कोड आवश्यक आहे.
ne: सक्रिय विधिहरूको लागि प्रमाणीकरण कोड आवश्यक छ।
pl: Wymaga kodu weryfikacyjnego dla aktywnych metod.
sl: Zahteva verifikacijsko kodo za aktivne metode.
th: ต้องใช้รหัสยืนยันสำหรับวิธีที่เปิดใช้งาน
uk: Потребує код перевірки для активних методів.
ur: فعال طریقوں کے لیے تصدیقی کوڈ کی ضرورت ہے۔

source: user
az: istifadəçi
bs: korisnik
cs: uživatel
hu: felhasználó
hy: օգտատեր
is: notandi
it: utente
mr: युजर
ne: प्रयोगकर्ता
pl: użytkownik
sl: uporabnik
th: ผู้ใช้
uk: користувач
ur: صارف

source: User who owns this MFA method
az: Bu MFA metodunun sahibi olan istifadəçi
bs: Korisnik koji posjeduje ovu MFA metodu
cs: Uživatel, který vlastní tuto MFA metodu
hu: Felhasználó, aki ezt az MFA módszert birtokolja
hy: Օգտագործող, որը ունի այս MFA մեթոդը
is: Notandi sem á þessa MFA aðferð
it: Utente che possiede questo metodo MFA
mr: या MFA पद्धतीचा मालक असलेला युजर
ne: यस MFA विधिको मालिक प्रयोगकर्ता
pl: Użytkownik, który posiada tę metodę MFA
sl: Uporabnik, ki ima to MFA metodo
th: ผู้ใช้ที่เป็นเจ้าของวิธี MFA นี้
uk: Користувач, якому належить цей метод MFA
ur: صارف جو اس MFA طریقے کا مالک ہے

source: name
az: ad
bs: ime
cs: název
hu: név
hy: անուն
is: nafn
it: nome
mr: नाव
ne: नाम
pl: nazwa
sl: ime
th: ชื่อ
uk: ім'я
ur: نام

source: MFA method name (e.g., 'app', 'email')
az: MFA metod adı (məsələn, 'app', 'email')
bs: Naziv MFA metode (npr. 'app', 'email')
cs: Název MFA metody (např. 'app', 'email')
hu: MFA módszer neve (pl. 'app', 'email')
hy: MFA մեթոդի անվանումը (օր., 'app', 'email')
is: Nafn MFA aðferðar (t.d., 'app', 'email')
it: Nome del metodo MFA (ad esempio, 'app', 'email')
mr: MFA पद्धतीचे नाव (उदा. 'app', 'email')
ne: MFA विधि नाम (उदाहरण: 'app', 'email')
pl: Nazwa metody MFA (np. 'app', 'email')
sl: Ime MFA metode (npr. 'app', 'email')
th: ชื่อวิธี MFA (เช่น 'app', 'email')
uk: Назва методу MFA (наприклад, 'app', 'email')
ur: MFA طریقے کا نام (جیسے 'app', 'email')

source: secret
az: gizli
bs: tajna
cs: tajemství
hu: titok
hy: գաղտնի
is: leyndarmál
it: segreto
mr: गुप्त
ne: गुप्त
pl: sekret
sl: skrivnost
th: ข้อมูลลับ
uk: секрет
ur: رازداری

source: TOTP secret key for generating verification codes
az: Təsdiq kodları yaratmaq üçün TOTP gizli açarı
bs: TOTP tajni ključ za generiranje verifikacijskih kodova
cs: Tajný klíč TOTP pro generování verifikacíčních kódů
hu: TOTP titkos kulcs az ellenőrzési kódok generálásához
hy: TOTP գաղտնի բանալի հաստատման կոդեր գեներացնելու համար
is: TOTP leyndarlykill til að búa til staðfestingarkóða
it: Chiave segreta TOTP per generare codici di verifica
mr: वेरिफिकेशन कोड जेनरेट करण्यासाठी TOTP गुप्त की
ne: प्रमाणीकरण कोडहरू उत्पन्न गर्न TOTP गुप्त कुञ्जी
pl: Tajny klucz TOTP do generowania kodów weryfikacyjnych
sl: TOTP skrivni ključ za generiranje verifikacijskih kod
th: กุญแจลับ TOTP สำหรับสร้างรหัสยืนยัน
uk: Секретний ключ TOTP для генерації кодів перевірки
ur: تصدیقی کوڈز بنانے کے لیے TOTP خفیہ کلید

source: is primary
az: əsasdir
bs: je primarno
cs: je primární
hu: elsődleges
hy: առաջնային է
is: er aðalaðferð
it: è primario
mr: प्राथमिक आहे
ne: प्राथमिक हो
pl: jest główną
sl: je primarno
th: เป็นหลัก
uk: є основним
ur: بنیادی ہے

source: Whether this is the user's primary MFA method
az: Bu istifadəçinin əsas MFA metodu olub-olmaması
bs: Da li je ovo korisnikova primarna MFA metoda
cs: Zda je toto uživatelová primární MFA metoda
hu: Hogy ez a felhasználó elsődleges MFA módszere-e
hy: Այսը օգտագործողի հիմնական MFA մեթոդը է
is: Hvort þetta er aðal MFA aðferð notandans
it: Se questo è il metodo MFA principale dell'utente
mr: ही युजरची प्राथमिक MFA पद्धत आहे का
ne: के यो प्रयोगकर्ताको प्राथमिक MFA विधि हो
pl: Czy to jest główna metoda MFA użytkownika
sl: Ali je to uporabnikova primarna MFA metoda
th: สิ่งนี้เป็นวิธี MFA หลักของผู้ใช้หรือไม่
uk: Чи це основний метод MFA користувача
ur: کیا یہ صارف کا بنیادی MFA طریقہ ہے

source: is active
az: aktivdir
bs: je aktivno
cs: je aktivní
hu: aktív
hy: ակտիվ է
is: er virk
it: è attivo
mr: सक्रिय आहे
ne: सक्रिय छ
pl: jest aktywna
sl: je aktivno
th: เปิดใช้งาน
uk: є активним
ur: فعال ہے

source: Whether this method is active and can be used
az: Bu metodun aktiv olub-olmaması və istifadə edilə bilməsi
bs: Da li je ova metoda aktivna i može se koristiti
cs: Zda je tato metoda aktivní a může být použita
hu: Hogy ez a módszer aktív-e és használható-e
hy: Այս մեթոդը ակտիվ է և կարող է օգտագործվել
is: Hvort þessi aðferð er virk og hægt að nota
it: Se questo metodo è attivo e può essere utilizzato
mr: ही पद्धत सक्रिय आहे आणि वापरली जाऊ शकते का
ne: के यो विधि सक्रिय छ र प्रयोग गर्न सकिन्छ
pl: Czy ta metoda jest aktywna i może być używana
sl: Ali je ta metoda aktivna in se lahko uporablja
th: วิธีนี้เปิดใช้งานและสามารถใช้งานได้หรือไม่
uk: Чи цей метод активний і може використовуватися
ur: کیا یہ طریقہ فعال ہے اور استعمال ہو سکتا ہے

source: backup codes
az: eçtiyati kodlar
bs: rezervni kodovi
cs: záložní kódy
hu: biztonsági mentés kódok
hy: պահեստային ծածկագրեր
is: varakóðar
it: codici di backup
mr: बॅकअप कोड्स
ne: ब्याकअप कोडहरू
pl: kody zapasowe
sl: rezervne kode
th: รหัสสำรอง
uk: резервні коди
ur: بیک اپ کوڈز

source: JSON field storing backup codes for account recovery
az: Hesab bərpası üçün ehtiyati kodları saxlayan JSON sahəsi
bs: JSON polje koje čuva rezervne kodove za oporavak računa
cs: JSON pole ukládající záložní kódy pro obnovu účtu
hu: JSON mező, amely a fiók helyreállításához szükséges biztonsági kódokat tárolja
hy: JSON դաշտ, որը պահին է հաշվարների վերականգնման առաջանծության առաջանծական կոդերը
is: JSON svæði sem geymir varakóða fyrir endurheimtu reiknings
it: Campo JSON che memorizza i codici di backup per il recupero dell'account
mr: अकाउंट रिकव्हरीसाठी बॅकअप कोड्स स्टोअर करणारे JSON फील्ड
ne: खाता पुनर्प्राप्तिको लागि ब्याकअप कोडहरू भण्डारण गर्ने JSON फिल्ड
pl: Pole JSON przechowujące kody zapasowe do odzyskiwania konta
sl: JSON polje, ki shranjuje rezervne kode za obnovitev računa
th: ฟิลด์ JSON ที่เก็บรหัสสำรองสำหรับการกู้คืนบัญชี
uk: JSON поле, що зберігає резервні коди для відновлення облікового запису
ur: JSON فیلڈ جو اکاؤنٹ ریکوری کے لیے بیک اپ کوڈز محفوظ کرتا ہے

source: MFA Method
az: MFA Metodu
bs: MFA metoda
cs: MFA Metoda
hu: MFA módszer
hy: MFA մեթոդ
is: MFA aðferð
it: Metodo MFA
mr: MFA पद्धत
ne: MFA विधि
pl: Metoda MFA
sl: MFA Metoda
th: วิธี MFA
uk: Метод MFA
ur: MFA طریقہ

source: MFA Methods
az: MFA Metodları
bs: MFA metode
cs: MFA Metody
hu: MFA módszerek
hy: MFA մեթոդներ
is: MFA aðferðir
it: Metodi MFA
mr: MFA पद्धती
ne: MFA विधिहरू
pl: Metody MFA
sl: MFA Metode
th: วิธี MFA
uk: Методи MFA
ur: MFA طریقے

source: Invalid code
az: Yaramaz kod
bs: Nevažeći kod
cs: Neplatný kód
hu: Érvénytelen kód
hy: Անվավեր ծածկագիր
is: Ógildur kóði
it: Codice non valido
mr: अवैध कोड
ne: अवैध कोड
pl: Nieprawidłowy kod
sl: Neveljavna koda
th: รหัสไม่ถูกต้อง
uk: Недійсний код
ur: غلط کوڈ

source: Invalid token
az: Yaramaz token
bs: Nevažeći token
cs: Neplatný token
hu: Érvénytelen token
hy: Անվավեր նշան
is: Ógildur lykill
it: Token non valido
mr: अवैध टोकन
ne: अवैध टोकन
pl: Nieprawidłowy token
sl: Neveljaven žeton
th: token ไม่ถูกต้อง
uk: Недійсний токен
ur: غلط ٹوکن

source: Please select a new method
az: Zəhmət olmasa yeni metod seçin
bs: Molimo odaberite novu metodu
cs: Vyberte prosím novou metodu
hu: Kérjük válasszon új módszert
hy: Խնդրում ենք ընտրել նոր մեթոդ
is: Veldu nýja aðferð
it: Si prega di selezionare un nuovo metodo
mr: कृपया नवीन पद्धत निवडा
ne: कृपया नयाँ विधि चयन गर्नुहोस्
pl: Proszę wybrać nową metodę
sl: Prosimo, izberite novo metodo
th: โปรดเลือกวิธีใหม่
uk: Будь ласка, оберіть новий метод
ur: برائے کرم نیا طریقہ منتخب کریں

source: This method is already exists
az: Bu metod artıq mövcuddur
bs: Ova metoda već postoji
cs: Tato metoda již existuje
hu: Ez a módszer már létezik
hy: Այս մեթոդը արդեն գոյություն ունի
is: Þessi aðferð er þegar til
it: Questo metodo esiste già
mr: ही पद्धत आधीच अस्तित्वात आहे
ne: यो विधि पहिले नै अवस्थित छ
pl: Ta metoda już istnieje
sl: Ta metoda že obstaja
th: วิธีนี้มีอยู่แล้ว
uk: Цей метод вже існує
ur: یہ طریقہ پہلے سے موجود ہے

source: Invalid OTP code
az: Yaramaz OTP kodu
bs: Nevažeći OTP kod
cs: Neplatný OTP kód
hu: Érvénytelen OTP kód
hy: Անվավեր OTP ծածկագիր
is: Ógildur OTP kóði
it: Codice OTP non valido
mr: अवैध OTP कोड
ne: अवैध OTP कोड
pl: Nieprawidłowy kod OTP
sl: Neveljavna OTP koda
th: รหัส OTP ไม่ถูกต้อง
uk: Недійсний OTP код
ur: غلط OTP کوڈ

source: Activated MFA method
az: Aktivləşdirilmiş MFA metodu
bs: Aktivirana MFA metoda
cs: MFA metoda aktivována
hu: MFA módszer aktiválva
hy: Ակտիվացված MFA մեթոդ
is: Virkjaði MFA aðferð
it: Metodo MFA attivato
mr: MFA पद्धत सक्रिय केली
ne: MFA विधि सक्रिय गरियो
pl: Aktywowano metodę MFA
sl: Aktivirana MFA metoda
th: เปิดใช้งานวิธี MFA แล้ว
uk: Активований метод MFA
ur: MFA طریقہ فعال کر دیا گیا

source: You can only deactivate non-primary MFA method.
az: Yalnız əsas olmayan MFA metodunu deaktivləşdira bilərsiniz.
bs: Možete deaktivirati samo ne-primarnu MFA metodu.
cs: Můžete deaktivovat pouze ne-primární MFA metodu.
hu: Csak nem elsődleges MFA módszert tud deaktiválni.
hy: Դուք կարող եք ապաակտիվացնել միայն ոչ-առաջնային MFA մեթոդը:
is: Þú getur aðeins afvirkjað MFA aðferðir sem eru ekki aðalaðferðir.
it: Puoi disattivare solo metodi MFA non primari.
mr: तुम्ही फक्त गैर-प्राथमिक MFA पद्धत निष्क्रिय करू शकता.
ne: तपाईंले केवल गैर-प्राथमिक MFA विधि निष्क्रिय गर्न सक्नुहुन्छ।
pl: Możesz dezaktywować tylko metodę MFA, która nie jest główną.
sl: Deaktivirate lahko samo ne-primarno MFA metodo.
th: คุณสามารถปิดใช้งานเฉพาะวิธี MFA ที่ไม่ใช่หลักเท่านั้น
uk: Ви можете деактивувати тільки неосновний метод MFA.
ur: آپ صرف غیر بنیادی MFA طریقے کو غیر فعال کر سکتے ہیں۔

source: Deactivated MFA method
az: Deaktivləşdirilmiş MFA metodu
bs: Deaktivirana MFA metoda
cs: MFA metoda deaktivována
hu: MFA módszer deaktiválva
hy: Ապաակտիվացված MFA մեթոդ
is: Afvirkjaði MFA aðferð
it: Metodo MFA disattivato
mr: MFA पद्धत निष्क्रिय केली
ne: MFA विधि निष्क्रिय गरियो
pl: Dezaktywowano metodę MFA
sl: Deaktivirana MFA metoda
th: ปิดใช้งานวิธี MFA แล้ว
uk: Деактивований метод MFA
ur: MFA طریقہ غیر فعال کر دیا گیا

source: Invalid primary method code
az: Yaramaz əsas metod kodu
bs: Nevažeći kod primarne metode
cs: Neplatný kód primární metody
hu: Érvénytelen elsődleges módszer kód
hy: Անվավեր առաջնային մեթոդի ծածկագիր
is: Ógildur kóði aðalaðferðar
it: Codice del metodo primario non valido
mr: अवैध प्राथमिक पद्धत कोड
ne: अवैध प्राथमिक विधि कोड
pl: Nieprawidłowy kod metody głównej
sl: Neveljavna koda primarne metode
th: รหัสวิธีหลักไม่ถูกต้อง
uk: Недійсний код основного методу
ur: غلط بنیادی طریقے کا کوڈ

source: Updated primary MFA method
az: Yenilənmiş əsas MFA metodu
bs: Ažurirana primarna MFA metoda
cs: Primární MFA metoda aktualizována
hu: Elsődleges MFA módszer frissítve
hy: Թարմացված առաջնային MFA մեթոդ
is: Uppfærði aðal MFA aðferð
it: Metodo MFA primario aggiornato
mr: प्राथमिक MFA पद्धत अपडेट केली
ne: प्राथमिक MFA विधि अपडेट गरियो
pl: Zaktualizowano główną metodę MFA
sl: Posodobljena primarna MFA metoda
th: อัปเดตวิธี MFA หลักแล้ว
uk: Оновлений основний метод MFA
ur: بنیادی MFA طریقہ اپڈیٹ کر دیا گیا

source: Cannot delete active MFA method
az: Aktiv MFA metodunu silə bilməz
bs: Ne možete obrisati aktivnu MFA metodu
cs: Nelze smazat aktivní MFA metodu
hu: Nem lehet törölni az aktív MFA módszert
hy: Հնարավոր չէ ջնջել ակտիվ MFA մեթոդը
is: Getur ekki eytt virkri MFA aðferð
it: Impossibile eliminare il metodo MFA attivo
mr: सक्रिय MFA पद्धत काढून टाकू शकत नाही
ne: सक्रिय MFA विधि मेटाउन सकिँदैन
pl: Nie można usunąć aktywnej metody MFA
sl: Ni mogoče izbrisati aktivne MFA metode
th: ไม่สามารถลบวิธี MFA ที่เปิดใช้งาน
uk: Неможливо видалити активний метод MFA
ur: فعال MFA طریقے کو ڈیلیٹ نہیں کر سکتے

source: Cannot delete primary MFA method
az: Əsas MFA metodunu silə bilməz
bs: Ne možete obrisati primarnu MFA metodu
cs: Nelze smazat primární MFA metodu
hu: Nem lehet törölni az elsődleges MFA módszert
hy: Հնարավոր չէ ջնջել առաջնային MFA մեթոդը
is: Getur ekki eytt aðal MFA aðferð
it: Impossibile eliminare il metodo MFA primario
mr: प्राथमिक MFA पद्धत काढून टाकू शकत नाही
ne: प्राथमिक MFA विधि मेटाउन सकिँदैन
pl: Nie można usunąć głównej metody MFA
sl: Ni mogoče izbrisati primarne MFA metode
th: ไม่สามารถลบวิธี MFA หลัก
uk: Неможливо видалити основний метод MFA
ur: بنیادی MFA طریقے کو ڈیلیٹ نہیں کر سکتے

source: Method does not exist
az: Metod mövcud deyil
bs: Metoda ne postoji
cs: Metoda neexistuje
hu: A módszer nem létezik
hy: Մեթոդը գոյություն չունի
is: Aðferð er ekki til
it: Il metodo non esiste
mr: पद्धत अस्तित्वात नाही
ne: विधि अवस्थित छैन
pl: Metoda nie istnieje
sl: Metoda ne obstaja
th: วิธีไม่มีอยู่
uk: Метод не існує
ur: طریقہ موجود نہیں ہے

source: Deleted MFA method
az: Silinmiş MFA metodu
bs: Obrisana MFA metoda
cs: MFA metoda smazána
hu: MFA módszer törölve
hy: Ջնջված MFA մեթոդ
is: Eyddi MFA aðferð
it: Metodo MFA eliminato
mr: MFA पद्धत काढून टाकली
ne: MFA विधि मेटाइयो
pl: Usunięto metodę MFA
sl: Izbrisana MFA metoda
th: ลบวิธี MFA แล้ว
uk: Видалений метод MFA
ur: MFA طریقہ ڈیلیٹ کر دیا گیا

source: MFA code sent
az: MFA kodu göndərildi
bs: MFA kod poslan
cs: MFA kód odeslán
hu: MFA kód elküldve
hy: MFA ծածկագիրը ուղարկված է
is: MFA kóði sendur
it: Codice MFA inviato
mr: MFA कोड पाठवला
ne: MFA कोड पठाइयो
pl: Kod MFA wysłany
sl: MFA koda poslana
th: ส่งรหัส MFA แล้ว
uk: Код MFA надіслано
ur: MFA کوڈ بھیجا گیا

source: Will override cookie.
az: Kukini əvəz edəcək.
bs: Će prebrisati kolačić.
cs: Přepíše cookie.
hu: Felülírja a sütit.
hy: Կվերագրի cookie-ը:
is: Mun hneka vöfur.
it: Sovrascriverà il cookie.
mr: कुकी ओव्हरराइड करेल.
ne: कुकी ओभरराइड गर्नेछ।
pl: Zastąpi plik cookie.
sl: Bo prepisalo piškotek.
th: จะแทนที่คุกกี้
uk: Перезапише кукі.
ur: کوکی کو اوور رائیڈ کرے گا۔

source: No valid refresh token found.
az: Etibarlı yenilənmə tokeni tapilmadi.
bs: Nijedan valjan refresh token nije pronađen.
cs: Nebyl nalezen platný obnovovací token.
hu: Nem található érvényes frissítő token.
hy: Վավեր թարմացման նշան չի գտնվել:
is: Enginn gildur endurnýjunarlykill fannst.
it: Nessun token di aggiornamento valido trovato.
mr: कोणताही वैध रिफ्रेश टोकन सापडला नाही.
ne: कुनै वैध रिफ्रेश टोकन फेला परेन।
pl: Nie znaleziono ważnego tokenu odświeżania.
sl: Ni bilo najdenega veljavnega osveževalnega žetona.
th: ไม่พบ refresh token ที่ถูกต้อง
uk: Не знайдено дійсний токен оновлення.
ur: کوئی درست تجدید ٹوکن نہیں ملا۔

source: E-mail is not verified.
az: Email təsdiqlənməyib.
bs: E-mail nije ovjeren.
cs: E-mail není ověřen.
hu: Az e-mail cím nincs ellenőrizve.
hy: Էլ. փոստը հաստատված չէ:
is: Tölvupóstur er ekki staðfestur.
it: L'email non è verificata.
mr: ईमेल पुष्टी केलेला नाही.
ne: इमेल प्रमाणित छैन।
pl: E-mail nie jest zweryfikowany.
sl: E-pošta ni potrjena.
th: อีเมลไม่ได้รับการยืนยัน
uk: Електронна пошта не перевірена.
ur: ای میل کی تصدیق نہیں ہوئی۔

source: Unable to log in with provided credentials.
az: Təqdim edilmiş etimadnamilərlə daxil ola bilmir.
bs: Nije moguće prijaviti se sa pruženim kredencijalima.
cs: Nelze se přihlásit s poskytnutými přihlašovacími údaji.
hu: Nem sikerült bejelentkezni a megadott hitelesítő adatokkal.
hy: Հնարավոր չէ մուտք գործել տրամադրված իրավունքներով:
is: Getur ekki skráð inn með uppgefnum skilríkjum.
it: Impossibile accedere con le credenziali fornite.
mr: प्रदान केलेल्या क्रेडेंशियल्ससह लॉग इन करू शकत नाही.
ne: प्रदान गरिएका प्रमाणपत्रहरूसँग लगिन गर्न असमर्थ।
pl: Nie można zalogować się przy użyciu podanych danych uwierzytelniających.
sl: Ni se mogoče prijaviti z danimi poverilnicami.
th: ไม่สามารถเข้าสู่ระบบด้วยข้อมูลประจำตัวที่ให้มา
uk: Неможливо увійти з наданими обліковими даними.
ur: فراہم کردہ اسناد کے ساتھ لاگ ان نہیں ہو سکے۔

source: Invalid value
az: Yaramaz dəyər
bs: Nevažeća vrijednost
cs: Neplatná hodnota
hu: Érvénytelen érték
hy: Անվավեր արժեք
is: Ógilt gildi
it: Valore non valido
mr: अवैध मूल्य
ne: अवैध मान
pl: Nieprawidłowa wartość
sl: Neveljavna vrednost
th: ค่าไม่ถูกต้อง
uk: Недійсне значення
ur: غلط قیمت

source: Your old password was entered incorrectly. Please enter it again.
az: Köhnə parolunuz səhv daxil edilib. Zəhmət olmasa yenidən daxil edin.
bs: Vaša stara lozinka je pogrešno unesena. Molimo unesite je ponovo.
cs: Vaše staré heslo bylo zadáno nesprávně. Zadejte jej prosím znovu.
hu: A régi jelszó helytelenül lett megadva. Kérjük adja meg újra.
hy: Ձեր հին գաղտնաբառը սխալ է մուտքագրված: Խնդրում ենք նորից մուտքագրել:
is: Gamla lykilorðið þitt var slegið inn rangt. Vinsamlegast sláðu það inn aftur.
it: La tua vecchia password è stata inserita incorrettamente. Per favore inseriscila di nuovo.
mr: तुमचा जुना पासवर्ड चुकीचा एंटर केला होता. कृपया तो पुन्हा एंटर करा.
ne: तपाईंको पुरानो पासवर्ड गलत प्रविष्ट गरिएको छ। कृपया यसलाई फेरि प्रविष्ट गर्नुहोस्।
pl: Twoje stare hasło zostało wprowadzone nieprawidłowo. Proszę wprowadź je ponownie.
sl: Vaše staro geslo je bilo vnešeno napačno. Prosimo, vnesite ga ponovno.
th: รหัสผ่านเก่าของคุณถูกป้อนไม่ถูกต้อง โปรดป้อนอีกครั้ง
uk: Ваш старий пароль було введено неправильно. Будь ласка, введіть його знову.
ur: آپ کا پرانا پاس ورڈ غلط داخل کیا گیا۔ برائے کرم اسے دوبارہ داخل کریں۔

source: A user is already registered with this e-mail address.
az: Bu email ünvanı ilə artiq bir istifadəçi qeydiyyatdan keçib.
bs: Korisnik je već registrovan sa ovom e-mail adresom.
cs: Uživatel je již registrován s touto e-mailovou adresou.
hu: Ezzel az e-mail címmel már regisztrálva van egy felhasználó.
hy: Օգտատեր արդեն գրանցված է այս էլ. փոստի հասցեով:
is: Notandi er þegar skráður með þetta tölvupóstfang.
it: Un utente è già registrato con questo indirizzo email.
mr: या ईमेल पत्त्यासह युजर आधीच नोंदणीकृत आहे.
ne: यो इमेल ठेगानासँग प्रयोगकर्ता पहिले नै दर्ता भएको छ।
pl: Użytkownik z tym adresem e-mail jest już zarejestrowany.
sl: Uporabnik s tem e-poštnim naslovom je že registriran.
th: มีผู้ใช้ลงทะเบียนด้วยที่อยู่อีเมลนี้แล้ว
uk: Користувач вже зареєстрований з цією адресою електронної пошти.
ur: اس ای میل ایڈریس کے ساتھ ایک صارف پہلے سے رجسٹرڈ ہے۔

source: The two password fields didn't match.
az: İki parol sahəsi uyğun gəlmir.
bs: Dva polja za lozinku se ne poklapaju.
cs: Dvě pole hesel se neshodují.
hu: A két jelszó mező nem egyezik.
hy: Երկու գաղտնաբառի դաշտերը չեն համընկնում:
is: Lykilorðsreitirnir tveir stemma ekki.
it: I due campi password non corrispondono.
mr: दोन पासवर्ड फील्ड्स जुळत नाहीत.
ne: दुई पासवर्ड फिल्डहरू मेल खाएनन्।
pl: Dwa pola hasła nie pasują do siebie.
sl: Polji za geslo se ne ujemata.
th: ฟิลด์รหัสผ่านทั้งสองไม่ตรงกัน
uk: Два поля паролю не збігаються.
ur: دونوں پاس ورڈ کے خانے میں مماثلت نہیں۔
