Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.3.tar.gz/drf_auth_kit-1.1.3/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: az, bs, cs, hu, hy, is, it, mr, ne, pl, sl, th, uk, ur

source: Returns user details along with JWT access and refresh tokens with expiration times.
az: JWT giriş və yenilənmə tokenləri ilə birlikdə istifadəçi məlumatlarını qaytarır.
bs: Vraća korisničke podatke zajedno sa JWT pristupnim i refresh tokenima sa vremenima isteka.
cs: Vrací údaje o uživateli spolu s JWT přístupovými a obnovovacími tokeny s dobou vypršení.
hu: Visszaadja a felhasználói adatokat a JWT hozzáférési és frissítő tokenekkel, lejárati időkkel együtt.
hy: Վերադարձնում է օգտատիրոջ մանրամասները JWT մուտքի և թարմացման նշանների հետ միասին՝ ծանուցելով ավարտի ժամկետը:
is: Skilar notandaupplýsingum ásamt JWT aðgangs- og endurnýjunarlykla með gildistíma.
it: Restituisce i dettagli utente insieme ai token di accesso e aggiornamento JWT con tempi di scadenza.
mr: एक्सपायरी वेळेसह JWT एक्सेस आणि रिफ्रेश टोकन्ससह युजर तपशील परत करते.
ne: समाप्ति समयसहित JWT पहुँच र रिफ्रेश टोकनहरूको साथ प्रयोगकर्ता विवरणहरू फिर्ता गर्दछ।
pl: Zwraca szczegóły użytkownika wraz z tokenami dostępu i odświeżania JWT z czasami wygaśnięcia.
sl: Vrne podrobnosti uporabnika skupaj z JWT dostopnimi in osveževalnimi žetoni z času poteka.
th: ส่งคืนรายละเอียดผู้ใช้พร้อมกับ JWT access และ refresh token พร้อมเวลาหมดอายุ
uk: Повертає деталі користувача разом з JWT токенами доступу та оновлення з часом закінчення дії.
ur: صارف کی تفصیلات JWT رسائی اور تجدید ٹوکن کے ساتھ میعاد ختم ہونے کے اوقات کے ساتھ واپس کرتا ہے۔

source: Returns user details along with a DRF authentication token for API access.
az: API girişi üçün DRF autentifikasiya tokenləri ilə birlikdə istifadəçi məlumatlarını qaytarır.
bs: Vraća korisničke podatke zajedno sa DRF autentifikacionim tokenom za API pristup.
cs: Vrací údaje o uživateli spolu s DRF autentifikačním tokenem pro přístup k API.
hu: Visszaadja a felhasználói adatokat egy DRF hitelesítési tokennel az API hozzáféréshez.
hy: Վերադարձնում է օգտատիրոջ մանրամասները DRF նույնականացման նշանի հետ միասին API մուտքի համար:
is: Skilar notandaupplýsingum ásamt DRF auðkenningarlykla fyrir API aðgang.
it: Restituisce i dettagli utente insieme a un token di autenticazione DRF per l'accesso API.
mr: API एक्सेससाठी DRF ऑथेंटिकेशन टोकनसह युजर तपशील परत करते.
ne: API पहुँचको लागि DRF प्रमाणीकरण टोकनको साथ प्रयोगकर्ता विवरणहरू फिर्ता गर्दछ।
pl: Zwraca szczegóły użytkownika wraz z tokenem uwierzytelniania DRF do dostępu API.
sl: Vrne podrobnosti uporabnika skupaj z DRF avtentifikacijskim žetonom za dostop do API-ja.
th: ส่งคืนรายละเอียดผู้ใช้พร้อมกับ DRF authentication token สำหรับการเข้าถึง API
uk: Повертає деталі користувача разом з токеном автентифікації DRF для доступу до API.
ur: صارف کی تفصیلات DRF تصدیق ٹوکن کے ساتھ API رسائی کے لیے واپس کرتا ہے۔

source: Returns user details along with custom authentication tokens.
az: Xüsusi autentifikasiya tokenləri ilə birlikdə istifadəçi məlumatlarını qaytarır.
bs: Vraća korisničke podatke zajedno sa prilagođenim autentifikacionim tokenima.
cs: Vrací údaje o uživateli spolu s vlastními autentifikačními tokeny.
hu: Visszaadja a felhasználói adatokat egyéni hitelesítési tokenekkel együtt.
hy: Վերադարձնում է օգտատիրոջ մանրամասները անհատական նույնականացման նշանների հետ միասին:
is: Skilar notandaupplýsingum ásamt sérsniðnum auðkenningarlyklum.
it: Restituisce i dettagli utente insieme a token di autenticazione personalizzati.
mr: कस्टम ऑथेंटिकेशन टोकन्ससह युजर तपशील परत करते.
ne: कस्टम प्रमाणीकरण टोकनहरूको साथ प्रयोगकर्ता विवरणहरू फिर्ता गर्दछ।
pl: Zwraca szczegóły użytkownika wraz z niestandardowymi tokenami uwierzytelniania.
sl: Vrne podrobnosti uporabnika skupaj z zasebnimi avtentifikacijskimi žetoni.
th: ส่งคืนรายละเอียดผู้ใช้พร้อมกับ custom authentication token
uk: Повертає деталі користувача разом з користувацькими токенами автентифікації.
ur: صارف کی تفصیلات اپنی مرضی کے تصدیق ٹوکن کے ساتھ واپس کرتا ہے۔

source: JWT access and refresh tokens
az: JWT giriş və yenilənmə tokenləri
bs: JWT pristupni i refresh tokeni
cs: JWT přístupové a obnovovací tokeny
hu: JWT hozzáférési és frissítő tokenek
hy: JWT մուտքի և թարմացման նշաններ
is: JWT aðgangs- og endurnýjunarlyklar
it: Token di accesso e aggiornamento JWT
mr: JWT एक्सेस आणि रिफ्रेश टोकन्स
ne: JWT पहुँच र रिफ्रेश टोकनहरू
pl: Tokeny dostępu i odświeżania JWT
sl: JWT dostopni in osveževalni žetoni
th: JWT access และ refresh token
uk: JWT токени доступу та оновлення
ur: JWT رسائی اور تجدید ٹوکن

source: DRF authentication token
az: DRF autentifikasiya tokeni
bs: DRF autentifikacioni token
cs: DRF autentifikační token
hu: DRF hitelesítési token
hy: DRF նույնականացման նշան
is: DRF auðkenningarlykill
it: Token di autenticazione DRF
mr: DRF ऑथेंटिकेशन टोकन
ne: DRF प्रमाणीकरण टोकन
pl: Token uwierzytelniania DRF
sl: DRF avtentifikacijski žeton
uk: Токен автентифікації DRF
ur: DRF تصدیق ٹوکن

source: custom authentication tokens
az: xüsusi autentifikasiya tokenləri
bs: prilagođeni autentifikacioni tokeni
cs: vlastní autentifikační tokeny
hu: egyéni hitelesítési tokenek
hy: անհատական նույնականացման նշաններ
is: sérsniðnir auðkenningarlyklar
it: token di autenticazione personalizzati
mr: कस्टम ऑथेंटिकेशन टोकन्स
ne: कस्टम प्रमाणीकरण टोकनहरू
pl: niestandardowe tokeny uwierzytelniania
sl: zasebni avtentifikacijski žetoni
th: custom authentication token
uk: користувацькі токени автентифікації
ur: اپنی مرضی کے تصدیق ٹوکن

source: Authentication cookies are set automatically for secure token storage.
az: Autentifikasiya kukiləri təhlükəsiz token saxlaması üçün avtomatik olaraq təyin edilir.
bs: Autentifikacijski kolačići se automatski postavljaju za sigurno čuvanje tokena.
cs: Autentifikační cookies jsou automaticky nastaveny pro bezpečné ukládání tokenů.
hu: A hitelesítési sütik automatikusan beállításra kerülnek a biztonságos token tároláshoz.
hy: Նույնականացման cookie-ները ավտոմատ կերպով սահմանվում են նշանների ապահով պահպանման համար:
is: Auðkenningarvafur eru stillt sjálfkrafa fyrir örugga lyklageymslu.
it: I cookie di autenticazione vengono impostati automaticamente per l'archiviazione sicura dei token.
mr: सुरक्षित टोकन स्टोरेजसाठी ऑथेंटिकेशन कुकीज आपोआप सेट केल्या जातात.
ne: सुरक्षित टोकन भण्डारणको लागि प्रमाणीकरण कुकीहरू स्वतः सेट गरिन्छ।
pl: Pliki cookie uwierzytelniania są ustawiane automatycznie dla bezpiecznego przechowywania tokenów.
sl: Avtentifikacijski piškotki so samodejno nastavljeni za varno shranjevanje žetonov.
th: คุกกี้การรับรองความถูกต้องจะถูกตั้งค่าอัตโนมัติสำหรับการเก็บ token อย่างปลอดภัย
uk: Куки автентифікації встановлюються автоматично для безпечного зберігання токенів.
ur: تصدیق کوکیز محفوظ ٹوکن اسٹوریج کے لیے خودکار طور پر سیٹ ہوتی ہیں۔

source: Blacklists JWT refresh tokens to prevent further use.
az: Əlavə istifadəni qarşısını almaq üçün JWT yenilənmə tokenlərini qara siyahıya alır.
bs: Stavlja JWT refresh tokene na crnu listu da spriječi dalju upotrebu.
cs: Přidá JWT obnovovací tokeny na černou listinu, aby se zabránilo dalšímu použití.
hu: Feketelistára helyezi a JWT frissítő tokeneket a további használat megakadályozásához.
hy: Սև ցանկի է ավելացնում JWT թարմացման նշանները՝ հետագա օգտագործումը կանխելու համար:
is: Setur JWT endurnýjunarlykla á bannlista til að koma í veg fyrir frekari notkun.
it: Inserisce in blacklist i token di aggiornamento JWT per prevenire ulteriori utilizzi.
mr: पुढील वापर रोखण्यासाठी JWT रिफ्रेश टोकन्स ब्लॅकलिस्ट करते.
ne: थप प्रयोग रोक्नको लागि JWT रिफ्रेश टोकनहरूलाई ब्ल्याकलिस्ट गर्दछ।
pl: Dodaje tokeny odświeżania JWT do czarnej listy, aby zapobiec dalszemu użyciu.
sl: Uvrsti JWT osveževalne žetone na črni seznam za preprečevanje nadaljnje uporabe.
th: ใส่ JWT refresh token เข้าบัญชีดำเพื่อป้องกันการใช้งานต่อไป
uk: Заносить JWT токени оновлення в чорний список для запобігання подальшого використання.
ur: مزید استعمال کو روکنے کے لیے JWT تجدید ٹوکن کو بلیک لسٹ میں ڈالتا ہے۔

source: Deletes the DRF authentication token from the database.
az: DRF autentifikasiya tokenini verilənlər bazasından silir.
bs: Briše DRF autentifikacioni token iz baze podataka.
cs: Odstraní DRF autentifikační token z databáze.
hu: Törli a DRF hitelesítési tokent az adatbázisból.
hy: Ջնջում է DRF նույնականացման նշանը տվյալների բազայից:
is: Eyðir DRF auðkenningarlykla úr gagnagrunninum.
it: Elimina il token di autenticazione DRF dal database.
mr: डेटाबेसमधून DRF ऑथेंटिकेशन टोकन काढून टाकते.
ne: डेटाबेसबाट DRF प्रमाणीकरण टोकन मेटाउँदछ।
pl: Usuwa token uwierzytelniania DRF z bazy danych.
sl: Izbriše DRF avtentifikacijski žeton iz podatkovne baze.
th: ลบ DRF authentication token จากฐานข้อมูล
uk: Видаляє токен автентифікації DRF з бази даних.
ur: ڈیٹابیس سے DRF تصدیق ٹوکن کو ڈیلیٹ کرتا ہے۔

source: Invalidates custom authentication tokens.
az: Xüsusi autentifikasiya tokenlərini etibarsızlaşdırır.
bs: Poništava prilagođene autentifikacione tokene.
cs: Zneplatní vlastní autentifikační tokeny.
hu: Érvényteleníti az egyéni hitelesítési tokeneket.
hy: Անվավերացնում է անհատական նույնականացման նշանները:
is: Ógildir sérsniðna auðkenningarlykla.
it: Invalida i token di autenticazione personalizzati.
mr: कस्टम ऑथेंटिकेशन टोकन्स अवैध करते.
ne: कस्टम प्रमाणीकरण टोकनहरूलाई अवैध बनाउँदछ।
pl: Unieważnia niestandardowe tokeny uwierzytelniania.
sl: Razveljavi zasebne avtentifikacijske žetone.
th: ยกเลิกความถูกต้องของ custom authentication token
uk: Анулює користувацькі токени автентифікації.
ur: اپنی مرضی کے تصدیق ٹوکن کو غیر فعال کرتا ہے۔

source: Clears authentication cookies from the browser.
az: Brauzerdan autentifikasiya kukilərini təmizləyir.
bs: Briše autentifikacijske kolačiće iz preglednika.
cs: Vymaže autentifikační cookies z prohlížeče.
hu: Törli a hitelesítési sütiket a böngészőből.
hy: Մաքրում է նույնականացման cookie-ները զննարկչից:
is: Hreinsar auðkenningarvafur úr vafranum.
it: Cancella i cookie di autenticazione dal browser.
mr: ब्राउझरमधून ऑथेंटिकेशन कुकीज साफ करते.
ne: ब्राउजरबाट प्रमाणीकरण कुकीहरू खाली गर्दछ।
pl: Czyści pliki cookie uwierzytelniania z przeglądarki.
sl: Počisti avtentifikacijske piškotke iz brskalnika.
th: ล้างคุกกี้การรับรองความถูกต้องออกจากเบราว์เซอร์
uk: Очищає куки автентифікації з браузера.
ur: براؤزر سے تصدیق کوکیز کو صاف کرتا ہے۔

source: Authenticate with username/email and password to obtain access tokens.
az: Giriş tokenlərini əldə etmək üçün istifadəçi adı/email və parol ilə autentifikasiya edin.
bs: Autentificiraj se sa korisničkim imenom/emailom i lozinkom da dobiješ pristupne tokene.
cs: Autentifikace pomocí uživatelského jména/emailu a hesla k získání přístupových tokenů.
hu: Hitelesítés felhasználónévvel/e-mail címmel és jelszóval a hozzáférési tokenek megszerzéséhez.
hy: Նույնականացում օգտանունով/էլ. փոստով և գաղտնաբառով՝ մուտքի նշաններ ստանալու համար:
is: Auðkennið þig með notendanafni/tölvupósti og lykilorði til að fá aðgangslykla.
it: Autenticati con nome utente/email e password per ottenere token di accesso.
mr: एक्सेस टोकन्स मिळवण्यासाठी युजरनेम/ईमेल आणि पासवर्डसह ऑथेंटिकेट करा.
ne: पहुँच टोकनहरू प्राप्त गर्न प्रयोगकर्ता नाम/इमेल र पासवर्डको साथ प्रमाणीकरण गर्नुहोस्।
pl: Uwierzytelnij się nazwą użytkownika/e-mailem i hasłem, aby uzyskać tokeny dostępu.
sl: Avtentifikacija z uporabniškim imenom/e-pošto in geslom za pridobitev dostopnih žetonov.
th: รับรองความถูกต้องด้วยชื่อผู้ใช้/อีเมลและรหัสผ่านเพื่อรับ access token
uk: Автентифікуйтесь за допомогою імені користувача/електронної пошти та паролю для отримання токенів доступу.
ur: رسائی ٹوکن حاصل کرنے کے لیے صارف نام/ای میل اور پاس ورڈ کے ساتھ تصدیق کریں۔

source: Logout user and invalidate authentication tokens.
az: İstifadəçini çıxarış edin və autentifikasiya tokenlərini etibarsızlaşdırın.
bs: Odjavi korisnika i poništi autentifikacione tokene.
cs: Odhlásí uživatele a zneplatní autentifikační tokeny.
hu: Felhasználó kijelentkeztetése és hitelesítési tokenek érvénytelenítése.
hy: Ելք օգտատիրոջ համար և նույնականացման նշանների անվավերացում:
is: Skrá notanda út og ógilda auðkenningarlykla.
it: Disconnetti utente e invalida i token di autenticazione.
mr: युजर लॉगआउट करा आणि ऑथेंटिकेशन टोकन्स अवैध करा.
ne: प्रयोगकर्तालाई लगआउट गर्नुहोस् र प्रमाणीकरण टोकनहरू अवैध बनाउनुहोस्।
pl: Wyloguj użytkownika i unieważnij tokeny uwierzytelniania.
sl: Odjavi uporabnika in razveljavi avtentifikacijske žetone.
th: ออกจากระบบและยกเลิกความถูกต้องของ authentication token
uk: Вийти з облікового запису користувача та анулювати токени автентифікації.
ur: صارف کو لاگ آؤٹ کریں اور تصدیق ٹوکن کو غیر فعال کریں۔

source: Requires authentication to ensure only valid sessions can be logged out.
az: Yalnız etibarlı sessiyaların çıxarışa bilməsini təmin etmək üçün autentifikasiya tələb olunur.
bs: Zahtijeva autentifikaciju da osigura da se mogu odjaviti samo valjane sesije.
cs: Vyžaduje autentifikaci k zajištění, že pouze platné relace mohou být odhlášeny.
hu: Hitelesítést igényel, hogy csak érvényes munkamenetek legyenek kijelentkeztethetők.
hy: Պահանջում է նույնականացում՝ ապահովելու, որ միայն վավեր նստակները կարող են ելքագրվել:
is: Krefst auðkenningar til að tryggja að aðeins gild lota geti verið skráð út.
it: Richiede autenticazione per assicurare che solo le sessioni valide possano essere disconnesse.
mr: फक्त वैध सेशन्स लॉगआउट करता येतील हे सुनिश्चित करण्यासाठी ऑथेंटिकेशन आवश्यक आहे.
ne: केवल वैध सत्रहरू लगआउट गर्न सकिने सुनिश्चित गर्न प्रमाणीकरण आवश्यक छ।
pl: Wymaga uwierzytelnienia, aby zapewnić, że tylko ważne sesje mogą zostać wylogowane.
sl: Zahteva avtentifikacijo za zagotovitev, da se lahko odjavijo le veljavne seje.
th: ต้องการการรับรองความถูกต้องเพื่อให้แน่ใจว่าเฉพาะเซสชันที่ถูกต้องเท่านั้นที่สามารถออกจากระบบได้
uk: Потребує автентифікації для забезпечення того, щоб тільки дійсні сесії могли бути завершені.
ur: تصدیق کی ضرورت ہے تاکہ صرف درست سیشن کو لاگ آؤٹ کیا جا سکے۔

source: Generate new JWT access tokens using refresh tokens.
az: Yenilənmə tokenlərindən istifadə edərək yeni JWT giriş tokenləri yaradın.
bs: Generiraj nove JWT pristupne tokene koristeći refresh tokene.
cs: Generuje nové JWT přístupové tokeny pomocí obnovovacích tokenů.
hu: Új JWT hozzáférési tokenek generálása frissítő tokenek használatával.
hy: Ստեղծում է նոր JWT մուտքի նշաններ թարմացման նշանների միջոցով:
is: Búa til nýja JWT aðgangslykla með endurnýjunarlyklum.
it: Genera nuovi token di accesso JWT utilizzando i token di aggiornamento.
mr: रिफ्रेश टोकन्स वापरून नवीन JWT एक्सेस टोकन्स तयार करा.
ne: रिफ्रेश टोकनहरू प्रयोग गरेर नयाँ JWT पहुँच टोकनहरू उत्पन्न गर्नुहोस्।
pl: Generuj nowe tokeny dostępu JWT przy użyciu tokenów odświeżania.
sl: Ustvari nove JWT dostopne žetone z uporabo osveževalnih žetonov.
th: สร้าง JWT access token ใหม่โดยใช้ refresh token
uk: Генерує нові JWT токени доступу за допомогою токенів оновлення.
ur: تجدید ٹوکن کا استعمال کرتے ہوئے نئے JWT رسائی ٹوکن پیدا کریں۔

source: Refresh tokens can be provided in request data or extracted automatically from HTTP cookies.
az: Yenilənmə tokenləri sorğu məlumatlarında verilə bilər və ya HTTP kukilərindən avtomatik olaraq çıxarıla bilər.
bs: Refresh tokeni se mogu pružiti u podacima zahtjeva ili se automatski mogu izdvojiti iz HTTP kolačića.
cs: Obnovovací tokeny mohou být poskytnuty v datech požadavku nebo automaticky extrahovány z HTTP cookies.
hu: A frissítő tokenek megadhatók a kérés adataiban vagy automatikusan kinyerhetők a HTTP sütiből.
hy: Թարմացման նշանները կարող են տրամադրվել հարցման տվյալներում կամ ավտոմատ կերպով բաժանված HTTP cookie-ներից:
is: Endurnýjunarlyklar geta verið gefnir í beiðnigögnum eða þeir geta verið dregnir sjálfkrafa úr HTTP vöfrum.
it: I token di aggiornamento possono essere forniti nei dati della richiesta o estratti automaticamente dai cookie HTTP.
mr: रिफ्रेश टोकन्स रिक्वेस्ट डेटामध्ये प्रदान केले जाऊ शकतात किंवा HTTP कुकीजमधून आपोआप काढले जाऊ शकतात.
ne: रिफ्रेश टोकनहरू अनुरोध डेटामा प्रदान गर्न सकिन्छ वा HTTP कुकीहरूबाट स्वतः निकाल्न सकिन्छ।
pl: Tokeny odświeżania mogą być dostarczane w danych żądania lub automatycznie wyodrębniane z plików cookie HTTP.
sl: Osveževalni žetoni se lahko zagotovijo v podatkih zahteve ali samodejno izvlečejo iz HTTP piškotkov.
th: Refresh token สามารถระบุในข้อมูลคำขอหรือดึงออกมาอัตโนมัติจาก HTTP cookie
uk: Токени оновлення можуть бути надані в даних запиту або автоматично витягнуті з HTTP куків.
ur: تجدید ٹوکن درخواست کے ڈیٹا میں فراہم کیے جا سکتے ہیں یا HTTP کوکیز سے خودکار طور پر نکالے جا سکتے ہیں۔

source: Returns new access tokens with updated expiration times.
az: Yenilənmiş bitmə vaxtları ilə yeni giriş tokenlərini qaytarır.
bs: Vraća nove pristupne tokene sa ažuriranim vremenima isteka.
cs: Vrací nové přístupové tokeny s aktualizovanými dobami vypršení.
hu: Visszaadja az új hozzáférési tokeneket frissített lejárati időkkel.
hy: Վերադարձնում է նոր մուտքի նշաններ թարմացված ավարտի ժամկետներով:
is: Skilar nýjum aðgangslyklum með uppfærðum gildistíma.
it: Restituisce nuovi token di accesso con tempi di scadenza aggiornati.
mr: अपडेटेड एक्सपायरी वेळेसह नवीन एक्सेस टोकन्स परत करते.
ne: अपडेट गरिएको समाप्ति समयको साथ नयाँ पहुँच टोकनहरू फिर्ता गर्दछ।
pl: Zwraca nowe tokeny dostępu z zaktualizowanymi czasami wygaśnięcia.
sl: Vrne nove dostopne žetone z posodobljenimi časi poteka.
th: ส่งคืน access token ใหม่พร้อมเวลาหมดอายุที่อัปเดตแล้ว
uk: Повертає нові токени доступу з оновленим часом закінчення дії.
ur: تازہ کاری شدہ میعاد ختم ہونے کے اوقات کے ساتھ نئے رسائی ٹوکن واپس کرتا ہے۔

source: New tokens are automatically set in HTTP cookies for secure storage.
az: Yeni tokenlər təhlükəsiz saxlama üçün HTTP kukilərində avtomatik olaraq təyin edilir.
bs: Novi tokeni se automatski postavljaju u HTTP kolačiće za sigurno čuvanje.
cs: Nové tokeny jsou automaticky nastaveny v HTTP cookies pro bezpečné uložení.
hu: Az új tokenek automatikusan beállításra kerülnek a HTTP sütiekben a biztonságos tároláshoz.
hy: Նոր նշանները ավտոմատ կերպով սահմանվում են HTTP cookie-ներում ապահով պահպանման համար:
is: Nýir lyklar eru sjálfkrafa settir í HTTP vafur fyrir örugga geymslu.
it: I nuovi token vengono impostati automaticamente nei cookie HTTP per l'archiviazione sicura.
mr: सुरक्षित स्टोरेजसाठी नवीन टोकन्स HTTP कुकीजमध्ये आपोआप सेट केले जातात.
ne: सुरक्षित भण्डारणको लागि नयाँ टोकनहरू HTTP कुकीहरूमा स्वतः सेट गरिन्छ।
pl: Nowe tokeny są automatycznie ustawiane w plikach cookie HTTP dla bezpiecznego przechowywania.
sl: Novi žetoni so samodejno nastavljeni v HTTP piškotkih za varno shranjevanje.
th: Token ใหม่จะถูกตั้งค่าอัตโนมัติใน HTTP cookie สำหรับการเก็บข้อมูลที่ปลอดภัย
uk: Нові токени автоматично встановлюються в HTTP куки для безпечного зберігання.
ur: محفوظ اسٹوریج کے لیے نئے ٹوکن خودکار طور پر HTTP کوکیز میں سیٹ ہوتے ہیں۔

source: Refresh tokens must be provided in the request data.
az: Yenilənmə tokenləri sorğu məlumatlarında verilməlidir.
bs: Refresh tokeni moraju biti pruženi u podacima zahtjeva.
cs: Obnovovací tokeny musí být poskytnuty v datech požadavku.
hu: A frissítő tokeneket a kérés adataiban kell megadni.
hy: Թարմացման նշանները պետք է տրամադրվեն հարցման տվյալներում:
is: Endurnýjunarlyklar verða að vera gefnir í beiðnigögnunum.
it: I token di aggiornamento devono essere forniti nei dati della richiesta.
mr: रिफ्रेश टोकन्स रिक्वेस्ट डेटामध्ये प्रदान करणे आवश्यक आहे.
ne: रिफ्रेश टोकनहरू अनुरोध डेटामा प्रदान गर्नुपर्छ।
pl: Tokeny odświeżania muszą być dostarczone w danych żądania.
sl: Osveževalni žetoni morajo biti zagotovljeni v podatkih zahteve.
th: ต้องระบุ refresh token ในข้อมูลคำขอ
uk: Токени оновлення повинні бути надані в даних запиту.
ur: تجدید ٹوکن درخواست کے ڈیٹا میں فراہم کیے جانے چاہیے۔

source: Register a new user account.
az: Yeni istifadəçi hesabı qeydiyyatdan keçirin.
bs: Registruj novi korisnički račun.
cs: Registruje nový uživatelský účet.
hu: Új felhasználói fiók regisztrálása.
hy: Գրանցել նոր օգտատիրոջ հաշիվ:
is: Skrá nýjan notandareikning.
it: Registra un nuovo account utente.
mr: नवीन युजर खाते नोंदणी करा.
ne: नयाँ प्रयोगकर्ता खाता दर्ता गर्नुहोस्।
pl: Zarejestruj nowe konto użytkownika.
sl: Registrira nov uporabniški račun.
th: ลงทะเบียนบัญชีผู้ใช้ใหม่
uk: Зареєструвати новий обліковий запис користувача.
ur: نیا صارف اکاؤنٹ رجسٹر کریں۔

source: Users must verify their email address before the account is fully activated.
az: İstifadəçilər hesabın tam aktivləşdirilməsindən əvvəl email ünvanlarını təsdiq etməlidirlər.
bs: Korisnici moraju potvrditi svoju email adresu prije nego što se račun potpuno aktivira.
cs: Uživatelé musí ověřit svou emailovou adresu před tím, než bude účet plně aktivován.
hu: A felhasználóknak igazolniuk kell az e-mail címüket, mielőtt a fiók teljesen aktiválódik.
hy: Օգտատերերը պետք է հաստատեն իրենց էլ. փոստի հասցեն՝ մինչև հաշիվը ամբողջությամբ ակտիվացվի:
is: Notendur verða að staðfesta tölvupóstfang sitt áður en reikningurinn er fullkomlega virkjaður.
it: Gli utenti devono verificare il proprio indirizzo email prima che l'account sia completamente attivato.
mr: खाते पूर्णपणे सक्रिय होण्यापूर्वी युजरने त्यांचा ईमेल पत्ता पुष्टी करणे आवश्यक आहे.
ne: खाता पूर्ण रूपमा सक्रिय हुनु अघि प्रयोगकर्ताहरूले आफ्नो इमेल ठेगाना प्रमाणित गर्नुपर्छ।
pl: Użytkownicy muszą zweryfikować swój adres e-mail przed pełną aktywacją konta.
sl: Uporabniki morajo potrditi svoj e-poštni naslov preden je račun popolnoma aktiviran.
th: ผู้ใช้ต้องยืนยันที่อยู่อีเมลของพวกเขาก่อนที่บัญชีจะถูกเปิดใช้งานอย่างสมบูรณ์
uk: Користувачі повинні підтвердити свою адресу електронної пошти перед повною активацією облікового запису.
ur: اکاؤنٹ مکمل طور پر فعال ہونے سے پہلے صارفین کو اپنا ای میل ایڈریس تصدیق کرنا ضروری ہے۔
