Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.3.tar.gz/drf_auth_kit-1.1.3/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: az, bs, cs, hu, hy, is, it, mr, ne, pl, sl, th, uk, ur

source: Returns ephemeral token for MFA verification or complete {} if MFA is disabled.
az: MFA təsdiqi üçün müvəqqəti token və ya MFA deaktivdirsə tam {} qaytarır.
bs: Vraća privremeni token za MFA verifikaciju ili kompletne {} ako je MFA onemogućen.
cs: Vrací dočasný token pro MFA ověření nebo kompletní {}, pokud je MFA zakázána.
hu: Ideiglenes tokent ad vissza az MFA ellenőrzéshez, vagy teljes {}-t, ha az MFA le van tiltva.
hy: Վերադարձնում է ժամանակավոր նշան MFA ստուգման համար կամ ամբողջական {}, եթե MFA-ն անջատված է:
is: Skilar tímabundnum lykli fyrir MFA staðfestingu eða fullkomnum {} ef MFA er óvirkt.
it: Restituisce token effimero per la verifica MFA o {} completi se MFA è disabilitato.
mr: MFA वेरिफिकेशनसाठी इफेमरल टोकन परत करते किंवा MFA अक्षम असल्यास पूर्ण {}.
ne: MFA प्रमाणीकरणको लागि अस्थायी टोकन फिर्ता गर्दछ वा MFA निष्क्रिय भएमा पूर्ण {}।
pl: Zwraca token tymczasowy do weryfikacji MFA lub kompletne {}, jeśli MFA jest wyłączone.
sl: Vrne začasni žeton za MFA verifikacijo ali popolne {} če je MFA onemogočena.
th: ส่งคืน ephemeral token สำหรับการยืนยัน MFA หรือ {} ที่สมบูรณ์หาก MFA ถูกปิดใช้งาน
uk: Повертає тимчасовий токен для перевірки MFA або повний {}, якщо MFA вимкнено.
ur: MFA تصدیق کے لیے عارضی ٹوکن واپس کرتا ہے یا اگر MFA غیر فعال ہے تو مکمل {}۔

source: Complete MFA authentication using verification code and ephemeral token.
az: Təsdiq kodu və müvəqqəti token istifadə edərək MFA autentifikasiyasını tamamlayın.
bs: Završi MFA autentifikaciju koristeći verifikacioni kod i privremeni token.
cs: Dokončí MFA autentifikaci pomocí verifikačního kódu a dočasného tokenu.
hu: Az MFA hitelesítés befejezése ellenőrző kóddal és ideiglenes tokennel.
hy: Ավարտել MFA նույնականացումը հաստատման ծածկագրի և ժամանակավոր նշանի օգտագործմամբ:
is: Ljúka MFA auðkenningu með staðfestingarkóða og tímabundnum lykli.
it: Completa l'autenticazione MFA utilizzando il codice di verifica e il token effimero.
mr: वेरिफिकेशन कोड आणि इफेमरल टोकन वापरून MFA ऑथेंटिकेशन पूर्ण करा.
ne: प्रमाणीकरण कोड र अस्थायी टोकन प्रयोग गरेर MFA प्रमाणीकरण पूरा गर्नुहोस्।
pl: Zakończ uwierzytelnianie MFA przy użyciu kodu weryfikacyjnego i tokenu tymczasowego.
sl: Dokonča MFA avtentifikacijo z uporabo verifikacijske kode in začasnega žetona.
th: ดำเนินการรับรองความถูกต้อง MFA ให้เสร็จสิ้นโดยใช้รหัสยืนยันและ ephemeral token
uk: Завершити автентифікацію MFA за допомогою коду перевірки та тимчасового токена.
ur: تصدیقی کوڈ اور عارضی ٹوکن کا استعمال کرتے ہوئے MFA تصدیق مکمل کریں۔

source: Supports both TOTP codes and backup codes for verification.
az: Təsdiq üçün həm TOTP kodları, həm də ehtiyati kodları dəstəkləyir.
bs: Podržava i TOTP kodove i rezervne kodove za verifikaciju.
cs: Podporuje jak TOTP kódy, tak záložní kódy pro ověření.
hu: Mind a TOTP kódokat, mind a biztonsági mentés kódokat támogatja az ellenőrzéshez.
hy: Աջակցում է և՛ TOTP ծածկագրերին, և՛ պահեստային ծածկագրերին հաստատման համար:
is: Styður bæði TOTP kóða og varakóða til staðfestingar.
it: Supporta sia i codici TOTP che i codici di backup per la verifica.
mr: वेरिफिकेशनसाठी TOTP कोड आणि बॅकअप कोड दोन्हीला समर्थन देते.
ne: प्रमाणीकरणको लागि TOTP कोडहरू र ब्याकअप कोडहरू दुवैलाई समर्थन गर्दछ।
pl: Obsługuje zarówno kody TOTP, jak i kody zapasowe do weryfikacji.
sl: Podpira TOTP kode in rezervne kode za verifikacijo.
th: รองรับทั้งรหัส TOTP และรหัสสำรองสำหรับการยืนยัน
uk: Підтримує як TOTP коди, так і резервні коди для перевірки.
ur: تصدیق کے لیے TOTP کوڈز اور بیک اپ کوڈز دونوں کو سپورٹ کرتا ہے۔

source: Switch to a different MFA method during authentication flow.
az: Autentifikasiya axını zamanı fərqli MFA metoduna keçin.
bs: Prebacite se na drugu MFA metodu tokom toka autentifikacije.
cs: Přepne na jinou MFA metodu během autentifikačního procesu.
hu: Váltás másik MFA módszerre a hitelesítési folyamat során.
hy: Անցնել այլ MFA մեթոդի նույնականացման հոսքի ժամանակ:
is: Skipta yfir í aðra MFA aðferð meðan á auðkenningarflæði stendur.
it: Passa a un metodo MFA diverso durante il flusso di autenticazione.
mr: ऑथेंटिकेशन फ्लो दरम्यान वेगळ्या MFA पद्धतीवर स्विच करा.
ne: प्रमाणीकरण प्रवाहको दौरान फरक MFA विधिमा स्विच गर्नुहोस्।
pl: Przełącz na inną metodę MFA podczas przepływu uwierzytelniania.
sl: Preklopi na drugo MFA metodo med avtentifikacijskim tokom.
th: เปลี่ยนเป็นวิธี MFA อื่นในระหว่างขั้นตอนการรับรองความถูกต้อง
uk: Переключитися на інший метод MFA під час потоку автентифікації.
ur: تصدیق کے دوران مختلف MFA طریقے پر سوئچ کریں۔

source: Requires valid ephemeral token from first step authentication.
az: İlk addım autentifikasiyasından etibarlı müvəqqəti token tələb edir.
bs: Zahtijeva valjan privremeni token iz autentifikacije prvog koraka.
cs: Vyžaduje platný dočasný token z prvního kroku autentifikace.
hu: Érvényes ideiglenes tokent igényel az első lépéses hitelesítésből.
hy: Պահանջում է վավեր ժամանակավոր նշան առաջին քայլի նույնականացումից:
is: Krefst gildur tímabundins lykils frá fyrsta skref auðkenningar.
it: Richiede un token effimero valido dal primo passo di autenticazione.
mr: पहिल्या पायरीच्या ऑथेंटिकेशनमधील वैध इफेमरल टोकन आवश्यक आहे.
ne: पहिलो चरण प्रमाणीकरणबाट वैध अस्थायी टोकन आवश्यक छ।
pl: Wymaga ważnego tokenu tymczasowego z pierwszego kroku uwierzytelniania.
sl: Zahteva veljaven začasni žeton iz prvega koraka avtentifikacije.
th: ต้องใช้ ephemeral token ที่ถูกต้องจากการรับรองความถูกต้องขั้นตอนแรก
uk: Потребує дійсний тимчасовий токен з першого кроку автентифікації.
ur: پہلے قدم کی تصدیق سے درست عارضی ٹوکن کی ضرورت ہے۔

source: New ephemeral token expires in {} seconds.
az: Yeni müvəqqəti token {} saniyədə bitəcək.
bs: Novi privremeni token istječe za {} sekundi.
cs: Nový dočasný token vyprší za {} sekund.
hu: Az új ideiglenes token {} másodperc múlva lejár.
hy: Նոր ժամանակավոր նշանը կավարտվի {} վայրկյանից:
is: Nýr tímabundinn lykill rennur út eftir {} sekúndur.
it: Il nuovo token effimero scade tra {} secondi.
mr: नवीन इफेमरल टोकन {} सेकंदांत कालबाह्य होतो.
ne: नयाँ अस्थायी टोकन {} सेकेन्डमा समाप्त हुन्छ।
pl: Nowy token tymczasowy wygasa za {} sekund.
sl: Nov začasni žeton poteče v {} sekundah.
th: ephemeral token ใหม่จะหมดอายุใน {} วินาที
uk: Новий тимчасовий токен закінчується через {} секунд.
ur: نیا عارضی ٹوکن {} سیکنڈ میں ختم ہو جاتا ہے۔

source: Resend MFA verification code using existing ephemeral token.
az: Mövcud müvəqqəti token istifadə edərək MFA təsdiq kodunu yenidən göndər.
bs: Ponovno pošaljite MFA verifikacioni kod koristeći postojeći privremeni token.
cs: Znovu odešle MFA verifikační kód pomocí existujícího dočasného tokenu.
hu: MFA ellenőrző kód újraküldése a meglévő ideiglenes token használatával.
hy: Վերուղարկել MFA հաստատման ծածկագիրը գոյություն ունեցող ժամանակավոր նշանի օգտագործմամբ:
is: Senda MFA staðfestingarkóða aftur með núverandi tímabundnum lykli.
it: Invia nuovamente il codice di verifica MFA utilizzando il token effimero esistente.
mr: विद्यमान इफेमरल टोकन वापरून MFA वेरिफिकेशन कोड पुन्हा पाठवा.
ne: अवस्थित अस्थायी टोकन प्रयोग गरेर MFA प्रमाणीकरण कोड पुनः पठाउनुहोस्।
pl: Wyślij ponownie kod weryfikacji MFA przy użyciu istniejącego tokenu tymczasowego.
sl: Ponovno pošlje MFA verifikacijsko kodo z uporabo obstoječega začasnega žetona.
th: ส่งรหัสยืนยัน MFA อีกครั้งโดยใช้ ephemeral token ที่มีอยู่
uk: Повторно надіслати код перевірки MFA за допомогою існуючого тимчасового токена.
ur: موجودہ عارضی ٹوکن کا استعمال کرتے ہوئے MFA تصدیقی کوڈ دوبارہ بھیجیں۔

source: Only applicable for methods that require code dispatch (e.g., email).
az: Yalnız kod göndərmə tələb edən metodlar üçün tətbiq olunur (məs. email).
bs: Primjenjuje se samo za metode koje zahtijevaju slanje koda (npr. email).
cs: Platí pouze pro metody, které vyžadují odeslání kódu (např. email).
hu: Csak olyan módszerekre alkalmazható, amelyek kódküldést igényelnek (pl. e-mail).
hy: Կիրառելի է միայն մեթոդների համար, որոնք պահանջում են ծածկագրի առաքում (օր.՝ էլ. փոստ):
is: Á aðeins við um aðferðir sem krefjast kóðasendingar (t.d. tölvupóstur).
it: Applicabile solo per metodi che richiedono l'invio di codici (ad es., email).
mr: फक्त कोड पाठवण्याची आवश्यकता असलेल्या पद्धतींसाठी लागू (उदा. ईमेल).
ne: केवल कोड पठाउने आवश्यक पर्ने विधिहरूको लागि लागू (जस्तै, इमेल)।
pl: Dotyczy tylko metod wymagających wysyłania kodu (np. e-mail).
sl: Velja samo za metode, ki zahtevajo pošiljanje kod (npr. e-pošta).
th: ใช้ได้เฉพาะกับวิธีที่ต้องการการส่งรหัส (เช่น อีเมล)
uk: Застосовується лише для методів, які потребують відправки коду (наприклад, електронна пошта).
ur: صرف ان طریقوں کے لیے قابل اطلاق ہے جن میں کوڈ بھیجنا ضروری ہے (جیسے ای میل)۔

source: List all available MFA methods with their setup and activation status. Shows which methods are configured, active, and set as primary.
az: Quraşdırma və aktivləşdirmə statusu ilə bütün mövcud MFA metodlarını siyahıla. Hansı metodların konfiqurasiya edildiyini, aktiv olduğunu və əsas olaraq təyin edildiyini göstərir.
bs: Nabroji sve dostupne MFA metode sa njihovim statusom podešavanja i aktivacije. Prikazuje koje metode su konfigurisane, aktivne i postavljene kao primarne.
cs: Vypíše všechny dostupné MFA metody s jejich stavem nastavení a aktivace. Zobrazuje, které metody jsou nakonfigurovány, aktivní a nastaveny jako primární.
hu: Az összes elérhető MFA módszer felsorolása a beállítási és aktiválási állapotukkal. Megmutatja, hogy mely módszerek vannak konfigurálva, aktiválva és elsődlegesként beállítva.
hy: Ցուցակել բոլոր հասանելի MFA մեթոդները նրանց կարգավորման և ակտիվացման կարգավիճակով: Ցույց է տալիս, թե որ մեթոդներն են կարգավորված, ակտիվ և սահմանված որպես առաջնային:
is: Sýna allar tiltækar MFA aðferðir með uppsetningu þeirra og virkjunarstöðu. Sýnir hvaða aðferðir eru stilltar, virkar og settar sem aðalaðferð.
it: Elenca tutti i metodi MFA disponibili con il loro stato di configurazione e attivazione. Mostra quali metodi sono configurati, attivi e impostati come primari.
mr: त्यांच्या सेटअप आणि सक्रियता स्थितीसह सर्व उपलब्ध MFA पद्धतींची यादी करा. कोणत्या पद्धती कॉन्फिगर केल्या, सक्रिय आणि प्राथमिक म्हणून सेट केल्या आहेत हे दाखवते.
ne: तिनीहरूको सेटअप र सक्रियता स्थितिसहित सबै उपलब्ध MFA विधिहरूको सूची। कुन विधिहरू कन्फिगर गरिएका, सक्रिय, र प्राथमिक रूपमा सेट गरिएका छन् देखाउँदछ।
pl: Wyświetl wszystkie dostępne metody MFA z ich statusem konfiguracji i aktywacji. Pokazuje które metody są skonfigurowane, aktywne i ustawione jako główne.
sl: Prikaže vse dostopne MFA metode z njihovim stanjem nastavitve in aktivacije. Prikazuje, katere metode so konfigurirane, aktivne in nastavljene kot primarne.
th: แสดงรายการวิธี MFA ที่มีทั้งหมดพร้อมสถานะการตั้งค่าและการเปิดใช้งาน แสดงว่าวิธีใดได้รับการกำหนดค่า เปิดใช้งาน และตั้งเป็นหลัก
uk: Перелічити всі доступні методи MFA з їх статусом налаштування та активації. Показує, які методи налаштовані, активні та встановлені як основні.
ur: تمام دستیاب MFA طریقوں کو ان کی سیٹ اپ اور فعالیت کی حالت کے ساتھ فہرست کریں۔ دکھاتا ہے کہ کون سے طریقے ترتیب دیے گئے ہیں، فعال ہیں اور بنیادی طور پر سیٹ کیے گئے ہیں۔

source: Initialize a new MFA method setup. Creates the method with backup codes and returns setup instructions (e.g., QR code for authenticator apps). Method must be confirmed before activation.
az: Yeni MFA metodu quraşdırmasını başlat. Ehtiyati kodlar ilə metod yaradır və quraşdırma təlimatları qaytarır (məs. autentifikator tətbiqləri üçün QR kod). Metod aktivləşdirilmədən əvvəl təsdiq edilməlidir.
bs: Inicijalizuj podešavanje nove MFA metode. Kreira metodu sa rezervnim kodovima i vraća instrukcije za podešavanje (npr. QR kod za autentifikatorske aplikacije). Metoda mora biti potvrđena prije aktivacije.
cs: Inicializuje nastavení nové MFA metody. Vytvoří metodu se záložními kódy a vrátí instrukce k nastavení (např. QR kód pro autentifikační aplikace). Metoda musí být potvrzena před aktivací.
hu: Új MFA módszer beállításának kezdeményezése. Létrehozza a módszert biztonsági mentés kódokkal és visszaadja a beállítási utasításokat (pl. QR kód az authenticator alkalmazásokhoz). A módszert megerősíteni kell az aktiválás előtt.
hy: Նախաձեռնել նոր MFA մեթոդի կարգավորում: Ստեղծում է մեթոդը պահեստային ծածկագրերով և վերադարձնում է կարգավորման հրահանգներ (օր.՝ QR կոդ նույնականացուցիչ հավելվածների համար): Մեթոդը պետք է հաստատվի ակտիվացումից առաջ:
is: Hefja uppsetningu nýrrar MFA aðferðar. Býr til aðferðina með varakóðum og skilar uppsetningarleiðbeiningum (t.d. QR kóða fyrir auðkenningarforrit). Aðferðin verður að vera staðfest áður en hún er virkjuð.
it: Inizializza la configurazione di un nuovo metodo MFA. Crea il metodo con codici di backup e restituisce istruzioni di configurazione (ad es., codice QR per app autenticatore). Il metodo deve essere confermato prima dell'attivazione.
mr: नवीन MFA पद्धत सेटअप सुरू करा. बॅकअप कोड्ससह पद्धत तयार करते आणि सेटअप सूचना परत करते (उदा. ऑथेंटिकेटर अॅप्ससाठी QR कोड). सक्रिय करण्यापूर्वी पद्धत पुष्टी करणे आवश्यक आहे.
ne: नयाँ MFA विधि सेटअप सुरु गर्नुहोस्। ब्याकअप कोडहरूसहित विधि सिर्जना गर्दछ र सेटअप निर्देशनहरू फिर्ता गर्दछ (जस्तै, प्रमाणीकरण एपहरूको लागि QR कोड)। सक्रियता अघि विधि पुष्टि गर्नुपर्छ।
pl: Zainicjuj konfigurację nowej metody MFA. Tworzy metodę z kodami zapasowymi i zwraca instrukcje konfiguracji (np. kod QR dla aplikacji uwierzytelniających). Metoda musi być potwierdzona przed aktywacją.
sl: Inicializira nastavitev nove MFA metode. Ustvari metodo z rezervnimi kodami in vrne navodila za nastavitev (npr. QR koda za avtentifikatorske aplikacije). Metoda mora biti potrjena pred aktivacijo.
th: เริ่มต้นการตั้งค่าวิธี MFA ใหม่ สร้างวิธีพร้อมรหัสสำรองและส่งคืนคำแนะนำการตั้งค่า (เช่น QR code สำหรับแอป authenticator) วิธีต้องได้รับการยืนยันก่อนเปิดใช้งาน
uk: Ініціалізувати налаштування нового методу MFA. Створює метод з резервними кодами та повертає інструкції з налаштування (наприклад, QR-код для додатків автентифікатора). Метод повинен бути підтверджений перед активацією.
ur: نیا MFA طریقہ سیٹ اپ کا آغاز کریں۔ بیک اپ کوڈز کے ساتھ طریقہ بناتا ہے اور سیٹ اپ کی ہدایات واپس کرتا ہے (جیسے تصدیق کار ایپس کے لیے QR کوڈ)۔ فعال کرنے سے پہلے طریقے کی تصدیق ضروری ہے۔

source: Confirm and activate a newly created MFA method using verification code. Automatically sets as primary method if no other primary method exists. Required before the method can be used for authentication.
az: Təsdiq kodu istifadə edərək yeni yaradılmış MFA metodunu təsdiq edin və aktivləşdirin. Başqa əsas metod yoxdursa avtomatik olaraq əsas metod olaraq təyin edilir. Metod autentifikasiya üçün istifadə edilməzdən əvvəl tələb olunur.
bs: Potvrdi i aktiviraj novostvorenu MFA metodu koristeći verifikacioni kod. Automatski postavlja kao primarnu metodu ako ne postoji druga primarna metoda. Potrebno prije nego što se metoda može koristiti za autentifikaciju.
cs: Potvrdí a aktivuje nově vytvořenou MFA metodu pomocí verifikačního kódu. Automaticky nastaví jako primární metodu, pokud neexistuje jiná primární metoda. Vyžaduje se před tím, než může být metoda použita pro autentifikaci.
hu: Újonnan létrehozott MFA módszer megerősítése és aktiválása ellenőrző kóddal. Automatikusan elsődleges módszerként állítja be, ha nincs más elsődleges módszer. Szükséges a módszer hitelesítéshez való használata előtt.
hy: Հաստատել և ակտիվացնել նոր ստեղծված MFA մեթոդը հաստատման ծածկագրի օգտագործմամբ: Ավտոմատ կերպով սահմանվում է որպես առաջնային մեթոդ, եթե այլ առաջնային մեթոդ գոյություն չունի: Պահանջվում է նախքան մեթոդը կարելի է օգտագործել նույնականացման համար:
is: Staðfesta og virkja nýja MFA aðferð með staðfestingarkóða. Stillir sjálfkrafa sem aðalaðferð ef engin önnur aðalaðferð er til. Krafist áður en aðferðin getur verið notuð til auðkenningar.
it: Conferma e attiva un metodo MFA appena creato utilizzando il codice di verifica. Viene automaticamente impostato come metodo primario se non esiste altro metodo primario. Richiesto prima che il metodo possa essere utilizzato per l'autenticazione.
mr: वेरिफिकेशन कोड वापरून नवीन तयार केलेली MFA पद्धत पुष्टी करा आणि सक्रिय करा. इतर कोणतीही प्राथमिक पद्धत अस्तित्वात नसल्यास आपोआप प्राथमिक पद्धत म्हणून सेट करते. ऑथेंटिकेशनसाठी पद्धत वापरण्यापूर्वी आवश्यक आहे.
ne: प्रमाणीकरण कोड प्रयोग गरेर नयाँ सिर्जना गरिएको MFA विधि पुष्टि र सक्रिय गर्नुहोस्। अन्य प्राथमिक विधि अवस्थित नभएमा स्वतः प्राथमिक विधि रूपमा सेट गर्दछ। प्रमाणीकरणको लागि विधि प्रयोग गर्नु अघि आवश्यक छ।
pl: Potwierdź i aktywuj nowo utworzoną metodę MFA przy użyciu kodu weryfikacyjnego. Automatycznie ustawia jako metodę główną, jeśli nie istnieje inna metoda główna. Wymagane przed użyciem metody do uwierzytelniania.
sl: Potrdi in aktivira novo ustvarjeno MFA metodo z uporabo verifikacijske kode. Samodejno nastavi kot primarno metodo, če ne obstaja nobena druga primarna metoda. Potrebno pred uporabo metode za avtentifikacijo.
th: ยืนยันและเปิดใช้งานวิธี MFA ที่สร้างใหม่โดยใช้รหัสยืนยัน ตั้งเป็นวิธีหลักโดยอัตโนมัติหากไม่มีวิธีหลักอื่นอยู่ จำเป็นก่อนที่จะสามารถใช้วิธีนี้สำหรับการรับรองความถูกต้อง
uk: Підтвердити та активувати щойно створений метод MFA за допомогою коду перевірки. Автоматично встановлює як основний метод, якщо не існує інших основних методів. Потрібно перед тим, як метод можна буде використовувати для автентифікації.
ur: تصدیقی کوڈ کا استعمال کرتے ہوئے نیا بنایا گیا MFA طریقہ تصدیق اور فعال کریں۔ اگر کوئی اور بنیادی طریقہ موجود نہیں ہے تو خودکار طور پر بنیادی طریقے کے طور پر سیٹ کرتا ہے۔ تصدیق کے لیے طریقہ استعمال کرنے سے پہلے ضروری ہے۔

source: Deactivate an active MFA method. Requires verification code from the method itself. Cannot deactivate primary methods - set another method as primary first.
az: Aktiv MFA metodunu deaktivləşdirin. Metodun özündən təsdiq kodu tələb edir. Əsas metodları deaktivləşdirə bilməz - əvvəlcə başqa metodu əsas olaraq təyin edin.
bs: Deaktiviraj aktivnu MFA metodu. Zahtijeva verifikacioni kod iz same metode. Ne možete deaktivirati primarne metode - prvo postavite drugu metodu kao primarnu.
cs: Deaktivuje aktivní MFA metodu. Vyžaduje verifikační kód ze samotné metody. Nelze deaktivovat primární metody - nejprve nastavte jinou metodu jako primární.
hu: Aktív MFA módszer deaktiválása. Ellenőrző kódot igényel magától a módszertől. Nem lehet deaktiválni az elsődleges módszereket - először állítson be másik módszert elsődlegesként.
hy: Ապաակտիվացնել ակտիվ MFA մեթոդը: Պահանջում է հաստատման ծածկագիր ինքը մեթոդից: Չի կարող ապաակտիվացնել առաջնային մեթոդները - առաջ սահմանեք այլ մեթոդ որպես առաջնային:
is: Afvirkja virka MFA aðferð. Krefst staðfestingarkóða frá aðferðinni sjálfri. Getur ekki afvirkjað aðalaðferðir - settu aðra aðferð sem aðalaðferð fyrst.
it: Disattiva un metodo MFA attivo. Richiede il codice di verifica dal metodo stesso. Non è possibile disattivare metodi primari - imposta prima un altro metodo come primario.
mr: सक्रिय MFA पद्धत निष्क्रिय करा. पद्धतीकडून वेरिफिकेशन कोड आवश्यक आहे. प्राथमिक पद्धती निष्क्रिय करू शकत नाही - प्रथम दुसरी पद्धत प्राथमिक म्हणून सेट करा.
ne: सक्रिय MFA विधि निष्क्रिय गर्नुहोस्। विधि आफैंबाट प्रमाणीकरण कोड आवश्यक छ। प्राथमिक विधिहरू निष्क्रिय गर्न सकिँदैन - पहिले अर्को विधिलाई प्राथमिक रूपमा सेट गर्नुहोस्।
pl: Dezaktywuj aktywną metodę MFA. Wymaga kodu weryfikacyjnego z samej metody. Nie można dezaktywować metod głównych - najpierw ustaw inną metodę jako główną.
sl: Deaktivira aktivno MFA metodo. Zahteva verifikacijsko kodo iz metode same. Ne more deaktivirati primarnih metod - najprej nastavite drugo metodo kot primarno.
th: ปิดใช้งานวิธี MFA ที่เปิดใช้งานอยู่ ต้องใช้รหัสยืนยันจากวิธีนั้นเอง ไม่สามารถปิดใช้งานวิธีหลัก - ตั้งวิธีอื่นเป็นหลักก่อน
uk: Деактивувати активний метод MFA. Потребує код перевірки від самого методу. Неможливо деактивувати основні методи - спочатку встановіть інший метод як основний.
ur: فعال MFA طریقہ کو غیر فعال کریں۔ طریقے سے خود تصدیقی کوڈ کی ضرورت ہے۔ بنیادی طریقوں کو غیر فعال نہیں کر سکتے - پہلے کسی اور طریقے کو بنیادی بنائیں۔

source: Set an active MFA method as the primary authentication method. Primary method is used by default during login flow.
az: Aktiv MFA metodunu əsas autentifikasiya metodu olaraq təyin edin. Giriş axını zamanı əsas metod varsayılan olaraq istifadə olunur.
bs: Postavi aktivnu MFA metodu kao primarnu autentifikacionu metodu. Primarna metoda se koristi po zadanim postavkama tokom toka prijave.
cs: Nastaví aktivní MFA metodu jako primární autentifikační metodu. Primární metoda je používána ve výchozím nastavení během přihlašovacího procesu.
hu: Aktív MFA módszer beállítása elsődleges hitelesítési módszerként. Az elsődleges módszer alapértelmezés szerint használatos a bejelentkezési folyamat során.
hy: Սահմանել ակտիվ MFA մեթոդը որպես առաջնային նույնականացման մեթոդ: Առաջնային մեթոդը կանխադրված կերպով օգտագործվում է մուտքի հոսքի ժամանակ:
is: Setja virka MFA aðferð sem aðal auðkenningaraðferð. Aðalaðferð er notuð sjálfgefið í innskráningarflæði.
it: Imposta un metodo MFA attivo come metodo di autenticazione primario. Il metodo primario viene utilizzato per default durante il flusso di login.
mr: सक्रिय MFA पद्धत प्राथमिक ऑथेंटिकेशन पद्धत म्हणून सेट करा. लॉगिन फ्लो दरम्यान प्राथमिक पद्धत डीफॉल्ट म्हणून वापरली जाते.
ne: सक्रिय MFA विधिलाई प्राथमिक प्रमाणीकरण विधि रूपमा सेट गर्नुहोस्। लगिन प्रवाहको दौरान प्राथमिक विधि पूर्वनिर्धारित रूपमा प्रयोग गरिन्छ।
pl: Ustaw aktywną metodę MFA jako główną metodę uwierzytelniania. Metoda główna jest używana domyślnie podczas przepływu logowania.
sl: Nastavi aktivno MFA metodo kot primarno avtentifikacijsko metodo. Primarna metoda se privzeto uporablja med prijavnim tokom.
th: ตั้งวิธี MFA ที่เปิดใช้งานเป็นวิธีการรับรองความถูกต้องหลัก วิธีหลักจะถูกใช้โดยค่าเริ่มต้นในระหว่างขั้นตอนการเข้าสู่ระบบ
uk: Встановити активний метод MFA як основний метод автентифікації. Основний метод використовується за замовчуванням під час потоку входу.
ur: فعال MFA طریقے کو بنیادی تصدیق کے طریقے کے طور پر سیٹ کریں۔ لاگ ان کے دوران بنیادی طریقہ ڈیفالٹ طور پر استعمال ہوتا ہے۔

source: Only one method can be primary at a time.
az: Yalnız bir metod eyni vaxtda əsas ola bilər.
bs: Samo jedna metoda može biti primarna u isto vrijeme.
cs: Současně může být primární pouze jedna metoda.
hu: Egyszerre csak egy módszer lehet elsődleges.
hy: Միայն մեկ մեթոդ կարող է լինել առաջնային միևնույն ժամանակ:
is: Aðeins ein aðferð getur verið aðalaðferð í einu.
it: Solo un metodo può essere primario alla volta.
mr: एकाच वेळी फक्त एकच पद्धत प्राथमिक असू शकते.
ne: एक पटकमा केवल एक विधि प्राथमिक हुन सक्छ।
pl: Tylko jedna metoda może być główna w danym czasie.
sl: Samo ena metoda je lahko hkrati primarna.
th: เฉพาะวิธีเดียวเท่านั้นที่สามารถเป็นหลักได้ในเวลาเดียวกัน
uk: Тільки один метод може бути основним одночасно.
ur: ایک وقت میں صرف ایک طریقہ بنیادی ہو سکتا ہے۔

source: Requires verification code from current primary method.
az: Cari əsas metoddan təsdiq kodu tələb edir.
bs: Zahtijeva verifikacioni kod iz trenutne primarne metode.
cs: Vyžaduje verifikační kód z aktuální primární metody.
hu: Ellenőrző kódot igényel a jelenlegi elsődleges módszertől.
hy: Պահանջում է հաստատման ծածկագիր ընթացիկ առաջնային մեթոդից:
is: Krefst staðfestingarkóða frá núverandi aðalaðferð.
it: Richiede il codice di verifica dal metodo primario corrente.
mr: वर्तमान प्राथमिक पद्धतीकडून वेरिफिकेशन कोड आवश्यक आहे.
ne: हालको प्राथमिक विधिबाट प्रमाणीकरण कोड आवश्यक छ।
pl: Wymaga kodu weryfikacyjnego z bieżącej metody głównej.
sl: Zahteva verifikacijsko kodo iz trenutne primarne metode.
th: ต้องใช้รหัสยืนยันจากวิธีหลักปัจจุบัน
uk: Потребує код перевірки від поточного основного методу.
ur: موجودہ بنیادی طریقے سے تصدیقی کوڈ کی ضرورت ہے۔
