Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.3.tar.gz/drf_auth_kit-1.1.3/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: az, bs, cs, hu, hy, is, it, mr, ne, pl, sl, th, uk, ur

source: Social account email must match your current account email.
az: Sosial hesab emaili cari hesab emailinizlə uyğun gəlməlidir.
bs: Email društvenog računa mora odgovarati email-u vašeg trenutnog računa.
cs: E-mail sociálního účtu se musí shodovat s e-mailem vašeho aktuálního účtu.
hu: A közösségi fiók e-mail címének meg kell egyeznie a jelenlegi fiók e-mail címével.
hy: Սոցիալական հաշվի էլ. փոստը պետք է համընկնի ձեր ընթացիկ հաշվի էլ. փոստի հետ:
is: Tölvupóstur samfélagsreiknings verður að passa við núverandi reikningspóst.
it: L'email dell'account social deve corrispondere all'email del tuo account corrente.
mr: सामाजिक खाते ईमेल तुमच्या वर्तमान खाते ईमेलशी जुळले पाहिजे.
ne: सामाजिक खाता इमेल तपाईंको हालको खाता इमेलसँग मेल खानुपर्छ।
pl: E-mail konta społecznościowego musi pasować do e-maila Twojego bieżącego konta.
sl: E-pošta družabnega računa se mora ujemati z e-pošto vašega trenutnega računa.
th: อีเมลบัญชีโซเชียลต้องตรงกับอีเมลบัญชีปัจจุบันของคุณ
uk: Електронна пошта соціального облікового запису повинна збігатися з електронною поштою вашого поточного облікового запису.
ur: سماجی اکاؤنٹ کا ای میل آپ کے موجودہ اکاؤنٹ کے ای میل سے مماثل ہونا چاہیے۔

source: Connected
az: Bağlandı
bs: Povezano
cs: Připojeno
hu: Csatlakoztatva
hy: Կապակցված
is: Tengt
it: Connesso
mr: कनेक्ट केले
ne: जडान भयो
pl: Połączono
sl: Povezano
th: เชื่อมต่อแล้ว
uk: Підключено
ur: جڑا ہوا

source: Failed to complete OAuth flow
az: OAuth axinını tamamlaya bilmədi
bs: Neuspješno završavanje OAuth toka
cs: Nepodařilo se dokončit OAuth proces
hu: Nem sikerült befejezni az OAuth folyamatot
hy: Չհաջողվեց ավարտել OAuth հոսքը
is: Mistókst að ljúka OAuth flæði
it: Impossibile completare il flusso OAuth
mr: OAuth फ्लो पूर्ण करण्यात अयशस्वी
ne: OAuth प्रवाह पूरा गर्न असफल
pl: Nie udało się ukończyć przepływu OAuth
sl: Neuspešno dokončanje OAuth toka
th: ไม่สามารถดำเนินการ OAuth flow ให้เสร็จสิ้น
uk: Не вдалося завершити потік OAuth
ur: OAuth فلو مکمل کرنے میں ناکام

source: User is already registered with this e-mail address.
az: İstifadəçi bu email ünvanı ilə artiq qeydiyyatdan keçib.
bs: Korisnik je već registrovan sa ovom e-mail adresom.
cs: Uživatel je již registrován s touto e-mailovou adresou.
hu: Ezzel az e-mail címmel már regisztrálva van felhasználó.
hy: Օգտատերը արդեն գրանցված է այս էլ. փոստի հասցեով:
is: Notandi er þegar skráður með þetta tölvupóstfang.
it: L'utente è già registrato con questo indirizzo email.
mr: या ईमेल पत्त्यासह युजर आधीच नोंदणीकृत आहे.
ne: यो इमेल ठेगानासँग प्रयोगकर्ता पहिले नै दर्ता भएको छ।
pl: Użytkownik z tym adresem e-mail jest już zarejestrowany.
sl: Uporabnik s tem e-poštnim naslovom je že registriran.
th: ผู้ใช้ลงทะเบียนด้วยที่อยู่อีเมลนี้แล้ว
uk: Користувач вже зареєстрований з цією адресою електронної пошти.
ur: صارف اس ای میل ایڈریس کے ساتھ پہلے سے رجسٹرڈ ہے۔

source: Failed to exchange code for access token
az: Kodu giriş tokeni ilə dəyişə bilmədi
bs: Neuspješna zamjena koda za pristupni token
cs: Nepodařilo se vyměnit kód za přístupový token
hu: Nem sikerült kicserélni a kódot hozzáférési tokenre
hy: Չհաջողվեց փոխանակել ծածկագիրը մուտքի նշանի համար
is: Mistókst að skipta kóða fyrir aðgangslykil
it: Impossibile scambiare il codice per il token di accesso
mr: एक्सेस टोकनसाठी कोड एक्सचेंज करण्यात अयशस्वी
ne: पहुँच टोकनको लागि कोड आदानप्रदान गर्न असफल
pl: Nie udało się wymienić kodu na token dostępu
sl: Neuspešna izmenjava kode za dostopni žeton
th: ไม่สามารถแลกเปลี่ยนรหัสกับ access token
uk: Не вдалося обміняти код на токен доступу
ur: رسائی ٹوکن کے لیے کوڈ تبدیل کرنے میں ناکام

source: Authenticate with {} using OAuth2/OpenID Connect authorization code to obtain access tokens.
az: Giriş tokenlərini əldə etmək üçün OAuth2/OpenID Connect avtorizasiya kodu istifadə edərək {} ilə autentifikasiya edin.
bs: Autentificiraj se sa {} koristeći OAuth2/OpenID Connect autorizacijski kod da dobiješ pristupne tokene.
cs: Autentifikace pomocí {} s použitím OAuth2/OpenID Connect autorizačního kódu k získání přístupových tokenů.
hu: Hitelesítés {} szolgáltatóval OAuth2/OpenID Connect engedélyezési kód használatával a hozzáférési tokenek megszerzéséhez.
hy: Նույնականացում {}-ի հետ՝ օգտագործելով OAuth2/OpenID Connect լիազորման ծածկագիրը՝ մուտքի նշաններ ստանալու համար:
is: Auðkennið þig með {} með OAuth2/OpenID Connect heimilunarkóða til að fá aðgangslykla.
it: Autenticati con {} utilizzando il codice di autorizzazione OAuth2/OpenID Connect per ottenere token di accesso.
mr: एक्सेस टोकन्स मिळवण्यासाठी OAuth2/OpenID Connect ऑथोरायजेशन कोड वापरून {} सह ऑथेंटिकेट करा.
ne: पहुँच टोकनहरू प्राप्त गर्न OAuth2/OpenID Connect प्राधिकरण कोड प्रयोग गरेर {} सँग प्रमाणीकरण गर्नुहोस्।
pl: Uwierzytelnij się z {} przy użyciu kodu autoryzacji OAuth2/OpenID Connect, aby uzyskać tokeny dostępu.
sl: Avtentifikacija z {} z uporabo avtorizacijske kode OAuth2/OpenID Connect za pridobitev dostopnih žetonov.
th: รับรองความถูกต้องด้วย {} โดยใช้รหัสการให้สิทธิ์ OAuth2/OpenID Connect เพื่อรับ access token
uk: Автентифікуйтесь за допомогою {}, використовуючи код авторизації OAuth2/OpenID Connect для отримання токенів доступу.
ur: رسائی ٹوکن حاصل کرنے کے لیے OAuth2/OpenID Connect authorization کوڈ استعمال کرتے ہوئے {} کے ساتھ تصدیق کریں۔

source: Connect a {} account to the current user's account. This allows the user to login using their existing {} account in the future.
az: {} hesabını cari istifadəçi hesabına bağlayın. Bu istifadəçiyə gələcəkdə mövcud {} hesabı istifadə edərək giriş etmək imkanı verir.
bs: Poveži {} račun sa računom trenutnog korisnika. Ovo omogućava korisniku da se prijavi koristeći svoj postojeći {} račun u budućnosti.
cs: Připojí {} účet k účtu aktuálního uživatele. To umožní uživateli přihlásit se pomocí svého existujícího {} účtu v budoucnu.
hu: {} fiók csatlakoztatása a jelenlegi felhasználó fiókjához. Ez lehetővé teszi a felhasználó számára, hogy a jövőben a meglévő {} fiókjával jelentkezzen be.
hy: Միացնել {} հաշիվը ընթացիկ օգտատիրոջ հաշվին: Սա թույլ է տալիս օգտատիրոջը՝ ապագայում մուտք գործել իրենց գոյություն ունեցող {} հաշվով:
is: Tengja {} reikning við núverandi notendareikning. Þetta gerir notandanum kleift að skrá sig inn með núverandi {} reikningi í framtíðinni.
it: Collega un account {} all'account dell'utente corrente. Questo permette all'utente di accedere utilizzando il proprio account {} esistente in futuro.
mr: {} खाते वर्तमान युजरच्या खात्याशी कनेक्ट करा. हे युजरला भविष्यात त्यांचे विद्यमान {} खाते वापरून लॉगिन करण्याची अनुमती देते.
ne: हालको प्रयोगकर्ताको खातामा {} खाता जडान गर्नुहोस्। यसले प्रयोगकर्तालाई भविष्यमा आफ्नो अवस्थित {} खाता प्रयोग गरेर लगिन गर्न अनुमति दिन्छ।
pl: Połącz konto {} z kontem bieżącego użytkownika. Pozwala to użytkownikowi na logowanie przy użyciu istniejącego konta {} w przyszłości.
sl: Poveže {} račun z računom trenutnega uporabnika. To omogoča uporabniku, da se v prihodnosti prijavi z obstojekim {} računom.
th: เชื่อมต่อบัญชี {} กับบัญชีของผู้ใช้ปัจจุบัน ทำให้ผู้ใช้สามารถเข้าสู่ระบบโดยใช้บัญชี {} ที่มีอยู่ในอนาคต
uk: Підключити обліковий запис {} до поточного облікового запису користувача. Це дозволяє користувачу входити за допомогою свого існуючого облікового запису {} у майбутньому.
ur: {} اکاؤنٹ کو موجودہ صارف کے اکاؤنٹ سے جوڑیں۔ یہ صارف کو مستقبل میں اپنے موجودہ {} اکاؤنٹ کا استعمال کرتے ہوئے لاگ ان کرنے کی اجازت دیتا ہے۔

source: Requires authentication and a valid OAuth2/OpenID Connect authorization code from {}.
az: {}-dən autentifikasiya və etibarlı OAuth2/OpenID Connect avtorizasiya kodu tələb edir.
bs: Zahtijeva autentifikaciju i valjan OAuth2/OpenID Connect autorizacijski kod od {}.
cs: Vyžaduje autentifikaci a platný OAuth2/OpenID Connect autorizační kód od {}.
hu: Hitelesítést és érvényes OAuth2/OpenID Connect engedélyezési kódot igényel {} szolgáltatótól.
hy: Պահանջում է նույնականացում և վավեր OAuth2/OpenID Connect լիազորման ծածկագիր {}-ից:
is: Krefst auðkenningar og gildurs OAuth2/OpenID Connect heimilunarkóða frá {}.
it: Richiede autenticazione e un codice di autorizzazione OAuth2/OpenID Connect valido da {}.
mr: {} कडून ऑथेंटिकेशन आणि वैध OAuth2/OpenID Connect ऑथोरायजेशन कोड आवश्यक आहे.
ne: प्रमाणीकरण र {} बाट वैध OAuth2/OpenID Connect प्राधिकरण कोड आवश्यक छ।
pl: Wymaga uwierzytelnienia i ważnego kodu autoryzacji OAuth2/OpenID Connect z {}.
sl: Zahteva avtentifikacijo in veljavno avtorizacijsko kodo OAuth2/OpenID Connect od {}.
th: ต้องการการรับรองความถูกต้องและรหัสการให้สิทธิ์ OAuth2/OpenID Connect ที่ถูกต้องจาก {}
uk: Потребує автентифікації та дійсного коду авторизації OAuth2/OpenID Connect від {}.
ur: تصدیق اور {} سے درست OAuth2/OpenID Connect authorization کوڈ کی ضرورت ہے۔

source: On success, the {} account is linked and can be used for future logins.
az: Uğur halında {} hesabı bağlanır və gələcək girişlər üçün istifadə edilə bilər.
bs: Kod uspjeha, {} račun je povezan i može se koristiti za buduće prijave.
cs: Při úspěchu je {} účet propojen a může být použit pro budoucí přihlášení.
hu: Sikeres esetben a {} fiók összekapcsolódik és használható lesz a jövőbeli bejelentkezésekhez.
hy: Հաջող գործողության դեպքում՝ {} հաշիվը կապակցված է և կարող է օգտագործվել ապագա մուտքերի համար:
is: Við árangur er {} reikningurinn tengdur og hægt að nota hann fyrir framtíðar innskráningar.
it: In caso di successo, l'account {} è collegato e può essere utilizzato per accessi futuri.
mr: यशस्वी ङाल्यावर, {} खाते लिंक केले जाते आणि भविष्यातील लॉगिनसाठी वापरले जाऊ शकते.
ne: सफलतामा, {} खाता लिङ्क गरिन्छ र भविष्यका लगिनहरूको लागि प्रयोग गर्न सकिन्छ।
pl: Po sukcesie konto {} jest połączone i może być używane do przyszłych logowań.
sl: Ob uspehu je {} račun povezan in ga je mogoče uporabiti za prihodnje prijave.
th: เมื่อสำเร็จ บัญชี {} จะถูกเชื่อมโยงและสามารถใช้สำหรับการเข้าสู่ระบบในอนาคต
uk: При успіху обліковий запис {} буде пов'язаний та може використовуватися для майбутніх входів.
ur: کامیابی پر، {} اکاؤنٹ لنک ہو جاتا ہے اور مستقبل میں لاگ ان کے لیے استعمال ہو سکتا ہے۔

source: List all social accounts connected to the current user. Shows account details including provider, UID, and connection dates.
az: Cari istifadəçiyə bağlanan bütün sosial hesabları siyahıla. Təminatçı, UID və bağlantı tarixləri də daxil olmaqla hesab təfərrüatlarını göstərir.
bs: Nabroji sve društvene račune povezane sa trenutnim korisnikom. Prikazuje detalje računa uključujući pružioca, UID i datume povezivanja.
cs: Vypíše všechny sociální účty připojené k aktuálnímu uživateli. Zobrazuje podrobnosti o účtu včetně poskytovatele, UID a dat připojení.
hu: A jelenlegi felhasználóhoz csatlakoztatott összes közösségi fiók felsorolása. Megjeleníti a fiók részleteit, beleértve a szolgáltatót, UID-t és csatlakozási dátumokat.
hy: Ցուցակել ընթացիկ օգտատիրոջ հետ կապակցված բոլոր սոցիալական հաշիվները: Ցույց է տալիս հաշվի մանրամասներ՝ ներառյալ մատակարարը, UID և կապակցման ամսաթվերը:
is: Sýna alla samfélagsreikninga sem eru tengdir núverandi notanda. Sýnir reikningsupplýsingar þar á meðal veitanda, UID og tengingardagsetningar.
it: Elenca tutti gli account social collegati all'utente corrente. Mostra i dettagli dell'account inclusi provider, UID e date di connessione.
mr: वर्तमान युजरशी कनेक्ट केलेली सर्व सामाजिक खाती यादी करा. प्रावाइडर, UID आणि कनेक्शन तारखांसह खात्याचे तपशील दाखवते.
ne: हालको प्रयोगकर्तामा जडान गरिएका सबै सामाजिक खाताहरूको सूची। प्रदायक, UID, र जडान मितिहरू सहित खाता विवरणहरू देखाउँदछ।
pl: Wyświetl wszystkie konta społecznościowe połączone z bieżącym użytkownikiem. Pokazuje szczegóły konta, w tym dostawcę, UID i daty połączenia.
sl: Izpiše vse družabne račune, povezane s trenutnim uporabnikom. Prikaže podrobnosti računa, vključno s ponudnikom, UID in datumi povezave.
th: แสดงรายการบัญชีโซเชียลทั้งหมดที่เชื่อมต่อกับผู้ใช้ปัจจุบัน แสดงรายละเอียดบัญชีรวมถึงผู้ให้บริการ UID และวันที่เชื่อมต่อ
uk: Перелічити всі соціальні облікові записи, підключені до поточного користувача. Показує деталі облікового запису, включаючи провайдера, UID та дати підключення.
ur: موجودہ صارف سے جڑے تمام سماجی اکاؤنٹس کی فہرست۔ اکاؤنٹ کی تفصیلات دکھاتا ہے جن میں پروائیڈر، UID، اور کنکشن کی تاریخیں شامل ہیں۔

source: Disconnect a social account from the current user. Removes the social account connection and prevents future logins via that provider. Requires authentication and the account must belong to the current user.
az: Sosial hesabı cari istifadəçidən ayırın. Sosial hesab bağlantısını silir və həmin təminatçı vasitəsilə gələcək girişləri qarşısını alır. Autentifikasiya tələb edir və hesab cari istifadəçiyə məxsus olmalıdır.
bs: Prekini vezu društvenog računa sa trenutnim korisnikom. Uklanja vezu društvenog računa i sprečava buduće prijave preko tog pružioca. Zahtijeva autentifikaciju i račun mora pripadati trenutnom korisniku.
cs: Odpojí sociální účet od aktuálního uživatele. Odebere připojení sociálního účtu a zabrání budoucím přihlášením přes tohoto poskytovatele. Vyžaduje autentifikaci a účet musí patřit aktuálnímu uživateli.
hu: Közösségi fiók leválasztása a jelenlegi felhasználóról. Eltávolítja a közösségi fiók kapcsolatot és megakadályozza a jövőbeli bejelentkezéseket azon a szolgáltatón keresztül. Hitelesítést igényel és a fióknak a jelenlegi felhasználóhoz kell tartoznia.
hy: Անջատել սոցիալական հաշիվը ընթացիկ օգտատիրոջից: Հեռացնում է սոցիալական հաշվի կապակցումը և կանխում է ապագա մուտքերը այդ մատակարարի միջոցով: Պահանջում է նույնականացում և հաշիվը պետք է պատկանի ընթացիկ օգտատիրոջը:
is: Aftenga samfélagsreikning frá núverandi notanda. Fjarlægir tengingu samfélagsreiknings og kemur í veg fyrir framtíðar innskráningar í gegnum þann veitanda. Krefst auðkenningar og reikningurinn verður að tilheyra núverandi notanda.
it: Disconnette un account social dall'utente corrente. Rimuove la connessione dell'account social e impedisce accessi futuri tramite quel provider. Richiede autenticazione e l'account deve appartenere all'utente corrente.
mr: वर्तमान युजरमधून सामाजिक खाते डिसकनेक्ट करा. सामाजिक खात्याचे कनेक्शन काढून टाकते आणि त्या प्रावाइडरद्वारे भविष्यातील लॉगिन रोखते. ऑथेंटिकेशन आवश्यक आहे आणि खाते वर्तमान युजरचे असले पाहिजे.
ne: हालको प्रयोगकर्ताबाट सामाजिक खाता विच्छेदन गर्नुहोस्। सामाजिक खाता जडान हटाउँदछ र त्यो प्रदायक मार्फत भविष्यका लगिनहरू रोक्दछ। प्रमाणीकरण आवश्यक छ र खाता हालको प्रयोगकर्ताको हुनुपर्छ।
pl: Odłącz konto społecznościowe od bieżącego użytkownika. Usuwa połączenie konta społecznościowego i zapobiega przyszłym logowaniom przez tego dostawcę. Wymaga uwierzytelnienia i konto musi należeć do bieżącego użytkownika.
sl: Odklopi družabni račun od trenutnega uporabnika. Odstrani povezavo družabnega računa in prepreči prihodnje prijave prek tega ponudnika. Zahteva avtentifikacijo in račun mora pripadati trenutnemu uporabniku.
th: ยกเลิกการเชื่อมต่อบัญชีโซเชียลจากผู้ใช้ปัจจุบัน ลบการเชื่อมต่อบัญชีโซเชียลและป้องกันการเข้าสู่ระบบในอนาคตผ่านผู้ให้บริการนั้น ต้องการการรับรองความถูกต้องและบัญชีต้องเป็นของผู้ใช้ปัจจุบัน
uk: Відключити соціальний обліковий запис від поточного користувача. Видаляє підключення соціального облікового запису та запобігає майбутнім входам через цього провайдера. Потребує автентифікації, і обліковий запис повинен належати поточному користувачу.
ur: موجودہ صارف سے سماجی اکاؤنٹ کو منقطع کریں۔ سماجی اکاؤنٹ کنکشن کو ہٹا دیتا ہے اور اس پروائیڈر کے ذریعے مستقبل میں لاگ ان کو روکتا ہے۔ تصدیق کی ضرورت ہے اور اکاؤنٹ موجودہ صارف کا ہونا چاہیے۔

source: adapter_class is not defined
az: adapter_class təyin edilməyib
bs: adapter_class nije definisan
cs: adapter_class není definován
hu: az adapter_class nincs definiálva
hy: adapter_class-ը սահմանված չէ
is: adapter_class er ekki skilgreint
it: adapter_class non è definito
mr: adapter_class परिभाषित नाही
ne: adapter_class परिभाषित छैन
pl: adapter_class nie jest zdefiniowana
sl: adapter_class ni določen
th: adapter_class ไม่ได้ถูกกำหนด
uk: adapter_class не визначено
ur: adapter_class کی تعریف نہیں ہے

source: Refresh token was not included in cookie data.
az: Yenilənmə tokeni kuki məlumatlarında daxil edilməyib.
bs: Refresh token nije uključen u podatke kolačića.
cs: Obnovovací token nebyl zahrnut v datech cookie.
hu: A frissítő token nem volt a süti adatokban.
hy: Թարմացման նշանը չի ներառվել cookie տվյալներում:
is: Endurnýjunarlykill var ekki innifalinn í vöfurgögnum.
it: Il token di aggiornamento non era incluso nei dati del cookie.
mr: रिफ्रेश टोकन कुकी डेटामध्ये समाविष्ट नव्हता.
ne: रिफ्रेश टोकन कुकी डेटामा समावेश गरिएको थिएन।
pl: Token odświeżania nie został uwzględniony w danych pliku cookie.
sl: Osveževalni žeton ni bil vključen v podatke piškotka.
th: Refresh token ไม่ได้รวมอยู่ในข้อมูลคุกกี้
uk: Токен оновлення не був включений до даних кукі.
ur: تجدید ٹوکن کوکی ڈیٹا میں شامل نہیں تھا۔

source: Refresh token was not included in request data.
az: Yenilənmə tokeni sorğu məlumatlarında daxil edilməyib.
bs: Refresh token nije uključen u podatke zahtjeva.
cs: Obnovovací token nebyl zahrnut v datech požadavku.
hu: A frissítő token nem volt a kérés adatokban.
hy: Թարմացման նշանը չի ներառվել հարցման տվյալներում:
is: Endurnýjunarlykill var ekki innifalinn í beiðnigögnum.
it: Il token di aggiornamento non era incluso nei dati della richiesta.
mr: रिफ्रेश टोकन रिक्वेस्ट डेटामध्ये समाविष्ट नव्हता.
ne: रिफ्रेश टोकन अनुरोध डेटामा समावेश गरिएको थिएन।
pl: Token odświeżania nie został uwzględniony w danych żądania.
sl: Osveževalni žeton ni bil vključen v podatke zahteve.
th: Refresh token ไม่ได้รวมอยู่ในข้อมูลคำขอ
uk: Токен оновлення не був включений до даних запиту.
ur: تجدید ٹوکن درخواست کے ڈیٹا میں شامل نہیں تھا۔

source: An error has occurred.
az: Xəta baş verdi.
bs: Dogodila se greška.
cs: Došlo k chybě.
hu: Hiba történt.
hy: Սխալ է տեղի ունեցել:
is: Villa hefur komið upp.
it: Si è verificato un errore.
mr: एक त्रुटी आली आहे.
ne: त्रुटि भएको छ।
pl: Wystąpił błąd.
sl: Prišlo je do napake.
th: เกิดข้อผิดพลาด
uk: Сталася помилка.
ur: ایک خرابی واقع ہوئی ہے۔

source: Successfully logged out.
az: Ugurla çıxış edildi.
bs: Uspješno odjavljen.
cs: Úspěšně odhlášen.
hu: Sikeresen kijelentkezve.
hy: Հաջողությամբ ելքագրվեց:
is: Skráðist út með góðum árangri.
it: Disconnesso con successo.
mr: यशस्वीरित्या लॉगआउट केले.
ne: सफलतापूर्वक लगआउट भयो।
pl: Pomyślnie wylogowano.
sl: Uspešno odjavljen.
th: ออกจากระบบสำเร็จ
uk: Успішно вийшли з системи.
ur: کامیابی سے لاگ آؤٹ ہو گئے۔

source: Password reset e-mail has been sent.
az: Parol sıfırlama emaili göndərildi.
bs: E-mail za resetovanje lozinke je poslan.
cs: E-mail pro obnovení hesla byl odeslán.
hu: A jelszó visszaállítási e-mail elküldve.
hy: Գաղտնաբառի վերականգնման էլ. փոստը ուղարկվել է:
is: Tölvupóstur um endurstillingu lykilorðs hefur verið sendur.
it: L'email di ripristino password è stata inviata.
mr: पासवर्ड रीसेट ईमेल पाठवला गेला आहे.
ne: पासवर्ड रिसेट इमेल पठाइएको छ।
pl: E-mail resetowania hasła został wysłany.
sl: E-pošta za ponastavitev gesla je bila poslana.
th: ส่งอีเมลรีเซ็ตรหัสผ่านแล้ว
uk: Електронний лист для скидання паролю було надіслано.
ur: پاس ورڈ ری سیٹ ای میل بھیجا گیا ہے۔

source: Password has been reset with the new password.
az: Parol yeni parol ilə sıfırlandı.
bs: Lozinka je resetovana sa novom lozinkom.
cs: Heslo bylo resetováno s novým heslem.
hu: A jelszó visszaállítása megtörtént az új jelszóval.
hy: Գաղտնաբառը վերականգնվել է նոր գաղտնաբառով:
is: Lykilorð hefur verið endurstillt með nýja lykilorðinu.
it: La password è stata ripristinata con la nuova password.
mr: नवीन पासवर्डसह पासवर्ड रीसेट केला गेला आहे.
ne: नयाँ पासवर्डको साथ पासवर्ड रिसेट गरिएको छ।
pl: Hasło zostało zresetowane nowym hasłem.
sl: Geslo je bilo ponastavljeno z novim geslom.
th: รหัสผ่านได้รับการรีเซ็ตด้วยรหัสผ่านใหม่แล้ว
uk: Пароль було скинуто з новим паролем.
ur: نئے پاس ورڈ کے ساتھ پاس ورڈ ری سیٹ ہو گیا ہے۔

source: New password has been saved.
az: Yeni parol saxlandı.
bs: Nova lozinka je sačuvana.
cs: Nové heslo bylo uloženo.
hu: Az új jelszó elmentve.
hy: Նոր գաղտնաբառը պահպանվել է:
is: Nýja lykilorðið hefur verið vistað.
it: La nuova password è stata salvata.
mr: नवीन पासवर्ड सेव्ह केला गेला आहे.
ne: नयाँ पासवर्ड सुरक्षित गरिएको छ।
pl: Nowe hasło zostało zapisane.
sl: Novo geslo je bilo shranjeno.
th: บันทึกรหัสผ่านใหม่แล้ว
uk: Новий пароль було збережено.
ur: نیا پاس ورڈ محفوظ کر دیا گیا ہے۔

source: Verification e-mail sent.
az: Təsdiq emaili göndərildi.
bs: Verifikacijski e-mail poslan.
cs: Verifikační e-mail odeslán.
hu: Ellenőrző e-mail elküldve.
hy: Հաստատման էլ. փոստը ուղարկվել է:
is: Staðfestingartölvupóstur sendur.
it: Email di verifica inviata.
mr: वेरिफिकेशन ईमेल पाठवला.
ne: प्रमाणीकरण इमेल पठाइयो।
pl: E-mail weryfikacyjny wysłany.
sl: Verifikacijska e-pošta poslana.
th: ส่งอีเมลยืนยันแล้ว
uk: Електронний лист для перевірки надіслано.
ur: تصدیقی ای میل بھیجا گیا۔

source: Successfully registered.
az: Ugurla qeydiyyatdan keçdi.
bs: Uspješno registrovan.
cs: Úspěšně registrován.
hu: Sikeresen regisztrálva.
hy: Հաջողությամբ գրանցվեց:
is: Skráning tókst.
it: Registrato con successo.
mr: यशस्वीरित्या नोंदणी केली.
ne: सफलतापूर्वक दर्ता भयो।
pl: Pomyślnie zarejestrowano.
sl: Uspešno registriran.
th: ลงทะเบียนสำเร็จ
uk: Успішно зареєстровано.
ur: کامیابی سے رجسٹر ہو گئے۔

source: ok
bs: u redu
hu: rendben
hy: լավ
is: í lagi
mr: ठीक
ne: ठीक छ
sl: v redu
th: ตกลง
uk: гаразд
ur: ٹھیک ہے

source: Personal info
az: şəxsi məlumatlar
bs: Lični podaci
cs: Osobní informace
hu: Személyes információk
hy: Անձնական տեղեկություններ
is: Persónuupplýsingar
it: Informazioni personali
mr: वैयक्तिक माहिती
ne: व्यक्तिगत जानकारी
pl: Informacje osobiste
sl: Osebni podatki
th: ข้อมูลส่วนบุคคล
uk: Особиста інформація
ur: ذاتی معلومات

source: Permissions
az: İcazələr
bs: Dozvole
cs: Oprávnění
hu: Jogosultságok
hy: Թույլտվություններ
is: Heimildir
it: Permessi
mr: परवानग्या
ne: अनुमतिहरू
pl: Uprawnienia
sl: Dovoljenja
th: สิทธิ์
uk: Дозволи
ur: اجازات

source: Important dates
az: Mühüm tarixlər
bs: Važni datumi
cs: Důležitá data
hu: Fontos dátumok
hy: Կարևոր ամսաթվեր
is: Mikilvægar dagsetningar
it: Date importanti
mr: महत्त्वाच्या तारखा
ne: महत्वपूर्ण मितिहरू
pl: Ważne daty
sl: Pomembni datumi
th: วันที่สำคัญ
uk: Важливі дати
ur: اہم تاریخیں
