Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.3.tar.gz/drf_auth_kit-1.1.3/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: az, bs, cs, hu, hy, is, it, mr, ne, pl, sl, th, uk, ur

source: Send password reset instructions to the provided email address. If the email is registered, a secure reset link will be sent. The link expires after a limited time for security.
az: Təqdim edilmiş email ünvanına parol sıfırlama təlimatları göndərin. Əgər email qeydiyyatdandırsa, təhlükəsiz sıfırlama bağlantısı göndəriləcək. Bağlantı təhlükəsizlik üçün məhdud vaxtdan sonra bitəcək.
bs: Pošaljite instrukcije za resetovanje lozinke na pruženu email adresu. Ako je email registrovan, sigurna veza za resetovanje će biti poslana. Veza istječe nakon ograničenog vremena radi sigurnosti.
cs: Odešle instrukce pro obnovu hesla na poskytnutou emailovou adresu. Pokud je email registrován, bude odeslán bezpečný odkaz pro obnovu. Odkaz vyprší po omezeném čase z bezpečnostních důvodů.
hu: Jelszó visszaállítási utasítások küldése a megadott e-mail címre. Ha az e-mail cím regisztrálva van, egy biztonságos visszaállítási link lesz elküldve. A link biztonsági okokból korlátozott ideig érvényes.
hy: Գաղտնաբառի վերականգնման հրահանգներ ուղարկել տրամադրված էլ. փոստի հասցեին: Եթե էլ. փոստը գրանցված է, ապահով վերականգնման հղումը կուղարկվի: Հղումն ավարտվում է սահմանափակ ժամանակից հետո անվտանգության համար:
is: Senda leiðbeiningar um endurstillingu lykilorðs á gefið tölvupóstfang. Ef tölvupósturinn er skráður verður öruggur endurstillingarhlekkur sendur. Hlekkurinn rennur út eftir takmarkaðan tíma til öryggis.
it: Invia istruzioni per il ripristino password all'indirizzo email fornito. Se l'email è registrata, verrà inviato un link sicuro di ripristino. Il link scade dopo un tempo limitato per motivi di sicurezza.
mr: प्रदान केलेल्या ईमेल पत्त्यावर पासवर्ड रीसेट सूचना पाठवा. ईमेल नोंदणीकृत असल्यास, एक सुरक्षित रीसेट लिंक पाठवली जाईल. सुरक्षिततेसाठी लिंक मर्यादित वेळेनंतर कालबाह्य होईल.
ne: प्रदान गरिएको इमेल ठेगानामा पासवर्ड रिसेट निर्देशनहरू पठाउनुहोस्। यदि इमेल दर्ता गरिएको छ भने, सुरक्षित रिसेट लिङ्क पठाइनेछ। सुरक्षाको लागि लिङ्क सीमित समयपछि समाप्त हुन्छ।
pl: Wyślij instrukcje resetowania hasła na podany adres e-mail. Jeśli e-mail jest zarejestrowany, zostanie wysłany bezpieczny link resetowania. Link wygasa po ograniczonym czasie ze względów bezpieczeństwa.
sl: Pošlje navodila za ponastavitev gesla na podani e-poštni naslov. Če je e-pošta registrirana, bo poslana varna povezava za ponastavitev. Povezava iz varnostnih razlogov poteče po omejenem času.
th: ส่งคำแนะนำการรีเซ็ตรหัสผ่านไปยังที่อยู่อีเมลที่ระบุ หากอีเมลถูกลงทะเบียนแล้ว ลิงก์รีเซ็ตที่ปลอดภัยจะถูกส่งไป ลิงก์จะหมดอายุหลังจากเวลาที่จำกัดเพื่อความปลอดภัย
uk: Надіслати інструкції для скидання паролю на вказану адресу електронної пошти. Якщо електронна пошта зареєстрована, буде надіслано безпечне посилання для скидання. Посилання закінчується через обмежений час для безпеки.
ur: فراہم کردہ ای میل ایڈریس پر پاس ورڈ ری سیٹ کی ہدایات بھیجیں۔ اگر ای میل رجسٹرڈ ہے تو محفوظ ری سیٹ لنک بھیجا جائے گا۔ سیکیورٹی کے لیے لنک محدود وقت کے بعد ختم ہو جاتا ہے۔

source: Complete the password reset process using the token from the reset email. Requires the UID and token from the email along with the new password. The token is single-use and expires for security.
az: Sıfırlama emailindən tokendən istifadə edərək parol sıfırlama prosesini tamamlayın. Yeni parol ilə birlikdə emaildən UID və token tələb olunur. Token tək istifadəlidir və təhlükəsizlik üçün bitir.
bs: Završi proces resetovanja lozinke koristeći token iz email-a za resetovanje. Zahtijeva UID i token iz email-a zajedno sa novom lozinkom. Token se može koristiti samo jednom i istječe radi sigurnosti.
cs: Dokončí proces obnovy hesla pomocí tokenu z obnovovacího emailu. Vyžaduje UID a token z emailu spolu s novým heslem. Token je na jedno použití a vyprší z bezpečnostních důvodů.
hu: A jelszó visszaállítási folyamat befejezése a visszaállítási e-mailből származó token használatával. Az e-mailből származó UID és token, valamint az új jelszó megadása szükséges. A token egyszer használatos és biztonsági okokból lejár.
hy: Ավարտել գաղտնաբառի վերականգնման գործընթացը վերականգնման էլ. փոստից ստացված նշանով: Պահանջում է UID և նշանը էլ. փոստից՝ նոր գաղտնաբառի հետ միասին: Նշանն մեկանգամյա օգտագործման է և ավարտվում է անվտանգության համար:
is: Ljúka endurstillingarferli lykilorðs með því að nota lykil úr endurstillingarpóstinum. Krefst UID og lykils úr tölvupóstinum ásamt nýja lykilorðinu. Lykillinn er einskiptis og rennur út til öryggis.
it: Completa il processo di ripristino password utilizzando il token dall'email di ripristino. Richiede l'UID e il token dall'email insieme alla nuova password. Il token è monouso e scade per motivi di sicurezza.
mr: रीसेट ईमेलमधील टोकन वापरून पासवर्ड रीसेट प्रक्रिया पूर्ण करा. नवीन पासवर्डसह ईमेलमधील UID आणि टोकन आवश्यक आहे. टोकन एकच वापरासाठी आहे आणि सुरक्षिततेसाठी कालबाह्य होते.
ne: रिसेट इमेलबाट टोकन प्रयोग गरेर पासवर्ड रिसेट प्रक्रिया पूरा गर्नुहोस्। नयाँ पासवर्डको साथ इमेलबाट UID र टोकन आवश्यक छ। टोकन एक पटक मात्र प्रयोग हुने र सुरक्षाको लागि समाप्त हुने छ।
pl: Zakończ proces resetowania hasła przy użyciu tokenu z e-maila resetowania. Wymaga UID i tokenu z e-maila wraz z nowym hasłem. Token jest jednorazowy i wygasa ze względów bezpieczeństwa.
sl: Dokonča postopek ponastavitve gesla z uporabo žetona iz e-pošte za ponastavitev. Zahteva UID in žeton iz e-pošte skupaj z novim geslom. Žeton je za enkratno uporabo in iz varnostnih razlogov poteče.
th: ดำเนินการรีเซ็ตรหัสผ่านให้เสร็จสิ้นโดยใช้ token จากอีเมลรีเซ็ต ต้องใช้ UID และ token จากอีเมลพร้อมกับรหัสผ่านใหม่ Token ใช้ได้เพียงครั้งเดียวและจะหมดอายุเพื่อความปลอดภัย
uk: Завершити процес скидання паролю за допомогою токена з електронного листа для скидання. Потребує UID та токен з електронного листа разом з новим паролем. Токен одноразовий і закінчується для безпеки.
ur: ری سیٹ ای میل سے ٹوکن کا استعمال کرتے ہوئے پاس ورڈ ری سیٹ کا عمل مکمل کریں۔ نئے پاس ورڈ کے ساتھ ای میل سے UID اور ٹوکن کی ضرورت ہے۔ ٹوکن ایک بار استعمال ہوتا ہے اور سیکیورٹی کے لیے ختم ہو جاتا ہے۔

source: Change the current user's password. Requires authentication.
az: Cari istifadəçinin parolunu dəyişdirin. Autentifikasiya tələb olunur.
bs: Promijeni lozinku trenutnog korisnika. Zahtijeva autentifikaciju.
cs: Změní heslo aktuálního uživatele. Vyžaduje autentifikaci.
hu: A jelenlegi felhasználó jelszavának módosítása. Hitelesítést igényel.
hy: Փոխել ընթացիկ օգտատիրոջ գաղտնաբառը: Պահանջում է նույնականացում:
is: Breyta lykilorði núverandi notanda. Krefst auðkenningar.
it: Cambia la password dell'utente corrente. Richiede autenticazione.
mr: वर्तमान युजरचा पासवर्ड बदला. ऑथेंटिकेशन आवश्यक आहे.
ne: हालको प्रयोगकर्ताको पासवर्ड परिवर्तन गर्नुहोस्। प्रमाणीकरण आवश्यक छ।
pl: Zmień hasło bieżącego użytkownika. Wymaga uwierzytelnienia.
sl: Spremeni geslo trenutnega uporabnika. Zahteva avtentifikacijo.
th: เปลี่ยนรหัสผ่านของผู้ใช้ปัจจุบัน ต้องการการรับรองความถูกต้อง
uk: Змінити пароль поточного користувача. Потребує автентифікації.
ur: موجودہ صارف کا پاس ورڈ تبدیل کریں۔ تصدیق کی ضرورت ہے۔

source: Confirm email address using the verification key sent via email. This activates the user account and allows login access.
az: Email vasitəsilə göndərilmiş təsdiq açarından istifadə edərək email ünvanını təsdiqləyin. Bu istifadəçi hesabını aktivləşdirir və giriş icazəsi verir.
bs: Potvrdi email adresu koristeći ključ za verifikaciju poslan putem email-a. Ovo aktivira korisnički račun i omogućava pristup prijavi.
cs: Potvrdí emailovou adresu pomocí verifikačního klíče odeslaného emailem. Tím se aktivuje uživatelský účet a umožní přístup k přihlášení.
hu: E-mail cím megerősítése az e-mailben küldött ellenőrző kulcs használatával. Ez aktiválja a felhasználói fiókot és lehetővé teszi a bejelentkezési hozzáférést.
hy: Հաստատել էլ. փոստի հասցեն՝ օգտագործելով էլ. փոստով ուղարկված հաստատման բանալին: Սա ակտիվացնում է օգտատիրոջ հաշիվը և թույլ է տալիս մուտքի հասանելիություն:
is: Staðfesta tölvupóstfang með því að nota staðfestingarlykil sem sendur var í tölvupósti. Þetta virkjar notendareikninginn og leyfir innskráningaraðgang.
it: Conferma l'indirizzo email utilizzando la chiave di verifica inviata via email. Questo attiva l'account utente e consente l'accesso di login.
mr: ईमेलद्वारे पाठवलेल्या वेरिफिकेशन कीचा वापर करून ईमेल पत्ता पुष्टी करा. हे युजर खाते सक्रिय करते आणि लॉगिन एक्सेसची अनुमती देते.
ne: इमेल मार्फत पठाइएको प्रमाणीकरण कुञ्जी प्रयोग गरेर इमेल ठेगाना पुष्टि गर्नुहोस्। यसले प्रयोगकर्ता खाता सक्रिय गर्दछ र लगिन पहुँच अनुमति दिन्छ।
pl: Potwierdź adres e-mail używając klucza weryfikacyjnego wysłanego e-mailem. To aktywuje konto użytkownika i umożliwia dostęp do logowania.
sl: Potrdi e-poštni naslov z uporabo verifikacijskega ključa, poslanega po e-pošti. To aktivira uporabniški račun in omogoča dostop za prijavo.
th: ยืนยันที่อยู่อีเมลโดยใช้คีย์ยืนยันที่ส่งทางอีเมล การดำเนินการนี้จะเปิดใช้งานบัญชีผู้ใช้และอนุญาตให้เข้าสู่ระบบได้
uk: Підтвердити адресу електронної пошти за допомогою ключа перевірки, надісланого електронною поштою. Це активує обліковий запис користувача та дозволяє доступ для входу.
ur: ای میل کے ذریعے بھیجی گئی تصدیقی کلید کا استعمال کرتے ہوئے ای میل ایڈریس کی تصدیق کریں۔ یہ صارف اکاؤنٹ کو فعال کرتا ہے اور لاگ ان کی رسائی کی اجازت دیتا ہے۔

source: Send a new email verification message to unverified email addresses. Only works for email addresses that are registered but not yet verified.
az: Təsdiqlənməmiş email ünvanlarına yeni email təsdiq mesajı göndərin. Yalnız qeydiyyatdan keçmiş, lakin hələ təsdiqlənməmiş email ünvanları üçün işləyir.
bs: Pošaljite novu poruku za verifikaciju email-a na neovjerene email adrese. Funkcionira samo za email adrese koje su registrovane ali još uvijek neovjerene.
cs: Odešle novou verifikační zprávu na neověřené emailové adresy. Funguje pouze pro emailové adresy, které jsou registrované, ale ještě neověřené.
hu: Új e-mail ellenőrző üzenet küldése el nem igazolt e-mail címekre. Csak olyan e-mail címekre működik, amelyek regisztrálva vannak, de még nem lettek ellenőrizve.
hy: Ուղարկել նոր էլ. փոստի հաստատման հաղորդագրություն չհաստատված էլ. փոստի հասցեներին: Գործում է միայն այն էլ. փոստի հասցեների համար, որոնք գրանցված են, բայց դեռ չեն հաստատվել:
is: Senda nýjan tölvupóststaðfestingarskilaboð til óstaðfestra tölvupóstfanga. Virkar aðeins fyrir tölvupóstfang sem eru skráð en ekki enn staðfest.
it: Invia un nuovo messaggio di verifica email agli indirizzi email non verificati. Funziona solo per indirizzi email che sono registrati ma non ancora verificati.
mr: अपुष्ट ईमेल पत्त्यांवर नवीन ईमेल वेरिफिकेशन संदेश पाठवा. फक्त नोंदणीकृत पण अद्याप पुष्टी न झालेल्या ईमेल पत्त्यांसाठी काम करते.
ne: अप्रमाणित इमेल ठेगानहरूमा नयाँ इमेल प्रमाणीकरण सन्देश पठाउनुहोस्। केवल दर्ता गरिएका तर अझै प्रमाणित नभएका इमेल ठेगानहरूको लागि मात्र काम गर्दछ।
pl: Wyślij nową wiadomość weryfikacji e-mail na niezweryfikowane adresy e-mail. Działa tylko dla adresów e-mail, które są zarejestrowane, ale jeszcze nie zweryfikowane.
sl: Pošlje novo sporočilo za verifikacijo e-pošte na nepotrjene e-poštne naslove. Deluje samo za e-poštne naslove, ki so registrirani, vendar še niso potrjeni.
th: ส่งข้อความยืนยันอีเมลใหม่ไปยังที่อยู่อีเมลที่ยังไม่ได้รับการยืนยัน ใช้ได้เฉพาะกับที่อยู่อีเมลที่ลงทะเบียนแล้วแต่ยังไม่ได้รับการยืนยัน
uk: Надіслати нове повідомлення для перевірки електронної пошти на неперевірені адреси. Працює тільки для адрес електронної пошти, які зареєстровані, але ще не перевірені.
ur: غیر تصدیق شدہ ای میل ایڈریس پر نیا ای میل تصدیق کا پیغام بھیجیں۔ صرف ان ای میل ایڈریس کے لیے کام کرتا ہے جو رجسٹرڈ ہیں لیکن ابھی تک تصدیق نہیں ہوئے۔

source: Retrieve the authenticated user's profile information including username, email, first name, and last name. Password fields are excluded.
az: İstifadəçi adı, email, ad və soyadı da daxil olmaqla autentifikasiya edilmiş istifadəçinin profil məlumatlarını əldə edin. Parol sahələri istisna edilir.
bs: Dohvati informacije o profilu autentificiranog korisnika uključujući korisničko ime, email, ime i prezime. Polja za lozinke su isključena.
cs: Načte informace o profilu autentifikovaného uživatele včetně uživatelského jména, emailu, jména a příjmení. Hesla jsou vyloučena.
hu: A hitelesített felhasználó profil információinak lekérése, beleértve a felhasználónevet, e-mail címet, keresztnevet és vezetéknevet. A jelszó mezők ki vannak zárva.
hy: Ստանալ նույնականացված օգտատիրոջ պրոֆիլի տեղեկությունները՝ ներառյալ օգտանունը, էլ. փոստը, անունը և ազգանունը: Գաղտնաբառի դաշտերը բացառված են:
is: Sækja prófílupplýsingar auðkennds notanda þar með talið notendanafn, tölvupóst, fornafn og eftirnafn. Lykilorðsreitir eru útilokaðir.
it: Recupera le informazioni del profilo dell'utente autenticato inclusi nome utente, email, nome e cognome. I campi password sono esclusi.
mr: युजरनेम, ईमेल, नाव आणि आडनावासह ऑथेंटिकेटेड युजरची प्रोफाइल माहिती मिळवा. पासवर्ड फील्ड्स वगळले आहेत.
ne: प्रयोगकर्ता नाम, इमेल, पहिलो नाम र अन्तिम नाम सहित प्रमाणित प्रयोगकर्ताको प्रोफाइल जानकारी पुनः प्राप्त गर्नुहोस्। पासवर्ड फिल्डहरू बाहेक छन्।
pl: Pobierz informacje o profilu uwierzytelnionego użytkownika, w tym nazwę użytkownika, e-mail, imię i nazwisko. Pola hasła są wykluczone.
sl: Pridobi informacije o profilu avtentificiranega uporabnika, vključno z uporabniškim imenom, e-pošto, imenom in priimkom. Polja za gesla so izključena.
th: ดึงข้อมูลโปรไฟล์ของผู้ใช้ที่ได้รับการรับรองความถูกต้อง รวมถึงชื่อผู้ใช้ อีเมล ชื่อ และนามสกุล ไม่รวมฟิลด์รหัสผ่าน
uk: Отримати інформацію профілю автентифікованого користувача, включаючи ім'я користувача, електронну пошту, ім'я та прізвище. Поля паролю виключені.
ur: تصدیق شدہ صارف کی پروفائل معلومات حاصل کریں جن میں صارف نام، ای میل، پہلا نام اور آخری نام شامل ہے۔ پاس ورڈ کے خانے شامل نہیں ہیں۔

source: Update the authenticated user's profile information. Allows modification of username, first name, and last name. Email field is read-only for security.
az: Autentifikasiya edilmiş istifadəçinin profil məlumatlarını yeniləyin. İstifadəçi adı, ad və soyadın dəyişdirilməsinə icazə verir. Email sahəsi təhlükəsizlik üçün yalnız oxunaqdır.
bs: Ažuriraj informacije o profilu autentificiranog korisnika. Omogućava modificiranje korisničkog imena, imena i prezimena. Email polje je samo za čitanje radi sigurnosti.
cs: Aktualizuje informace o profilu autentifikovaného uživatele. Umožňuje úpravu uživatelského jména, jména a příjmení. Pole email je z bezpečnostních důvodů pouze pro čtení.
hu: A hitelesített felhasználó profil információinak frissítése. Lehetővé teszi a felhasználónév, keresztnév és vezetéknév módosítását. Az e-mail mező biztonsági okokból csak olvasható.
hy: Թարմացնել նույնականացված օգտատիրոջ պրոֆիլի տեղեկությունները: Թույլ է տալիս փոփոխել օգտանունը, անունը և ազգանունը: Էլ. փոստի դաշտը կարդալու համար է միայն անվտանգության համար:
is: Uppfæra prófílupplýsingar auðkennds notanda. Leyfir breytingu á notendanafni, fornafni og eftirnafni. Tölvupóstreitur er lesaðgangur eingöngu til öryggis.
it: Aggiorna le informazioni del profilo dell'utente autenticato. Consente la modifica di nome utente, nome e cognome. Il campo email è in sola lettura per sicurezza.
mr: ऑथेंटिकेटेड युजरची प्रोफाइल माहिती अपडेट करा. युजरनेम, नाव आणि आडनाव बदलण्याची अनुमती देते. सुरक्षिततेसाठी ईमेल फील्ड फक्त वाचण्यासाठी आहे.
ne: प्रमाणित प्रयोगकर्ताको प्रोफाइल जानकारी अपडेट गर्नुहोस्। प्रयोगकर्ता नाम, पहिलो नाम र अन्तिम नाम परिमार्जन गर्न अनुमति दिन्छ। सुरक्षाको लागि इमेल फिल्ड केवल पढ्न मात्र हो।
pl: Zaktualizuj informacje o profilu uwierzytelnionego użytkownika. Umożliwia modyfikację nazwy użytkownika, imienia i nazwiska. Pole e-mail jest tylko do odczytu ze względów bezpieczeństwa.
sl: Posodobi informacije o profilu avtentificiranega uporabnika. Omogoča spreminjanje uporabniškega imena, imena in priimka. Polje e-pošte je iz varnostnih razlogov samo za branje.
th: อัปเดตข้อมูลโปรไฟล์ของผู้ใช้ที่ได้รับการรับรองความถูกต้อง อนุญาตให้แก้ไขชื่อผู้ใช้ ชื่อ และนามสกุล ฟิลด์อีเมลเป็นแบบอ่านอย่างเดียวเพื่อความปลอดภัย
uk: Оновити інформацію профілю автентифікованого користувача. Дозволяє модифікацію імені користувача, імені та прізвища. Поле електронної пошти доступне лише для читання з міркувань безпеки.
ur: تصدیق شدہ صارف کی پروفائل معلومات کو اپڈیٹ کریں۔ صارف نام، پہلا نام اور آخری نام میں تبدیلی کی اجازت دیتا ہے۔ سیکیورٹی کے لیے ای میل کا خانہ صرف پڑھنے کے لیے ہے۔

source: Partially update the authenticated user's profile information. Only provided fields will be updated. Email field is read-only.
az: Autentifikasiya edilmiş istifadəçinin profil məlumatlarını qismən yeniləyin. Yalnız təqdim edilmiş sahələr yenilənəcək. Email sahəsi yalnız oxunaqdır.
bs: Djelomično ažuriraj informacije o profilu autentificiranog korisnika. Samo pružena polja će biti ažurirana. Email polje je samo za čitanje.
cs: Částečně aktualizuje informace o profilu autentifikovaného uživatele. Budou aktualizována pouze poskytnutá pole. Pole email je pouze pro čtení.
hu: A hitelesített felhasználó profil információinak részleges frissítése. Csak a megadott mezők lesznek frissítve. Az e-mail mező csak olvasható.
hy: Մասնակիորեն թարմացնել նույնականացված օգտատիրոջ պրոֆիլի տեղեկությունները: Միայն տրամադրված դաշտերը կթարմացվեն: Էլ. փոստի դաշտը կարդալու համար է միայն:
is: Uppfæra prófílupplýsingar auðkennds notanda að hluta. Aðeins gefnir reitir verða uppfærðir. Tölvupóstreitur er lesaðgangur eingöngu.
it: Aggiorna parzialmente le informazioni del profilo dell'utente autenticato. Solo i campi forniti verranno aggiornati. Il campo email è in sola lettura.
mr: ऑथेंटिकेटेड युजरची प्रोफाइल माहिती अंशतः अपडेट करा. फक्त प्रदान केलेली फील्ड्स अपडेट होतील. ईमेल फील्ड फक्त वाचण्यासाठी आहे.
ne: प्रमाणित प्रयोगकर्ताको प्रोफाइल जानकारी आंशिक रूपमा अपडेट गर्नुहोस्। केवल प्रदान गरिएका फिल्डहरू अपडेट गरिनेछ। इमेल फिल्ड केवल पढ्न मात्र हो।
pl: Częściowo zaktualizuj informacje o profilu uwierzytelnionego użytkownika. Tylko dostarczone pola zostaną zaktualizowane. Pole e-mail jest tylko do odczytu.
sl: Delno posodobi informacije o profilu avtentificiranega uporabnika. Posodobljena bodo le zagotovljena polja. Polje e-pošte je samo za branje.
th: อัปเดตข้อมูลโปรไฟล์ของผู้ใช้ที่ได้รับการรับรองความถูกต้องบางส่วน เฉพาะฟิลด์ที่ระบุเท่านั้นที่จะถูกอัปเดต ฟิลด์อีเมลเป็นแบบอ่านอย่างเดียว
uk: Частково оновити інформацію профілю автентифікованого користувача. Тільки надані поля будуть оновлені. Поле електронної пошти доступне лише для читання.
ur: تصدیق شدہ صارف کی پروفائل معلومات کو جزوی طور پر اپڈیٹ کریں۔ صرف فراہم کردہ خانے اپڈیٹ ہوں گے۔ ای میل کا خانہ صرف پڑھنے کے لیے ہے۔

source: The email address is not assigned to any user account.
az: Email ünvanı heç bir istifadəçi hesabına təyin edilməyib.
bs: Email adresa nije dodijeljena nijednom korisničkom računu.
cs: Emailová adresa není přiřazena žádnému uživatelskému účtu.
hu: Az e-mail cím nincs hozzárendelve egyetlen felhasználói fiókhoz sem.
hy: Էլ. փոստի հասցեն չի նշանակված որևէ օգտատիրոջ հաշվի:
is: Tölvupóstfangið er ekki úthlutað neinum notendareikningi.
it: L'indirizzo email non è assegnato a nessun account utente.
mr: ईमेल पत्ता कोणत्याही युजर खात्याला नियुक्त केलेला नाही.
ne: इमेल ठेगाना कुनै प्रयोगकर्ता खातामा असाइन गरिएको छैन।
pl: Adres e-mail nie jest przypisany do żadnego konta użytkownika.
sl: E-poštni naslov ni dodeljen nobenemu uporabniškemu računu.
th: ที่อยู่อีเมลไม่ได้ถูกกำหนดให้กับบัญชีผู้ใช้ใด ๆ
uk: Адреса електронної пошти не призначена жодному обліковому запису користувача.
ur: ای میل ایڈریس کسی بھی صارف اکاؤنٹ کو تفویض نہیں ہے۔

source: Requested MFA method does not exist.
az: Tələb olunan MFA metodu mövcud deyil.
bs: Zahtjevana MFA metoda ne postoji.
cs: Požadovaná MFA metoda neexistuje.
hu: A kért MFA módszer nem létezik.
hy: Պահանջված MFA մեթոդը գոյություն չունի:
is: Umbeðin MFA aðferð er ekki til.
it: Il metodo MFA richiesto non esiste.
mr: विनंती केलेली MFA पद्धत अस्तित्वात नाही.
ne: अनुरोध गरिएको MFA विधि अवस्थित छैन।
pl: Żądana metoda MFA nie istnieje.
sl: Zahtevana MFA metoda ne obstaja.
th: วิธี MFA ที่ขอไม่มีอยู่
uk: Запитаний метод MFA не існує.
ur: مطلوبہ MFA طریقہ موجود نہیں ہے۔

source: Email message with MFA code has been sent.
az: MFA kodu ilə email mesajı göndərildi.
bs: Email poruka sa MFA kodom je poslana.
cs: Emailová zpráva s MFA kódem byla odeslána.
hu: Az MFA kóddal rendelkező e-mail üzenet elküldve.
hy: MFA ծածկագրով էլ. փոստի հաղորդագրությունը ուղարկվել է:
is: Tölvupóstur með MFA kóða hefur verið sendur.
it: Il messaggio email con il codice MFA è stato inviato.
mr: MFA कोडसह ईमेल संदेश पाठवला गेला आहे.
ne: MFA कोडसहित इमेल सन्देश पठाइएको छ।
pl: Wiadomość e-mail z kodem MFA została wysłana.
sl: E-poštno sporočilo z MFA kodo je bilo poslano.
th: ข้อความอีเมลพร้อมรหัส MFA ถูกส่งแล้ว
uk: Електронне повідомлення з кодом MFA було надіслано.
ur: MFA کوڈ کے ساتھ ای میل پیغام بھیجا گیا ہے۔

source: MFA code expires in {} seconds.
az: MFA kodu {} saniyədə bitəcək.
bs: MFA kod istječe za {} sekundi.
cs: MFA kód vyprší za {} sekund.
hu: Az MFA kód {} másodperc múlva lejár.
hy: MFA ծածկագիրը կավարտվի {} վայրկյանից:
is: MFA kóði rennur út eftir {} sekúndur.
it: Il codice MFA scade tra {} secondi.
mr: MFA कोड {} सेकंदांत कालबाह्य होतो.
ne: MFA कोड {} सेकेन्डमा समाप्त हुन्छ।
pl: Kod MFA wygasa za {} sekund.
sl: MFA koda poteče v {} sekundah.
th: รหัส MFA จะหมดอายุใน {} วินาที
uk: Код MFA закінчується через {} секунд.
ur: MFA کوڈ {} سیکنڈ میں ختم ہو جاتا ہے۔

source: First step of MFA-enabled authentication. Validates credentials and initiates MFA flow.
az: MFA-aktiv autentifikasiyasının ilk addımı. Etimadnamələri təsdiqləyir və MFA axını başladır.
bs: Prvi korak MFA-omogućene autentifikacije. Validira kredencijale i pokršava MFA tok.
cs: První krok autentifikace s povolenou MFA. Ověřuje přihlašovací údaje a spouští MFA proces.
hu: Az MFA-engedélyezett hitelesítés első lépése. Érvényesíti a hitelesítő adatokat és elindítja az MFA folyamatot.
hy: MFA-ակտիվացված նույնականացման առաջին քայլը: Վալիդացնում է իրավունքները և մեկնարկում է MFA հոսքը:
is: Fyrsta skref MFA-virkjaðrar auðkenningar. Staðfestir skilríki og byrjar MFA flæði.
it: Primo passo dell'autenticazione abilitata MFA. Valida le credenziali e inizia il flusso MFA.
mr: MFA-सक्षम ऑथेंटिकेशनची पहिली पायरी. क्रेडेंशियल्स वेलिडेट करते आणि MFA फ्लो सुरू करते.
ne: MFA-सक्षम प्रमाणीकरणको पहिलो चरण। प्रमाणपत्रहरू मान्य गर्दछ र MFA प्रवाह सुरु गर्दछ।
pl: Pierwszy krok uwierzytelniania z włączonym MFA. Sprawdza dane uwierzytelniające i inicjuje przepływ MFA.
sl: Prvi korak avtentifikacije z omogočeno MFA. Validira poverilnice in sproži MFA tok.
th: ขั้นตอนแรกของการรับรองความถูกต้องที่เปิดใช้งาน MFA ตรวจสอบข้อมูลประจำตัวและเริ่มต้นขั้นตอน MFA
uk: Перший крок автентифікації з увімкненим MFA. Перевіряє облікові дані та ініціює потік MFA.
ur: MFA فعال تصدیق کا پہلا قدم۔ اسناد کی تصدیق کرتا ہے اور MFA فلو کا آغاز کرتا ہے۔
