Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.10.tar.gz/litegram-1.0.10/docs/locale/*/LC_MESSAGES/utils/i18n.po
Languages: ru

source: Translation
ru: Переклад

source: In order to make you bot translatable you have to add a minimal number of hooks to your Python code.
ru: Для того, чтобы Ваш бот володив декилькома мовами, необходимо добавить минимальну килькисть хукив к вашого Python коду

source: These hooks are called translation strings.
ru: Ци хуки звуться рядками передкладу

source: The litegram translation utils is build on top of `GNU gettext Python module <https://docs.python.org/3/library/gettext.html>`_ and `Babel library <http://babel.pocoo.org/en/latest/>`_.
ru: Утилити перевода побудовани на основе модулю `GNU gettext Python <https://docs.python.org/3/library/gettext.html>`_ и `Babel library <http://babel.pocoo.org/en/latest/>`_.

source: Installation
ru: Всиновлення

source: Babel is required to make simple way to extract translation strings from your code
ru: Babel потрибний для забезпечення простоти експорту рядкив перевода с Вашого коду.

source: Can be installed from pip directly:
ru: Можна всиновити непосредственно с pip:

source: or as `litegram` extra dependency:
ru: или как кдаткову зависимость `litegram`:

source: Make messages translatable
ru: Как зробити сообщение переводимыми?

source: In order to gettext need to know what the strings should be translated you will need to write translation strings.
ru: Для того, чтобы gettext знав которые строки следует перекласти, Вам необходимо видмитити строки перевода.

source: For example:
ru: Например:

source: f-strings can't be used as translations string because any dynamic variables should be added to message after getting translated message
ru: f-строки не можно использовать как строки перевода, поскольку будь-которые динамические переменные следует добавить к сообщения после получения переведенного сообщения

source: Also if you want to use translated string in keyword- or magic- filters you will need to use lazy gettext calls:
ru: Крим того, если Ви бажаете використати перекладений строку в фильтрах, Вам треба використати видкладений перевод (lazy gettext):

source: Lazy gettext calls should always be used when the current language is not know at the moment
ru: Отложенные вызовы gettext следует всегда использовать, когда поточна мова на даний момент невидома.

source: Lazy gettext can't be used as value for API methods or any Telegram Object (like :class:`litegram.types.inline_keyboard_button.InlineKeyboardButton` or etc.)
ru: Отложенные вызовы gettext не можно использовать как значение для методив API или будь-которого объекта Telegram (например, :class:`litegram.types.inline_keyboard_button.InlineKeyboardButton` и т.д.)

source: Configuring engine
ru: Налаштування рушия

source: After you messages is already done to use gettext your bot should know how to detect user language
ru: Когда ваши сообщения уже готовые использовать gettext, Ваш бот должен знати, как определить мову пользователя.

source: On top of your application the instance of :class:`litegram.utils.i18n.I18n` should be created
ru: Поруч с мисцем инициализации диспетчера имеет быть созданный экземпляр перекладача:class:`litegram.utils.i18n.I18n`.

source: After that you will need to choose one of builtin I18n middleware or write your own.
ru: После этого Вам нужно будет вибрати одну с встроенных промижних програм (middleware) I18n или написать власну.

source: Builtin middlewares:
ru: Вбуквани промеждуни программы:

source: Simple I18n middleware.
ru: Проси I18n middleware.

source: Chooses language code from the User object received in event
ru: Вибирае код языки с об’еки User, отриманого в события.

source: Create an instance of middleware
ru: Создания екземпляру промеждунои программы.

source: Parameters
ru: Параметры

source: instance of I18n
ru: экземпляр I18n

source: context key for I18n instance
ru: ключ (название ключа) екземпляру I18n в контексти

source: context key for this middleware
ru: контекстный ключ для этой промеждунои программы

source: Const middleware chooses statically defined locale
ru: Middleware Const вибирае ситично визначену локаль.

source: This middleware stores locale in the FSM storage
ru: Ця middleware зберигае локаль в сховищи FSM.

source: Write new locale to the storage
ru: Запись новои локали в хранилище

source: instance of FSMContext
ru: экземпляр FSMContext

source: new locale
ru: нова локаль

source: or define you own based on abstract I18nMiddleware middleware:
ru: или визначте вашу власну промижну програму, основану на абстракции I18nMiddleware:

source: Abstract I18n middleware.
ru: Абстракция промеждунои программы I18n

source: Detect current user locale based on event and context.
ru: Визначення поточнои языки пользователя на основе события и контекста.

source: **This method must be defined in child classes**
ru: **Этот метод должен быть перевизначеним в кчирних класах**

source: Returns
ru: Возвращает

source: Register middleware for all events in the Router
ru: Реестрация промеждунои программы для всех событий в Роутери

source: Deal with Babel
ru: Працюемо с Babel

source: Step 1 Extract messages
ru: Шаг 1: Викбування текстив

source: Here is :code:`--input-dirs=.` - path to code and the :code:`locales/messages.pot` is template where messages will be extracted and `messages` is translation domain.
ru: Где :code:`--input-dirs=.`- шлях к коду, :code:`locales/messages.pot` — это шаблон, куда будут извлекаться сообщения, а `messages` — домен перевода.

source: Some useful options:
ru: Деяки корисни опции:

source: Add comments for translators, you can use another tag if you want (TR) :code:`--add-comments=NOTE`
ru: Для додавання коментарив для перекладачив, вы можете использовать инший тег, если хотите (TR) :code:`--add-comments=NOTE`

source: Disable comments with string location in code :code:`--no-location`
ru: Вимкнути коменири с розишуванням рядкив в коди :code:`--no-location`

source: Set project name :code:`--project=MySuperBot`
ru: Всиновлення назви проекту :code:`--project=MySuperBot`

source: Set version :code:`--version=2.2`
ru: Всиновлення версии :code:`--version=2.2`

source: Step 2: Init language
ru: Шаг 2: Інициализация перевода

source: :code:`-i locales/messages.pot` - pre-generated template
ru: :code:`-i locales/messages.pot` - попередньо созданный шаблон

source: :code:`-d locales` - translations directory
ru: :code:`-d locales`- тека переводов

source: :code:`-D messages` - translations domain
ru: :code:`-D messages` - кмен переводов

source: :code:`-l en` - language. Can be changed to any other valid language code (For example :code:`-l ru` for russian language)
ru: :code:`-l en` - язык. Может быть изменен на любой другой действительный код языка (Например :code:`-l ru` для русского языка)

source: Step 3: Translate texts
ru: Шаг 3: Переклад текстив

source: To open .po file you can use basic text editor or any PO editor, e.g. `Poedit <https://poedit.net/>`_
ru: Чтобы видкрити файл .po, вы можете использовать базовый текстовый редактор или будь-который редактор .po файлов, напр. `Poedit <https://poedit.net/>`_

source: Just open the file named :code:`locales/{language}/LC_MESSAGES/messages.po` and write translations
ru: Просто видкрийте файл из названием :code:`locales/{language}/LC_MESSAGES/messages.po` и впишить переводы

source: Step 4: Compile translations
ru: Шаг 4: Компиляция переводов

source: Step 5: Updating messages
ru: Шаг 5: Оновлення текстив

source: When you change the code of your bot you need to update po & mo files
ru: Когда вы зминюете код свого бота, вам нужно обновить файлы .po и .mo

source: Step 5.1: regenerate pot file: command from step 1
ru: Шаг 5.1: отновлення файлу .pot: команда с кроку 1

source: Step 5.2: update po files
ru: Шаг 5.2: обновления .po файлов

source: Step 5.3: update your translations: location and tools you know from step 3
ru: Шаг 5.3: обновления Ваших переводов: размещение и инструменты Ви знаете с кроку 3.

source: Step 5.4: compile mo files: command from step 4
ru: Шаг 5.4: компиляция .mo файлов : команда с кроку 4
