Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.3.tar.gz/litegram-1.0.3/docs/locale/*/LC_MESSAGES/utils/keyboard.po
Languages: ru

source: Keyboard builder
ru: Конструктор клавиатуры

source: Keyboard builder helps to dynamically generate markup.
ru: Конструктор клавиатуры кпомагае динамично генерувати розмитку

source: Note that if you have static markup, it's best to define it explicitly rather than using builder, but if you have dynamic markup configuration, feel free to use builder as you wish.
ru: Зауважте, что если в вас является статична розмитка, найкраще визначити ии явно, а не использовать конструктор, але если в вас является конфигурация динамичнои розмитки, смиливо используйте конструктор на свий розсуд.

source: Usage example
ru: Пример викорисиння

source: Inline Keyboard
ru: Клавиатура под повикмленням(Inline Keyboard)

source: Inline keyboard builder inherits all methods from generic builder
ru: Конструктор клавиатуры под повидомленням успадковуе все методы от универсального конструктора

source: Add new inline button to markup
ru: Додавання новои кнопки к розмитки

source: Construct an InlineKeyboardMarkup
ru: Створення InlineKeyboardMarkup

source: Add one or many buttons to markup.
ru: Додавання одниеи или килькох кнопок к розмитки.

source: Parameters
ru: Параметры

source: Returns
ru: Возвращает

source: Adjust previously added buttons to specific row sizes.
ru: Налаштування раньше кданных кнопок к певних розмирив рядкив.

source: Get flatten set of all buttons
ru: Отримання плоского списку всех кнопок

source: Make full copy of current builder with markup
ru: Робить повну копию текущего конструктора с розмиткою

source: Export configured markup as list of lists of buttons
ru: Експортуе налаштовану розмитку как список спискив кнопок

source: Add row to markup
ru: Додае рякк в розмитку

source: When too much buttons is passed it will be separated to many rows
ru: Коли передано занадто много кнопок, вони будуть роздилени на много рядкив

source: Reply Keyboard
ru: Клавиатура ответов

source: Reply keyboard builder inherits all methods from generic builder
ru: Конструктор клавиатуры видповидей успадковуе все методы от универсального конструктора

source: Add new button to markup
ru: Додавання новои кнопки к розмитки

source: Construct an ReplyKeyboardMarkup
ru: Створення ReplyKeyboardMarkup
