Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.3.tar.gz/litegram-1.0.3/docs/locale/*/LC_MESSAGES/utils/serialization.po
Languages: ru

source: Telegram object serialization
ru: Сериализация об'еки Telegram

source: Serialization
ru: Сериализация

source: To serialize Python object to Telegram object you can use pydantic serialization methods, for example:
ru: Чтобы перетворити объект Python в объект Telegram, вы можете використати методы сериализации pydantic, например:

source: If you want to bind serialized object to the Bot instance, you can use context:
ru: Если вы хотите прив'язати сериализований объект к екземпляра бота, вы можете використати контекст:

source: Deserialization
ru: Десериализация

source: In cases when you need to deserialize Telegram object to Python object, you can use this module.
ru: У випадках, когда вам потрибно перетворити объект Telegram в объект Python, вы можете використати этот модуль.

source: To convert Telegram object to Python object excluding files you can use :func:`litegram.utils.serialization.deserialize_telegram_object_to_python` function.
ru: Для перетворення объекта Telegram в объект Python без врахування файлов вы можете використати функцию :func:`litegram.utils.serialization.deserialize_telegram_object_to_python`.

source: Deserialize telegram object to JSON compatible Python object excluding files.
ru: Десериализуйте объект Telegram в объект Python, сумисний из JSON, без врахування файлов.

source: Parameters
ru: Параметры

source: The telegram object to be deserialized.
ru: Объект Telegram для десериализации.

source: Default bot properties should be passed only if you want to use custom defaults.
ru: Властивости бота по умолчанию потрибно передавати только если вы хотите використати власни значение по умолчанию.

source: Whether to include the API method name in the result.
ru: Чи включати назву методу API в результатт.

source: Returns
ru: Возвращает

source: The deserialized telegram object.
ru: Десериализований объект Telegram.

source: To convert Telegram object to Python object including files you can use :func:`litegram.utils.serialization.deserialize_telegram_object` function, which returns :class:`litegram.utils.serialization.DeserializedTelegramObject` object.
ru: Для перетворення объекта Telegram в объект Python, враховуючи файлы, вы можете використати функцию :func:`litegram.utils.serialization.deserialize_telegram_object`, которая повертае объект :class:`litegram.utils.serialization.DeserializedTelegramObject`.

source: Deserialize Telegram Object to JSON compatible Python object.
ru: Десериализуйте объект Telegram в объект Python, сумисний из JSON.

source: The object to be deserialized.
ru: Объект для десериализации.

source: The deserialized Telegram object.
ru: Десериализований объект Telegram.

source: Represents a dumped Telegram object.
ru: Предсивляе выгружений объект Telegram.

source: The dumped data of the Telegram object.
ru: Виванижени дани об'еки Telegram.

source: The dictionary containing the file names as keys and the corresponding `InputFile` objects as values.
ru: Словник, что содержит имена файлов как ключи и видповидни объекти `InputFile` как значение.
