Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.3.tar.gz/litegram-1.0.3/docs/locale/*/LC_MESSAGES/utils/web_app.po
Languages: ru

source: WebApp
ru: Веб Приложение (WebApp)

source: Telegram Bot API 6.0 announces a revolution in the development of chatbots using WebApp feature.
ru: Telegram Bot API 6.0 произвел революцию в разработке чат-ботов, используя особенности Веб Приложений.

source: You can read more details on it in the official `blog <https://telegram.org/blog/notifications-bots#bot-revolution>`_ and `documentation <https://core.telegram.org/bots/webapps>`_.
ru: Вы можете прочитать больше о это в официальном `блоге <https://telegram.org/blog/notifications-bots#bot-revolution>`_ и `документации <https://core.telegram.org/bots/webapps>`_.

source: `litegram` implements simple utils to remove headache with the data validation from Telegram WebApp on the backend side.
ru: `litegram` реализует простые утилиты для устранения головной боли, предоставляя готовые инструменты проверки данных из Веб Застосунку Telegram на серверной стороне.

source: Usage
ru: Использование

source: For example from frontend you will pass :code:`application/x-www-form-urlencoded` POST request with :code:`_auth` field in body and wants to return User info inside response as :code:`application/json`
ru: Например, из фронтенда вы передадите :code:`application/x-www-form-urlencoded` в POST запросе из полем :code:`_auth` в теле и хотите вернуть информацию о пользователя в ответ как :code:`application/json`

source: Functions
ru: Функции

source: Check incoming WebApp init data signature
ru: Проверка входящей подписи данных инициализации Веб Застосунку

source: Source: https://core.telegram.org/bots/webapps#validating-data-received-via-the-web-app
ru: Источник: https://core.telegram.org/bots/webapps#validating-data-received-via-the-web-app

source: Parameters
ru: Параметры

source: bot Token
ru: Токен бота

source: data from frontend to be validated
ru: дани с фронтенда, что подлежат проверке

source: Returns
ru: Возвращает

source: Parse WebApp init data and return it as WebAppInitData object
ru: Анализ данихи инициализации Веб Застосунку и возврат их как объекта WebAppInitData

source: This method doesn't make any security check, so you shall not trust to this data, use :code:`safe_parse_webapp_init_data` instead.
ru: Этот метод не обеспечивает безопасность, поэтому вам не стоит доверять этим данным, вместо этого используйте :code:`safe_parse_webapp_init_data`.

source: data from frontend to be parsed
ru: дани с frontend для анализу

source: Validate raw WebApp init data and return it as WebAppInitData object
ru: Проверка необроблених данных инициализации Веб Застосунку и возврат их как объекта WebAppInitData

source: Raise :obj:`ValueError` when data is invalid
ru: Выдает :obj:`ValueError`, когда дани недействительны

source: bot token
ru: токен бота

source: data from frontend to be parsed and validated
ru: дани с фронтенда для анализу и проверки

source: Types
ru: Типы

source: This object contains data that is transferred to the Web App when it is opened. It is empty if the Web App was launched from a keyboard button.
ru: Об’ект, что содержит дани которые передаются в Веб Приложение во время его открытия. Он пуст, если Веб Приложение було запущено с помощью кнопки клавиатуры.

source: Source: https://core.telegram.org/bots/webapps#webappinitdata
ru: Источник: https://core.telegram.org/bots/webapps#webappinitdata

source: A unique identifier for the Web App session, required for sending messages via the answerWebAppQuery method.
ru: Уникальный идентификатор сеанса Веб Застосунку, необходим для отправки сообщений через метод answerWebAppQuery.

source: An object containing data about the current user.
ru: Объект, что содержит дани о текущего пользователя.

source: An object containing data about the chat partner of the current user in the chat where the bot was launched via the attachment menu. Returned only for Web Apps launched via the attachment menu.
ru: Объект, что содержит дани о собеседника текущего пользователя в чати, где бот був запущен через меню вкладення. Возвращается только для веб-приложений, запущенных через меню вложений.

source: An object containing data about the chat where the bot was launched via the attachment menu. Returned for supergroups, channels, and group chats – only for Web Apps launched via the attachment menu.
ru: Объект, что содержит дани о чат, в котором бот був запущен через меню вложений. Возвращается для супергрупп, каналов и групповых чатов - только для веб-приложений, запущенных через меню вложений.

source: Type of the chat from which the Web App was opened. Can be either “sender” for a private chat with the user opening the link, “private”, “group”, “supergroup”, or “channel”. Returned only for Web Apps launched from direct links.
ru: Тип чату, с которого було открыто веб-додаток. Може бути как "sender" для частного чату с пользователем, который открыл ссылку, так и "private", "group", "supergroup" или "channel". Возвращается только для веб-програм, запущенных за прямим посиланням.

source: Global identifier, uniquely corresponding to the chat from which the Web App was opened. Returned only for Web Apps launched from a direct link.
ru: Глобальный идентификатор, что уникальний для чату, с которого було открыто веб-програму. Возвращается только для веб-приложений, запущенных за прямим посиланням.

source: The value of the startattach parameter, passed via link. Only returned for Web Apps when launched from the attachment menu via link. The value of the start_param parameter will also be passed in the GET-parameter tgWebAppStartParam, so the Web App can load the correct interface right away.
ru: Значение параметра startattach, переданное через ссылку. Возвращается только для Веб Приложений, когда их запускають из меню вложений за посиланням. Значение параметра start_param також буде передано в GET-параметр tgWebAppStartParam, поэтому Веб Приложение может сразу скачать правильный интерфейс.

source: Time in seconds, after which a message can be sent via the answerWebAppQuery method.
ru: Время в секундах после которого сообщения может бути отправлено за помощью метода answerWebAppQuery.

source: Unix time when the form was opened.
ru: Unix час откриття форми.

source: A hash of all passed parameters, which the bot server can use to check their validity.
ru: Хеш всех переданных параметров, с помощью которого бот-сервер может проверить их валидность.

source: This object contains the data of the Web App user.
ru: Объект что содержит дани пользователя Веб Застосунку.

source: Source: https://core.telegram.org/bots/webapps#webappuser
ru: Источник: https://core.telegram.org/bots/webapps#webappuser

source: A unique identifier for the user or bot. This number may have more than 32 significant bits and some programming languages may have difficulty/silent defects in interpreting it. It has at most 52 significant bits, so a 64-bit integer or a double-precision float type is safe for storing this identifier.
ru: Уникальный идентификатор пользователя или бота. Це число может мати больше 32 значимых битов, и деяки языки программирования могут мати трудности в его интерпретации. Он имеет щонайбильше 52 значущи бити, поэтому 64-битне целое число или тип с плаваючою точнистю подвийнои точности является безопасным для хранения этого идентификатора.

source: True, if this user is a bot. Returns in the receiver field only.
ru: True, если этот пользователь бот. Повертается только в поли отримувача(receiver).

source: First name of the user or bot.
ru: Ім'я пользователя или бота.

source: Last name of the user or bot.
ru: Фамилия пользователя или бота.

source: Username of the user or bot.
ru: Ник пользователя или бота.

source: IETF language tag of the user's language. Returns in user field only.
ru: Языковой тег IETF языки пользователя. Повертается только в поли пользователя(user).

source: True, if this user is a Telegram Premium user.
ru: True, если этой пользователь имеет подписку Telegram Premium.

source: True, if this user added the bot to the attachment menu.
ru: True, если этой пользователь кдав бота к меню вложений.

source: True, if this user allowed the bot to message them.
ru: True, если этой пользователь кзволив надсилати йому повикмлення.

source: URL of the user’s profile photo. The photo can be in .jpeg or .svg formats. Only returned for Web Apps launched from the attachment menu.
ru: URL-адреса фотографии профилю пользователя. Фотография может бути в форматах .jpeg или .svg. Возвращается только для Веб Приложений, запущенных из меню вложений.

source: This object represents a chat.
ru: Объект чату.

source: Source: https://core.telegram.org/bots/webapps#webappchat
ru: Источник: https://core.telegram.org/bots/webapps#webappchat

source: Unique identifier for this chat. This number may have more than 32 significant bits and some programming languages may have difficulty/silent defects in interpreting it. But it has at most 52 significant bits, so a signed 64-bit integer or double-precision float type are safe for storing this identifier.
ru: Уникальный идентификатор этого чату. Це число может мати больше 32 значимых битов, и деяки языки программирования могут мати трудности в его интерпретации. Он имеет щонайбильше 52 значущи бити, поэтому 64-битне целое число или тип с плаваючою точкою подвийнои точности является безопасным для хранения этого идентификатора.

source: Type of chat, can be either “group”, “supergroup” or “channel”
ru: Тип чату, может бути "group", "supergroup" или "channel"

source: Title of the chat
ru: Название чату

source: Username of the chat
ru: Ник пользователя или бота

source: URL of the chat’s photo. The photo can be in .jpeg or .svg formats. Only returned for Web Apps launched from the attachment menu.
ru: URL-адреса фотографии чату. Фотография может бути в форматах .jpeg или .svg. Возвращается только для Веб Приложений, запущенных из меню вложений.
