Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.4.tar.gz/litegram-1.0.4/docs/locale/*/LC_MESSAGES/dispatcher/filters/index.po
Languages: ru

source: Filtering events
ru: Фильтрування событий

source: Builtin filters
ru: Вбуквани фильтри

source: Here is list of builtin filters:
ru: Ось список вбукваних фильтрив:

source: Writing own filters
ru: Написання власних фильтрив

source: Filters can be:
ru: Фильтри бувають:

source: Asynchronous function (:code:`async def my_filter(*args, **kwargs): pass`)
ru: Асинхронною функциею (:code:`async def my_filter(*args, **kwargs): pass`)

source: Synchronous function (:code:`def my_filter(*args, **kwargs): pass`)
ru: Синхронною функциею (:code:`def my_filter(*args, **kwargs): pass`)

source: Anonymous function (:code:`lambda event: True`)
ru: Анонимною функциею (:code:`lambda event: True`)

source: Any awaitable object
ru: Будь-которым очикуваним объектом (awaitable object, объект, который может бути використаний в :code:`await` вирази)

source: Subclass of :class:`litegram.filters.base.Filter`
ru: Пидкласом :class:`litegram.filters.base.Filter`

source: Instances of :ref:`MagicFilter <magic-filters>`
ru: Екземпляром :ref:`MagicFilter <magic-filters>`

source: and should return bool or dict. If the dictionary is passed as result of filter - resulted data will be propagated to the next filters and handler as keywords arguments.
ru: и имеет повертати bool или dict. Якщо словник передаеться как результат фильтра, отримани дани будуть передани к наступних фильтрив и обробника как аргументи ключових слив.

source: Base class for own filters
ru: Базовий клас для власних фильтрив

source: If you want to register own filters like builtin filters you will need to write subclass of this class with overriding the :code:`__call__` method and adding filter attributes.
ru: Якщо Ви хотите зарееструвати власни фильтри, как вбудовани фильтри, Вам потрибно буде написати пидклас этого класу с заминою методу :code:`__call__` и додаванням атрибутив фильтра.

source: This method should be overridden.
ru: Этот метод следует перевизначити.

source: Accepts incoming event and should return boolean or dict.
ru: Приймае вхидну подию и имеет поверити логичне (bool) значение или dict.

source: Returns
ru: Возвращает

source: Also if you want to extend handler flags with using this filter you should implement this method
ru: Крим того, если вы хотите розширити маркери обробника (handler) за помощью этого фильтра, вам следует реализувати этот метод

source: Parameters
ru: Параметры

source: existing flags, can be updated directly
ru: иснуючи маркери, можна оновити непосредственно

source: Own filter example
ru: Пример власного фильтра

source: For example if you need to make simple text filter:
ru: Например, если Вам потрибно створити простий текстовий фильтр:

source: Combining Filters
ru: Комбинування фильтрив

source: In general, all filters can be combined in two ways
ru: Взагалом, уси фильтри можна комбинувати двома способами

source: Recommended way
ru: Рекоменкваний спосиб

source: If you specify multiple filters in a row, it will be checked with an "and" condition:
ru: Якщо Ви вкажете килька фильтрив поспиль, это буде проверено умовою "and" :

source: Also, if you want to use two alternative ways to run the same handler ("or" condition) you can register the handler twice or more times as you like
ru: Крим того, если вы хотите использовать два альтернативни способи запуску одного обробника (умова "or"), вы можете зарееструвати обробник двичи или больше разив, как вам подобаеться

source: Also sometimes you will need to invert the filter result, for example you have an *IsAdmin* filter and you want to check if the user is not an admin
ru: Також иногда Вам потрибно буде инвертувати результат фильтра, например, в вас является фильтр *IsAdmin* и вы хотите проверить, чи пользователь не является администратором

source: Another possible way
ru: Інший можливий спосиб

source: An alternative way is to combine using special functions (:func:`and_f`, :func:`or_f`, :func:`invert_f` from :code:`litegram.filters` module):
ru: Альтернативним способом является об’еднання с помощью специальних функций (:func:`and_f`, :func:`or_f`, :func:`invert_f` с модуля :code:`litegram.filters`):
