Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.9.tar.gz/litegram-1.0.9/docs/locale/*/LC_MESSAGES/dispatcher/dependency_injection.po
Languages: ru

source: Dependency injection
ru: Внедрение зависимостей

source: Dependency injection is a programming technique that makes a class independent of its dependencies. It achieves that by decoupling the usage of an object from its creation. This helps you to follow `SOLID's <https://en.wikipedia.org/wiki/SOLID>`_ dependency inversion and single responsibility principles.
ru: Внедрение зависимостей — это техника программирования, которая делает классы независимыми от их зависимостей. Оно достигается путем отделения использования объекта от его создания. Это помогает соблюдать принципы инверсии зависимостей и единой ответственности по SOLID.

source: How it works in litegram
ru: Как это работает в litegram

source: For each update :class:`litegram.dispatcher.dispatcher.Dispatcher` passes handling context data. Filters and middleware can also make changes to the context.
ru: Для каждого обновления :class:`litegram.dispatcher.dispatcher.Dispatcher` передает данные контекста обработки. Фильтры и промежуточное ПО также могут вносить изменения в контекст.

source: To access contextual data you should specify corresponding keyword parameter in handler or filter. For example, to get :class:`litegram.fsm.context.FSMContext` we do it like that:
ru: Чтобы получить доступ к контекстным данным, вы должны указать соответствующий ключевой параметр в обработчике или фильтре. Например, чтобы получить :class:`litegram.fsm.context.FSMContext`, мы делаем это так:

source: Injecting own dependencies
ru: Внедрение собственных зависимостей

source: Litegram provides several ways to complement / modify contextual data.
ru: Litegram предоставляет несколько способов дополнения/модификации контекстных данных.

source: The first and easiest way is to simply specify the named arguments in :class:`litegram.dispatcher.dispatcher.Dispatcher` initialization, polling start methods or :class:`litegram.webhook.litestar_server.SimpleRequestHandler` initialization if you use webhooks.
ru: Первый и самый простой способ — это просто указать именованные аргументы во время инициализации :class:`litegram.dispatcher.dispatcher.Dispatcher`, запуска методов опроса или инициализации :class:`litegram.webhook.litestar_server.SimpleRequestHandler`, если вы используете вебхуки.

source: Analogy for webhook:
ru: Аналогия для вебхука:

source: :class:`litegram.dispatcher.dispatcher.Dispatcher`'s workflow data also can be supplemented by setting values as in a dictionary:
ru: Данные рабочего процесса :class:`litegram.dispatcher.dispatcher.Dispatcher` также могут дополняться путем установки значений, как в словаре:

source: The middlewares updates the context quite often. You can read more about them on this page:
ru: Промежуточное ПО достаточно часто обновляет контекст. Вы можете прочитать об этом больше на этой странице:

source: The last way is to return a dictionary from the filter:
ru: Последний способ — вернуть словарь из фильтра:

source: ...or using :ref:`MagicFilter <magic-filters>` with :code:`.as_(...)` method.
ru: ...или используя :ref:`MagicFilter <magic-filters>` с методом :code:`.as_(...)`.

source: Using type hints
ru: Использование аннотаций типов

source: Type-hinting middleware data is optional and is not required for the correct operation of the dispatcher. However, it is recommended to use it to improve the readability of the code.
ru: Использование аннотаций типов для данных промежуточного ПО необязательно и не требуется для корректной работы диспетчера. Однако рекомендуется использовать их для улучшения читаемости кода.

source: You can use type hints to specify the type of the context data in the middlewares, filters and handlers.
ru: Вы можете использовать аннотации типов для определения типа контекстных данных в промежуточном ПО, фильтрах и обработчиках.

source: The default middleware data typed dict can be found in :class:`litegram.dispatcher.middlewares.data.MiddlewareData`.
ru: Словарь типов данных по умолчанию для промежуточного ПО можно найти в :class:`litegram.dispatcher.middlewares.data.MiddlewareData`.

source: In case when you have extended the context data, you can use the :class:`litegram.dispatcher.middlewares.data.MiddlewareData` as a base class and specify the type hints for the new fields.
ru: В случае если вы расширили данные контекста, вы можете использовать :class:`litegram.dispatcher.middlewares.data.MiddlewareData` как базовый класс и указать аннотации типов для новых полей.

source: If you using type checking tools like mypy, you can experience warnings about that this type hint against Liskov substitution principle in due stricter type is not a subclass of :code:`dict[str, Any]`. This is a known issue and it is not a bug. You can ignore this warning or use :code:`# type: ignore` comment.
ru: Если вы используете инструменты проверки типов, такие как mypy, вы можете получить предупреждение о том, что эти аннотации типов нарушают принцип подстановки Лисков из-за того, что более строгий тип не является подклассом :code:`dict[str, Any]`. Это известная проблема, и она не является ошибкой. Вы можете проигнорировать это предупреждение или использовать комментарий :code:`# type: ignore`.

source: Example of using type hints:
ru: Пример использования аннотаций типов:

source: Available context data type helpers
ru: Доступные помощники для типов контекстных данных

source: Data passed to the handler by the middlewares.
ru: Данные, передаваемые обработчику промежуточным ПО.

source: You can add your own data by extending this class.
ru: Вы можете добавить собственные данные, расширив этот класс.

source: I18n related data.
ru: Данные, связанные с I18n.

source: Is not included by default, you need to add it to your own Data class if you need it.
ru: По умолчанию не включено, вам нужно добавить это в собственный класс данных, если это необходимо.

source: I18n object.
ru: Объект I18n.

source: I18n middleware.
ru: Промежуточное ПО для I18n.
