Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.9.tar.gz/litegram-1.0.9/docs/locale/*/LC_MESSAGES/dispatcher/router.po
Languages: ru

source: Router
ru: Маршрутизатор

source: Router can route update, and it nested update types like messages, callback query, polls and all other event types.
ru: Маршрутизатор может маршрутизировать события, а также вложенные типы обновлений, такие как сообщения, запросы обратного вызова, опросы и все другие типы событий.

source: Event handlers can be registered in observer by two ways:
ru: Обработчики событий могут быть зарегистрированы в обсервере двумя способами:

source: By observer method - :obj:`router.<event_type>.register(handler, <filters, ...>)`
ru: С помощью метода обсервера - :obj:`router.<event_type>.register(handler, <filters, ...>)`

source: By decorator - :obj:`@router.<event_type>(<filters, ...>)`
ru: С помощью декоратора - :obj:`@router.<event_type>(<filters, ...>)`

source: Parameters
ru: Параметры

source: Optional router name, can be useful for debugging
ru: Дополнительное имя маршрутизатора, может быть полезно для отладки

source: Attach another router.
ru: Подключение маршрутизатора.

source: Returns
ru: Возвращает

source: Event observers
ru: Обсерверы событий

source: All handlers always should be asynchronous. The name of the handler function is not important. The event argument name is also not important but it is recommended to not overlap the name with contextual data in due to function can not accept two arguments with the same name.
ru: Все обработчики всегда должны быть асинхронными. Имя функции обработки не имеет значения. Название аргумента события также не важно, но рекомендуется не перекрывать название данными контекста, так как функция не может принимать два аргумента с одинаковым названием.

source: Here is the list of available observers and examples of how to register handlers
ru: Вот список доступных обсерверов и примеры того, как зарегистрировать обработчики

source: In these examples only decorator-style registering handlers are used, but if you don't like @decorators just use :obj:`<event type>.register(...)` method instead.
ru: В этих примерах используются только обработчики регистрации в стиле декоратора, но если вам не нравятся @декораторы, просто используйте метод :obj:`<event type>.register(...)`.

source: Message
ru: Сообщение

source: Be attentive with filtering this event
ru: Будьте внимательны при фильтрации этого события

source: You should expect that this event can be with different sets of attributes in different cases
ru: Вам следует ожидать, что это событие может иметь разные наборы атрибутов в разных случаях

source: (For example text, sticker and document are always of different content types of message)
ru: (Например, текст, стикер и документ всегда имеют разные типы содержимого)

source: Recommended way to check field availability before usage, for example via :ref:`magic filter <magic-filters>`: :code:`F.text` to handle text, :code:`F.sticker` to handle stickers only and etc.
ru: Рекомендуемый способ проверить наличие полей перед использованием, например, с помощью :ref:`magic filter <magic-filters>`: :code:`F.text` для обработки текста, :code:`F.sticker` для обработки только стикеров и т. д.

source: Edited message
ru: Отредактированное сообщение

source: Channel post
ru: Пост в канале

source: Edited channel post
ru: Отредактированный пост в канале

source: Inline query
ru: Inline запрос

source: Chosen inline query
ru: Выбранный результат inline запроса

source: Callback query
ru: Запрос обратного вызова (callback query)

source: Shipping query
ru: Запрос доставки (shipping query)

source: Pre checkout query
ru: Запрос перед оформлением заказа (pre checkout query)

source: Poll
ru: Опрос

source: Poll answer
ru: Ответ в опросе

source: Errors
ru: Ошибки

source: Nested routers
ru: Вложенные маршрутизаторы

source: Routers by the way can be nested to an another routers with some limitations:
ru: Кстати, маршрутизаторы могут быть вложены в другие маршрутизаторы с некоторыми ограничениями:

source: 1. Router **CAN NOT** include itself 1. Routers **CAN NOT** be used for circular including (router 1 include router 2, router 2 include router 3, router 3 include router 1)
ru: 1. Маршрутизатор **НЕ МОЖЕТ** включать сам себя 2. Маршрутизаторы **НЕ МОГУТ** использоваться для циклического включения (маршрутизатор 1 включает маршрутизатор 2, маршрутизатор 2 включает маршрутизатор 3, маршрутизатор 3 включает маршрутизатор 1)

source: Example:
ru: Пример:

source: Update
ru: Обновление

source: How it works?
ru: Как это работает?

source: For example, dispatcher has 2 routers, the last router also has one nested router:
ru: Например, у диспетчера есть 2 маршрутизатора, при этом у последнего маршрутизатора также есть один вложенный маршрутизатор:

source: Nested routers example
ru: Пример вложенных маршрутизаторов

source: In this case update propagation flow will have form:
ru: В этом случае поток распространения обновления будет иметь вид:
