Repository: pypi-data/pypi-mirror-402
Catalog: packages/localcosmos-app-kit/localcosmos_app_kit-0.9.16-py3-none-any.whl/app_kit/locale/*/LC_MESSAGES/django.po
Languages: de

source: Range traits need a unit, e.g. "cm". Found empty cell instead.
de: Merkmale vom Typ Zahlenintervall benötigen eine Einheit, z.B. "cm". Stattdessen wurde eine leere Zelle gefunden.

source: Invalid value. Range traits need a step which defines the intervals of the slider, e.g. "0.5"
de: Ungültiger Wert. Merkmale vom Typ Zahlenintervall benötigen eine Schrittweite, die das Intervall des Sliders definiert, z.B. "0.5"

source: You defined a taxonomic filter in {0}, but the sheet {1} was not found.
de: Es wurde in {0} einen Taxonomischen Filter definiert, aber das Blatt {1} wurde nicht gefunden.

source: Invalid %(trait_type)s value: %(range_value)s.
de: Ungültiger Wert für %(trait_type)s: %(range_value)s.

source: Length of value is too long: %(value)s. Maximum length is %(max_length)s
de: Zu langer Wert: %(value)s. Die maximale Länge ist %(max_length)s

source: You defined a Colors trait, but no Colors sheet found.
de: Es wurde ein Merkmal vom Typ Farbe definiert, aber das Blatt 'Colors' wurde nicht gefunden.

source: No color name found
de: Kein Name für die Farbe gefunden

source: No background color found in cell
de: Keine Hintergrundfarbe für die Zelle gefunden

source: [%(filepath)s] invalid image size: %(image_width)s x %(image_height)s. Expected %(expected_width)s x %(expected_height)s.
de: [%(filepath)s] Ungültige Bildgröße: %(image_width)s x %(image_height)s. Erwarte %(expected_width)s x %(expected_height)s.

source: [%(filepath)s] Invalid image file format: %(file_format)s
de: [%(filepath)s] Bilddatei in ungültigem Format: %(file_format)s

source: Enable observation button
de: Button für Beobachtungsmeldung aktivieren

source: Include only taxon profiles from Nature Guides
de: Nur Artensteckbriefe einbeziehen, deren Art in einem Naturführer vorkommt

source: Enable Taxonomic Navigation
de: Taxonomische Navigation aktivieren

source: Name of the text content, acts as heading
de: Name des Textinhaltes, fungiert als Überschrift

source: E.g. habitat. IMPORTANT: changing this affects all texts of this type.
de: z.B. Lebensraum. WICHTIG: Änderung betrifft alle Texte dieses Typs.

source: Name of the category
de: Name der Kategorie

source: This taxon already exists in your navigation
de: Dieses Taxon existiert bereits in deiner Navigation

source: Adding of taxa below genus is not supported
de: Taxa unterhalb von Genus können nicht hinzugefügt werden

source: This taxon is not a valid descendant of the parent navigation entry
de: Dieses Taxon ist kein Untertaxon des übergeordneten Navigationseintrages

source: This taxon is not a valid parent at this point in the navigation
de: Dieses Taxon ist kein übergeordnetes Taxon der darunterliegenden Navigation

source: Search for target parent navigation entry
de: Suche nach Zieleintrag der Navigation

source: The selected target parent does not exist
de: Der gewählte Eintrag existiert nicht.

source: Text Types
de: Text Typen

source: Name of the text set
de: Name der Textauswahl

source: Select Text Set
de: Textauswahl wählen

source: Select a text set to apply to this taxon profile.
de: Lege eine Textauswahl fest, die für diesen Artensteckbrief gilt.

source: A morphotype profile with this morphotype already exists for this taxon.
de: Ein Morphotypen-Steckbrief existiert bereits für diesen Morphotypen

source: Select Target Section
de: Wähle neue Sektion

source: Select the section to which you want to move the image.
de: Wähle die Sektion, zu der du dieses Bild verschieben willst.

source: Taxon profiles
de: Artensteckbriefe

source: Taxon Profiles
de: Artensteckbriefe

source: Taxon Profiles Navigation Entry Taxon
de: Taxon dieses Navigationselements

source: no profile
de: Kein Artensteckbrief vorhanden

source: Change publication status of all taxon profiles of %(name)s
de: Veröffentlichung aller Artensteckbriefe von %(name)s ändern

source: Change publication status of %(navigation_entry)s
de: Veröffentlichung von %(navigation_entry)s ändern

source: Change publication status of %(taxon_profile)s
de: Veröffentlichung von %(taxon_profile)s ändern

source: Images from taxonomic collection
de: Bilder aus taxonomischer Sammlung

source: Images from nature guides
de: Bilder aus Naturführern

source: Images manually added to this profile
de: Bilder, die manuell zu diesem Steckbrief hinzugefügt wurden

source: primary image
de: primäres Bild

source: Move to section
de: Nach Sektion verschieben

source: No images found.
de: Keine Bilder gefunden.

source: No traits found.
de: Keine Merkmale gefunden.

source: Create profile for %(taxon)s
de: Steckbrief für %(taxon)s erstellen

source: The profile for %(taxon)s does not exist. Do you want to create it now?
de: Der Artensteckbrief von %(taxon)s existiert nicht. Willst du ihn jetzt anlegen?

source: Create taxon profile
de: Artensteckbrief erstellen

source: WARNING: Deleting %(name)s will delete ALL text content associated with %(name)s. This cannot be undone. If you only want to remove the %(name)s information for one taxon, erase only the text field of that taxon.
de: WARNUNG: Das Löschen von %(name)s wird ALLE Textinhalte, die zu %(name)s gehören, löschen. Dies kann nicht Rückgängig gemacht werden. Wenn du nur den Text eines Taxons bezüglich %(name)s löschen willst, leere einfach nur das taxonspezifische Textfeld.

source: Do you really want to delete %(name)s and all content associated with it?
de: Willst du wirklich %(name)s und alle zugehörigen Texte löschen?

source: Manage navigatoin entry
de: Navigationseintrag bearbeiten

source: Create navigation entry
de: Navigationseintrag erstellen

source: Navigation entry saved.
de: Navigationseintrag gespeichert

source: short version
de: kurze Version

source: long version
de: lange Version

source: Successfully saved texts.
de: Texte erfolgreich gespeichert.

source: Save texts
de: Texte speichern

source: Manage Taxon Profile Morphotype
de: Morphotypen bearbeiten

source: Manage Taxon Text Set
de: Textauswahl bearbeiten

source: Create Taxon Text Set
de: Textauswahl erstellen

source: Add new text type
de: Neuen Texttyp hinzufügen

source: Add new text category
de: Neuen Kategorie hinzufügen

source: Move Image
de: Bild verschieben

source: %(navigation_entry)s has been moved to %(new_parent)s.
de: %(navigation_entry)s wurde nach %(new_parent)s verschoben

source: draft
de: Entwurf

source: no taxon set
de: kein Taxon gesetzt

source: remove
de: entfernen

source: No taxon yet.
de: kein Taxon gesetzt

source: add taxon
de: Taxon hinzufügen

source: Attached Taxon Profiles of %(name)s
de: Zu %(name)s zugehörige Artensteckbriefe

source: Text set updated successfully.
de: Textauswahl erfolgreich aktualisiert.

source: Create subentry
de: Untereintrag erstellen

source: Change publication status
de: Veröffentlichung ändern

source: Show attached Taxon Profiles
de: Zugehörige Artensteckbriefe anzeigen

source: Add image
de: Bild bearbeiten

source: Move to different parent
de: In anderes Elternelement verschieben

source: Manage category order
de: Reihenfolge der Kategorien bearbeiten

source: Text Sets
de: Textauswahlen

source: Create new text set
de: Neue Textauswahl erstellen

source: does not occur in any nature guide
de: kommt in keinem Naturführer vor

source: not linked to any taxonomic source
de: mit keiner taxonomischen Quelle verbunden

source: This profile has possible duplicates
de: Dieser Steckbrief hat mögliche Duplikate

source: manage tags
de: Tags bearbeiten

source: Morphotypes
de: Morphotypen

source: No morphotypes available.
de: Keine Morphotypen verfügbar

source: Classification
de: Klassifikation

source: Taxonomic Navigation
de: Taxonomische Navigation

source: Traits
de: Merkmale

source: Images
de: Bilder

source: Add image with text
de: Bild mit Text hinzufügen

source: Text Set
de: Textauswahl

source: Template Contents
de: Template Inhalte

source: This taxon is linked to the following Template Contents:
de: Dieses Taxon ist mit folgenden Template Inhalten verbunden:

source: published
de: veröffentlicht

source: No template contents found.
de: Keine Template Inhalte gefunden.

source: Back to %(name)s
de: zurück zu %(name)s

source: add toplevel navigation entry
de: Toplevel Navigationseintrag hinzufügen

source: Create your taxon profiles
de: Artensteckbriefe erstellen

source: Type the name of the taxon you want to manage the profile for or select a taxon from your nature guides.
de: Gib den Namen desjenigen Taxons ein, dessen Artensteckbrief du bearbeiten willst oder wähle ein Taxon aus deinen Naturführern.

source: Taxa from nature guides
de: Taxa aus Naturführern

source: Change publication of all taxon profiles of %(name)s
de: Veröffentlichung aller Artensteckbriefe von %(name)s ändern

source: Identification results with taxonomic reference
de: Bestimmungsergebnis mit taxonomischer Referenz

source: no taxa found
de: kein Taxon gefunden

source: Identification results without taxonomic reference
de: Bestimmungsergebnisse ohne taxonomische Referenz

source: It is recommended to link a taxonomic reference first.
de: Es wird empfohlen zuerst eine taxonomische Referenz hinzuzufügen

source: Taxon Profiles with no occurrence in any nature guide
de: Artensteckbriefe deren Arten nich in Naturführern vorkommen

source: not included in app
de: nicht in der App enthalten

source: Backbone taxa without profile
de: Backbone Taxa ohne Steckbrief

source: Add text
de: Text hinzufügen

source: Cell content has to be "Scientific name", not %(cell_value)s
de: Zellinhalt muss "Scientific name" sein, nicht %(cell_value)s

source: Cell content has to be "Author (optional)", not %(cell_value)s
de: Zellinhalt muss "Author (optional)" sein, nicht %(cell_value)s

source: Cell content has to be "Taxonomic source", not %(cell_value)s
de: Zellinhalt muss "Taxonomic source" sein, nicht %(cell_value)s

source: Cell content has to be "Morphotype (optional)", not %(cell_value)s
de: Zellinhalt muss "Morphotype (optional)" sein, nicht %(cell_value)s

source: Cell content has to be one of %(column_types)s. Found %(cell_value)s instead
de: Der Zellinhalt muss eines von %(column_types)s sein, nicht %(cell_value)s

source: Cell content has to be one of %(valid_choices)s. Found %(cell_value)s instead
de: Der Zellinhalt muss eines von %(valid_choices)s sein, nicht %(cell_value)s

source: Cell content has to be a taxonomic source, found empty cell instead
de: Der Zellinhalt muss eine taxonomische Quelle sein; stattdessen wurde eine leere Zelle gefunden.

source: Name of your app
de: Name deiner App

source: In the primary language
de: In der Primärsprache

source: The language the app is created in. Translations can be made later.
de: Die Sprache in der deiner App erstellt wird. Übersetzungen können später angefertigt werden.

source: Your app will be available at subdomain.localcosmos.org, where "subdomain" is the name you configured here.
de: Deine App wird unter subdomain.localcosmos.org erreichbar sein, wobei "subdomain" der Name ist, den du hier einstellst.

source: An app with this name already exists.
de: Eine App mit diesem Namen existiert bereits.

source: Select language
de: Sprache wählen

source: Allow unregistered users to report observations
de: Erlaube das anonyme Melden von Beobachtungen

source: Only applies if your app contains observation forms.
de: Dies hat nur Auswirkungen, wenn deine App ein Beobachtungsformular enthält.

source: I run my own Local Cosmos Server
de: Ich betreibe meinen eigenen Local Cosmos Server

source: API URL of your private Local Cosmos Server
de: URL der API deines privaten Local Cosmos Servers

source: Only applies if you run your own Local Cosmos Server.
de: Nur notwendig, wenn du eigenen Local Cosmos Server betreibst.

source: Platforms
de: Platformen

source: publish
de: veröffentlichen

source: Missing spreadsheet file. Expected one of these files: %(files)s
de: Tabellen-Datei fehlt. Erwarte eine der folgenden Dateien: %(files)s

source: Image file "%(image_filename)s" not found in the "%(images_sheet_name)s" sheet.
de: Die Bilddatei "%(image_filename)s" wurde in "%(images_sheet_name)s" nicht gefunden

source: Expected media type "%(expected_media_type)s", found "%(actual_media_type)s"
de: Es wurde "%(expected_media_type)s" erwartet, "%(actual_media_type)s" wurde gefunden

source: Cell content has to be an author, found empty cell instead
de: Der Zellinhalt muss ein Autor sein. Stattdessen wurde eine leere Zelle gefunden.

source: Cell content has to be "Identifier", not %(cell_value)s
de: Zellinhalt muss "Identifier" sein, nicht %(cell_value)s

source: Cell content has to be "Author", not %(cell_value)s
de: Zellinhalt muss "Author" sein, nicht %(cell_value)s

source: Cell content has to be "Licence", not %(cell_value)s
de: Zellinhalt muss "Licence" sein, nicht %(cell_value)s

source: Cell content has to be "Licence version", not %(cell_value)s
de: Zellinhalt muss "Licence version" sein, nicht %(cell_value)s

source: Cell content has to be "Link to source image (optional)", not %(cell_value)s
de: Zellinhalt muss "Link to source image (optional)" sein, nicht %(cell_value)s

source: Cell content has to be "Title (optional)", not %(cell_value)s
de: Zellinhalt muss "Title (optional)" sein, nicht %(cell_value)s

source: Cell content has to be "Caption (optional)", not %(cell_value)s
de: Zellinhalt muss "Caption (optional)" sein, nicht %(cell_value)s

source: Cell content has to be "Alt text (optional)", not %(cell_value)s
de: Zellinhalt muss "Alt text (optional)" sein, nicht %(cell_value)s

source: Cell content has to be "Primary image (optional)", not %(cell_value)s
de: Zellinhalt muss "Primary image (optional)" sein, nicht %(cell_value)s

source: Cell content has to be "URL", not %(cell_value)s
de: Zellinhalt muss "URL" sein, nicht %(cell_value)s

source: Cell content has to be "Media type", not %(cell_value)s
de: Zellinhalt muss "Media type" sein, nicht %(cell_value)s

source: Cell content has to be "Title", not %(cell_value)s
de: Zellinhalt muss "Title" sein, nicht %(cell_value)s

source: Cell content has to be "Licence (optional)", not %(cell_value)s
de: Zellinhalt muss "Licence (optional)" sein, nicht %(cell_value)s

source: Cell content has to be a URL, found empty cell instead
de: Der Zellinhalt muss eine URL sein. Stattdessen wurde eine leere Zelle gefunden.

source: Cell content has to be a Media type, found empty cell instead
de: Der Zellinhalt muss ein Medientyp sein. Stattdessen wurde eine leere Zelle gefunden

source: Cell content has to be a Title, found empty cell instead
de: Der Zellinhalt muss ein Titel sein. Stattdessen wurde eine leere Zelle gefunden

source: [%(filename)s][Sheet:%(sheet_name)s][cell:%(column)s%(row)s] %(message)s
de: [%(filename)s][Blatt:%(sheet_name)s][Zelle:%(column)s%(row)s] %(message)s

source: [%(filename)s][Sheet:%(sheet_name)s][row:%(row)s] %(message)s
de: [%(filename)s][Blatt:%(sheet_name)s][Zeile: %(row)s] %(message)s

source: %(taxon_latname)s %(taxon_author)s not found in %(taxon_source)s. Tolerance of two space characters was applied.
de: %(taxon_latname)s %(taxon_author)s nicht in %(taxon_source)s gefunden. Einer Toleranz von 2 Leerzeichen wurde angewendet.

source: Multiple results found for %(taxon_latname)s %(taxon_author)s in %(taxon_source)s. Tolerance of two space characters was applied.
de: Mehrere Ergebnisse für %(taxon_latname)s %(taxon_author)s in %(taxon_source)s gefunden. eine Toleranz von 2 Leerzeichen wurde angewendet.

source: %(taxon_latname)s not found in %(taxon_source)s
de: %(taxon_latname)s nicht in %(taxon_source)s gefunden

source: Multiple results found for %(taxon_latname)s %(taxon_author)s in %(taxon_source)s
de: Mehrere Ergebnisse für %(taxon_latname)s %(taxon_author)s in %(taxon_source)s gefunden

source: Multiple results found for %(taxon_latname)s in %(taxon_source)s. You have to specify an author.
de: Mehrere Ergebnisse für %(taxon_latname)s in %(taxon_source)s gefunden. Du musst einen Autor angeben.

source: Image is not square: %(filename)s
de: Bild nicht quadratisch: %(filename)s

source: failing
de: scheitert

source: passing
de: klappt

source: build in progress
de: Bau im Gange

source: validation in progress
de: Validierung im Gange

source: valid
de: valide

source: warnings
de: Warnungen

source: errors
de: Fehler

source: I want to delete my account. I am aware that this cannot be undone.
de: Ich möchte meinen Account löschen. Ich bin mir bewusst, dass das nicht Rückgängig gemacht werden kann.

source: First name and surname
de: Vor- und Nachname

source: Your app kit will be available at subdomain.localcosmos.org, where "subdomain" is the name you configured here.
de: Dein App Kit wird unter subdomain.localcosmos.org erreichbar sein. "subomdain" ist dabei der hier eingegebene Name.

source: Contact us
de: Kontakt

source: Your message has been sent and we will reply to you as soon as possible. Thank you for your interest in Local Cosmos.
de: Deine Nachricht wurde gesendet und wir werden uns so bald wie möglich bei dir melden. Vielen Dank für dein Interesse an Local Cosmos.

source: Send
de: Abschicken

source: Delete account
de: Account löschen

source: Deleting your account will remove all references to you as a person from our databases and files. This cannot be undone.
de: Wenn du deinen Account löschst, werden alle Verweise auf dich als Person aus unserer Datenbank gelöscht, sowie alle Bilder gelöscht. Dies kann nicht Rückgängig gemacht werden.

source: Edit your account
de: Account bearbeiten

source: Successfuly saved your account.
de: Dein Account wurde erfolgreich gespeichert.

source: My profile
de: Mein Profil

source: Username
de: Benutzername

source: First name
de: Vorname

source: Surname
de: Nachname

source: Joined
de: Beigetreten am

source: Edit profile
de: Profil bearbeiten

source: Change password
de: Passwort ändern

source: Your app kit is being created. This may take a few minutes.
de: Dein App Kit wird gerade erstellt. Dies kann mehrere Minuten dauern.

source: Create app kit
de: App Kit erstellen

source: Sign out
de: abmelden

source: Sign in
de: anmelden

source: Projects
de: Projekte

source: select the app you want to work on
de: wählen die App, an der du arbeiten willst

source: Legal notice
de: Impressum

source: Privacy
de: Privatsphäre

source: This name already exists
de: Dieser Name existiert bereits

source: Taxon %(taxon)s has changed its position in %(tree)s
de: Taxon %(taxon)s hat seine Position in %(tree)s geändert

source: Taxon %(taxon)s found multiple times in %(tree)s
de: Taxon %(taxon)s wurde %(tree)s mehrfach gefunden

source: Taxon %(taxon)s not found as accepted name, but as synonym of %(accepted_name)s
de: Taxon %(taxon)s wurde nicht als akzeptierter Name, sondern als Synonym von %(accepted_name)s gefunden

source: Taxon %(taxon)s not found in %(tree)s
de: Taxon %(taxon)s nicht in %(tree)s gefunden

source: manually added
de: manuell hinzugefügt

source: A taxon with this language-independent name already exists.
de: Eine Taxon mit diesem Namen existiert bereits.

source: Move to
de: nach unten

source: Successfully saved taxon.
de: Taxon erfolgreich gespeichert.

source: Add root taxon
de: Wurzeltaxon hinzufügen

source: Load children
de: lade nächste Ebene

source: Add child
de: Untertaxon hinzufügen

source: move
de: verschieben

source: Move %(name)s
de: %(name)s verschieben

source: Successfully moved taxon.
de: Taxon erfolgreich verschoben

source: Move
de: verschieben

source: Manage vernacular name
de: Trivialnamen bearbeiten

source: Create vernacular name
de: Trivialnamen erstellen

source: Your changes have been saved.
de: Die Änderungen wurden gespeichert.

source: No children found for this taxon.
de: kein Untertaxa für dieses Taxon gefunden.

source: clear
de: zurücksetzen

source: Successfully added the following to your app:
de: Folgendes wurde erfolgreich zu deiner App hinzugefügt:

source: Add existing %(name)s
de: Bestehende %(name)s hinzufügen

source: Delete %(meta_app)s
de: %(meta_app)s löschen

source: Rename %(meta_app)s
de: %(meta_app)s umbenennen

source: Visit app admin
de: zum App admin

source: Download web app
de: Webapp herunterladen

source: visit web app
de: zur WebApp

source: Download .aab
de: .aab herunterladen

source: Download .ipa
de: .ipa herunterladen

source: published version
de: veröffentlichte Version

source: App limit reached
de: App Limit erreicht

source: You are not allowed to create any more apps.
de: Du kannst keine weiteren Apps erstellen.

source: Change publication status of %(name)s
de: Veröffentlichung von %(name)s ändern

source: add image
de: Bild hinzufügen

source: Your app may only have one %(name)s feature.
de: Deine App kann nur ein %(name)s Feature haben.

source: Your %(name)s has been created and is ready for management.
de: Dein %(name)s wurde erstellt und kann bearbeitet werden.

source: Create a new %(name)s
de: %(name)s erstellen

source: Create
de: Erstellen

source: Delete external media
de: Externes Medium löschen

source: Do you really want to delete this external media?
de: Willst du dieses externe Medium wirklich löschen?

source: Delete image
de: Bild löschen

source: Do you really want to delete this image?
de: Willst du dieses Bild wirklich löschen?

source: Change name
de: Name ändern

source: Communication Error
de: Fehler in der Kommunikation

source: The translation could not be fetched. Please try again later.
de: Die Übersetzung konnt enicht geladen werden. Versuche es später erneut.

source: Edit licence
de: Lizenz ändern

source: primary
de: primär

source: Remove language
de: Sprache entfernen

source: Add language
de: Sprache hinzufügen

source: Manage Licence
de: Lizenz bearbeiten

source: The %(feature_content_type)s already exists in this app.
de: Das Feature %(feature_content_type)s existiert bereits in deiner App.

source: Manage order
de: Reihenfolge bearbeiten

source: Drag and drop for ordering.
de: Die Reihenfolge kann per drag and drop verändert werden.

source: Manage SEO
de: SEO bearbeiten

source: Options
de: Optionen

source: Successfully saved options.
de: Optionen erfolgreich gespeichert.

source: Save options
de: Optionen speichern

source: Remove %(verbose_name)s
de: %(verbose_name)s entfernen

source: Do you really want to remove %(verbose_name)s from this app?
de: Willst du das Feature %(verbose_name)s wirklich aus dieser App entfernen?

source: Manage Tags for %(content_object)s
de: Bearbeit edie tags von %(content_object)s

source: Your translations have been saved.
de: Die Übersetzungen wurden gespeichert.

source: automatic translation
de: automatische Übersetzung

source: Import from spreadsheet
de: Aus Tabelle importieren

source: Your spreadsheet has been uploaded and will now be validated.
de: Die Tabelle wurde hochgeladen und wird nun validiert.

source: Read the spreadsheet specifications first.
de: Lese zuerst die Spezifikation für Tabellen.

source: Spreadsheet specification
de: Spezifikation für Tabellen

source: Your zip package contained the following errors:
de: Die zip-Datei enthält die folgenden Fehler:

source: Upload complete. Verifying zip contents and importing data. This can take several minutes.
de: Upload vollständig. Verfiziere Inhalte der zip Datei und importiere Daten. Dies kann mehrere Minuten dauern.

source: Import
de: Importieren

source: Template content
de: Template Content erstellen

source: Currently building your app! This may take several minutes. Please be patient.
de: Deine App wird gerade gebaut. Dies kann mehrere Minuten dauern.

source: Build
de: Bauen

source: Components
de: Komponenten
