Repository: pypi-data/pypi-mirror-402
Catalog: packages/localcosmos-app-kit/localcosmos_app_kit-0.9.16-py3-none-any.whl/app_kit/locale/*/LC_MESSAGES/django.po
Languages: de

source: Your app is currently being validated. You can continue when the validation process has finished.
de: Deine App wird gerade validiert. Du kannst weitermachen, sobald die Validierung abgeschlossen ist.

source: Your app is currently being built. You can continue when the build process has finished.
de: Deine App wird gerade gebaut. Du kannst weitermachen, sobald der Bauvorgang abgeschlossen ist.

source: Waiting for iOS app build. Build is in progress.
de: Warte auf iOS build. Bauvorgang im Gange.

source: App packages
de: App Pakete

source: You are using Local Cosmos Private Server for this app. You can download your app packages here or start a new version.
de: Du benutzt einen Local Cosmos Private Server für diese App. Du kannst hier deine App Pakete herunterladen oder eine neue Version starten.

source: Download
de: herunterladen

source: not available
de: nicht verfügbar

source: Published version
de: Veröffentlichte Version

source: To edit your app, you have to start a new version.
de: Um deine App zu bearbeiten musst du eine neue Version starten.

source: Start new app version
de: neue App-version starten

source: Start new version
de: neue Version starten

source: Local Cosmos Private Server instructions
de: Anweisungen für deinen privaten Local Cosmos Server

source: Steps to make everything work with your private server:
de: Die nächsten Schritte, damit auf deinem privaten Server alles funktioniert:

source: Download the zipped web app:
de: gezippte WebApp herunterladen:

source: Go to the Server Control Panel of your private server.
de: Rufe das Server Control Panel deines privaten Servers auf.

source: In your private Server Control Panel click "Install app" or "Update app" and follow the instructions.
de: Klicke in deinem privaten Server Control Panel auf "Install App" oder "Update App", und folge den Anweisungen

source: Check that everything is working on your private server.
de: Überprüfe, ob alles auf deinem privaten Server funktioniert.

source: BUILD IN PROGRESS
de: BUILD IM GANGE

source: build passing
de: build klappt

source: build failing
de: build scheitert

source: Your app is currently failing to build although no validation errors have been found.
de: Der Bauvorgang deiner App scheitert momentan, obwohl die Validierung keine Fehler ergab.

source: Our engineers have been notified and will get back to you.
de: Unsere Ingenieure wurden benachrichtigt und werden sich bei dir melden.

source: Last validation attempt:
de: Letzter Validierungsversuch:

source: result:
de: Ergebnis:

source: %(error_count)s errors
de: %(error_count)s Fehler

source: no errors
de: keine Fehler

source: %(warning_count)s warnings
de: %(warning_count)s Warnungen

source: no warnings
de: keine Warnungen

source: During the last validation attempt the following errors were found:
de: Bei der letzten Validierung wurden folgende Fehler gefunden:

source: During the last validation attempt the following warnings were found:
de: Bei der letzten Validierung wurden folgende Warnungen gefunden:

source: Translations
de: Übersetzungen

source: Translate
de: Übersetzen

source: Local Cosmos is currently undergoing maintenance. You will be able to continue building apps after the maintenance has been completed.
de: Local Cosmos wird gerade gewartet. Du kannst nach Abschluss der Wartungsarbeiten wieder Apps bauen.

source: Your app is ready!
de: Deine App ist fertig!

source: Web app URL:
de: URL der Web app:

source: opens in new tab
de: öffnet in neuem Tab

source: Distribution
de: Verbreitung

source: App creation steps
de: Schritte der App-Erstellung

source: Create content
de: Inhalte erstellen

source: Validate
de: Validieren

source: Release
de: Veröffentlichen

source: The app kit is running in sandbox mode. You can validate, but not build.
de: Das App Kit läuft im Sandbox-Modus. Du kannst validieren, aber nicht bauen.

source: Validation in progress.
de: Validierung im Gange.

source: ignore warnings and build
de: Warnungen ignorieren und bauen

source: Due to an error, we could not release your app.
de: Aufgrund eines Fehlers konnten wir deine App nicht veröffentlichen.

source: You can add images after saving.
de: Du kannst nach dem Speichern Bilder hinzufügen.

source: Contact
de: Kontakt

source: Your apps
de: Deine Apps

source: You have no apps yet.
de: Du hast noch keine Apps.

source: Create new app
de: Neue App erstellen

source: Create new %(name)s
de: %(name)s erstellen

source: Your app has no contents yet.
de: Deine App hat noch keine Inhalte.

source: Template content supplies layouted templates and pages can be made available instantly. Similar to a content management system.
de: Template Content stellt Seiten mit Layout bereit. Diese Seiten können sofort veröffentlicht werden. Ähnlich wie bei einem CMS.

source: Managed on your private server.
de: auf deinem privaten Server verwaltet

source: Add component
de: Komponente hinzufügen

source: Configuration
de: Konfiguration

source: Languages
de: Sprachen

source: Design and texts
de: Design und Texte

source: Edit name
de: Name ändern

source: Currently importing %(name)s from a .zip file. This may take several minutes.
de: Importiere %(name)s aus einer .zip-Datei. Dies kann mehrere Minuten dauern.

source: Currently building your frontend for previews.
de: Es wird gerade das Frontend gebaut, um Vorschauen darstellen zu können.

source: Your app is currently being built and this content is locked.
de: Deine App wird gerade gebaut und dieser Inhalt ist gesperrt.

source: Your recently uploaded .zip package contained the following errors and was not imported:
de: Das kürzlich hochgeladene .zip Paket enthielt folgende Fehler und wurde nicht importiert:

source: fetching translation from DeepL
de: hole Übersetzung von DeepL

source: You have started a new app version. You can now start creating %(meta_app)s version %(version)s.
de: Du hast eine neue App Version gestartet. Du kannst nun damit beginnen, %(meta_app)s Version %(version)s zu erstellen.

source: Save translations
de: Übersetzungen speichern

source: Manage the taxa of this app. The taxa defined in the backbone taxonomy are available in observation forms and taxon profiles. Taxa of nature guides are automatically added to the backbone.
de: Verwaltet die Taxa dieser App. Die in der Backbone Taxonomie definierten Taxa sind in Beobachtungsformularen und Artensteckbriefen verfügbar. Taxa aus Naturführern werden automatisch zur Backbone Taxonomie hinzugefügt.

source: Where a glossary entry appears, the user can click on it to read the explanation.
de: Wenn ein Begriff aus dem Glossar in einem Text vorkommt, kann der Nutzer ihn anklicken und die Erklärung lesen.

source: A Nature Guide is an identification key or a simple species list.
de: Ein Naturführer ist ein Bestimmungsschlüssel oder eine einfache Artenliste.

source: The map feature plots your observations on a map.
de: Das Kartenfeature stellt Beobachtungen auf Karten dar.

source: Describe the species of your app using taxon profiles.
de: Beschreibe die Arten deiner App mit Artensteckbriefen.

source: An observation form is used to collect data.
de: Ein Beobachtungsformular dient der Datensammlung.

source: Defines the visual appearance of your app
de: Bestimmt das Aussehen deiner App.

source: No help text available.
de: Kein Hilfetext verfügbar

source: File too large. Size should not exceed %(size)s MiB.
de: Datei zu groß. Die Größe sollte %(size)s MiB nicht überschreiten.

source: You text contains invalid characters.
de: Dein Text enthält ungültige Zeichen.

source: Do you really want to delete %s?
de: Willst distributed %s wirklich löschen?
