Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.7.tar.gz/litegram-1.0.7/docs/locale/*/LC_MESSAGES/api/methods/set_sticker_set_thumb.po
Languages: ru

source: Returns: :obj:`bool`
ru: Возвращает: :obj:`bool`

source: Use this method to set the thumbnail of a regular or mask sticker set. The format of the thumbnail file must match the format of the stickers in the set. Returns :code:`True` on success.
ru: Используйте этот метод, чтобы установить миниатюру обычного или масочного набора стикеров. Формат файла миниатюры должен соответствовать формату стикеров в наборе. Возвращает :code:`True` в случае успеха.

source: Source: https://core.telegram.org/bots/api#setstickersetthumbnail
ru: Источник: https://core.telegram.org/bots/api#setstickersetthumbnail

source: Sticker set name
ru: Название набора стикеров

source: User identifier of the sticker set owner
ru: Идентификатор пользователя владельца набора стикеров

source: A **.WEBP** or **.PNG** image with the thumbnail, must be up to 128 kilobytes in size and have a width and height of exactly 100px, or a **.TGS** animation with a thumbnail up to 32 kilobytes in size (see `https://core.telegram.org/stickers#animated-sticker-requirements <https://core.telegram.org/stickers#animated-sticker-requirements>`_`https://core.telegram.org/stickers#animated-sticker-requirements <https://core.telegram.org/stickers#animated-sticker-requirements>`_ for animated sticker technical requirements), or a **WEBM** video with the thumbnail up to 32 kilobytes in size; see `https://core.telegram.org/stickers#video-sticker-requirements <https://core.telegram.org/stickers#video-sticker-requirements>`_`https://core.telegram.org/stickers#video-sticker-requirements <https://core.telegram.org/stickers#video-sticker-requirements>`_ for video sticker technical requirements. Pass a *file_id* as a String to send a file that already exists on the Telegram servers, pass an HTTP URL as a String for Telegram to get a file from the Internet, or upload a new one using multipart/form-data. :ref:`More information on Sending Files » <sending-files>`. Animated and video sticker set thumbnails can't be uploaded via HTTP URL. If omitted, then the thumbnail is dropped and the first sticker is used as the thumbnail.
ru: Изображение в формате **.WEBP** или **.PNG** с миниатюрой должно быть размером к 128 килобайт и иметь ширину и высоту ровно 100 пикселей, или анимацией в формате **.TGS** с миниатюрой размером к 32 килобайт (см. `https://core.telegram.org/stickers#animated-sticker-requirements <https://core.telegram.org/stickers#animated-sticker-requirements>`_`https://core.telegram.org/stickers#animated-sticker-requirements <https://core.telegram.org/stickers#animated-sticker-requirements>`_ технические требования к анимированным наклейкам), или **WEBM** видео с миниатюрой размером к 32 килобайт; смотрите `https://core.telegram.org/stickers#video-sticker-requirements <https://core.telegram.org/stickers#video-sticker-requirements>`_`https://core.telegram.org/stickers#video-sticker-requirements <https://core.telegram.org/stickers#video-sticker-requirements>`_ технические требования к видео наклейкам. Передайте *file_id* как строку, чтобы отправить файл, который уже существует на серверах Telegram, передайте HTTP URL как строку, чтобы Telegram получил файл из Интернета, или загрузите новый файл с помощью multipart/form-data. :ref:`Дополнительная информация об отправке файлов » <sending-files>`. Миниатюры анимированных и видео-наборов стикеров не могут быть загружены через HTTP URL. Если этот параметр не указан, то миниатюра будет удалена, а вместо нее будет использован первый стикер.

source: Usage
ru: Использование

source: As bot method
ru: Как метод bot

source: Imports:
ru: Импорты:

source: With specific bot
ru: С конкретным bot

source: As reply into Webhook in handler
ru: Как ответ в Webhook в обработчике
