Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.2.tar.gz/drf_auth_kit-1.1.2/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: cy, da, de, et, hi, ja, lt, mi, nl, no, ro, ru, ta, tl, vi

source: Send password reset instructions to the provided email address. If the email is registered, a secure reset link will be sent. The link expires after a limited time for security.
cy: Anfon cyfarwyddiadau ailosod cyfrinair i'r cyfeiriad e-bost a ddarparwyd. Os yw'r e-bost wedi'i gofrestru, anfonir dolen ailosod ddiogel. Mae'r ddolen yn dod i ben ar ôl amser cyfyngedig ar gyfer diogelwch.
da: Send instruktioner til nulstilling af adgangskode til den angivne e-mail-adresse. Hvis e-mail-adressen er registreret, vil et sikkert nulstillingslink blive sendt. Linket udløber efter et begrænset tidsrum af sikkerhedshensyn.
de: Sendet Anweisungen zum Zurücksetzen des Passworts an die angegebene E-Mail-Adresse. Wenn die E-Mail registriert ist, wird ein sicherer Reset-Link gesendet. Der Link läuft nach begrenzter Zeit aus Sicherheitsgründen ab.
et: Saada parooli lähtestamise juhised antud e-posti aadressile. Kui e-post on registreeritud, saadetakse turvaline lähtestamise link. Link aegub pärast piiratud aega turvalisuse huvides.
hi: प्रदान किए गए ईमेल पते पर पासवर्ड रीसेट निर्देश भेजें। यदि ईमेल पंजीकृत है, तो एक सुरक्षित रीसेट लिंक भेजा जाएगा। सुरक्षा के लिए लिंक सीमित समय के बाद समाप्त हो जाता है।
ja: 提供されたメールアドレスにパスワードリセットの手順を送信します。メールが登録されている場合、セキュアなリセットリンクが送信されます。セキュリティのため、リンクは限られた時間後に期限切れになります。
lt: Išsiųsti slaptažodžio atstatymo instrukcijas į pateiktą el. pašto adresą. Jei el. paštas yra registruotas, bus išsiųsta saugi atstatymo nuoroda. Nuoroda nebegalioja po riboto laiko dėl saugumo.
mi: Tukuna nga tohutohu tautuhi kupuhuna anō ki te wāhitau īmēra. Mēnā he rēhita te īmēra, ka tukuna he hononga tautuhi haumaru. Ka mutu te hononga i muri i te roa roa mo te haumarutanga.
nl: Verstuur wachtwoord reset instructies naar het opgegeven e-mailadres. Als het e-mailadres is geregistreerd, wordt een veilige reset link verstuurd. De link verloopt na een beperkte tijd voor de veiligheid.
no: Send instruksjoner for nullstilling av passord til den oppgitte e-postadressen. Hvis e-posten er registrert, vil en sikker nullstillingslenke bli sendt. Lenken utløper etter en begrenset tid av sikkerhetshensyn.
ro: Trimite instrucțiuni de resetare a parolei la adresa de email furnizată. Dacă email-ul este înregistrat, va fi trimis un link de resetare securizat. Link-ul expiră după o perioadă limitată din motive de securitate.
ru: Отправить инструкции по сбросу пароля на предоставленный адрес электронной почты. Если email зарегистрирован, будет отправлена безопасная ссылка для сброса. Ссылка истекает через ограниченное время для безопасности.
ta: வழங்கப்பட்ட மின்னஞ்சல் முகவரிக்கு கடவுச்சொல் மீட்டமைப்பு வழிகாட்டுதல்களை அனுப்பவும். மின்னஞ்சல் பதிவு செய்யப்பட்டிருந்தால், ஒரு பாதுகாப்பான மீட்டமைப்பு இணைப்பு அனுப்பப்படும். இணைப்பு பாதுகாப்பின் காரணமாக ஒரு குறித்த நேரத்தில் காலாவதி முடிவடையும்.
tl: Nagpadala ng mga tagubilin para sa password reset sa naibigay na email address. Kung ang email ay nakarehistro, isang secure reset link ay ipapadala. Ang link ay mag-expire pagkatapos ng limitadong oras para sa security.
vi: Gửi hướng dẫn đặt lại mật khẩu đến địa chỉ email được cung cấp. Nếu email đã được đăng ký, một liên kết đặt lại an toàn sẽ được gửi. Liên kết sẽ hết hạn sau một thời gian giới hạn để đảm bảo an toàn.

source: Complete the password reset process using the token from the reset email. Requires the UID and token from the email along with the new password. The token is single-use and expires for security.
cy: Cwblhau'r broses ailosod cyfrinair gan ddefnyddio'r tocyn o'r e-bost ailosod. Angen yr UID a'r tocyn o'r e-bost ynghyd â'r cyfrinair newydd. Mae'r tocyn yn defnydd-unwaith ac yn dod i ben ar gyfer diogelwch.
da: Fuldfør nulstillingsprocessen for adgangskode ved hjælp af token fra nulstillings-e-mailen. Kræver UID og token fra e-mailen sammen med den nye adgangskode. Token kan kun bruges én gang og udløber af sikkerhedshensyn.
de: Schließt den Passwort-Reset-Prozess mit dem Token aus der Reset-E-Mail ab. Benötigt die UID und den Token aus der E-Mail zusammen mit dem neuen Passwort. Der Token ist einmalig verwendbar und läuft aus Sicherheitsgründen ab.
et: Lõpeta parooli lähtestamise protsess, kasutades lähtestamise e-postist saadud tokenit. Nõuab UID-d ja tokenit e-postist koos uue parooliga. Token on ühekordseks kasutamiseks ja aegub turvalisuse huvides.
hi: रीसेट ईमेल से टोकन का उपयोग करके पासवर्ड रीसेट प्रक्रिया पूर्ण करें। नए पासवर्ड के साथ ईमेल से UID और टोकन की आवश्यकता है। सुरक्षा के लिए टोकन एकल-उपयोग है और समाप्त हो जाता है।
ja: リセットメールのトークンを使用してパスワードリセットプロセスを完了します。新しいパスワードとともにメールからのUIDとトークンが必要です。トークンは一度だけ使用可能で、セキュリティのため期限切れになります。
lt: Užbaikite slaptažodžio atstatymo procesą naudodami žetoną iš atstatymo el. laiško. Reikia UID ir žetono iš el. laiško kartu su nauju slaptažodžiu. Žetonas naudojamas vieną kartą ir nebegalioja dėl saugumo.
mi: Whakaoti te taupānga tautuhi kupuhuna ma te tohu i te īmēra tautuhi. Me te UID me te tohu i te īmēra hoki me te kupuhuna hou. He whakamahi kotahi te tohu, a ka mutu mo te haumarutanga.
nl: Voltooi het wachtwoord reset proces met behulp van het token uit de reset e-mail. Vereist de UID en token uit de e-mail samen met het nieuwe wachtwoord. Het token is voor eenmalig gebruik en verloopt voor de veiligheid.
no: Fullfør passordnullstillingsprosessen ved hjelp av tokenet fra nullstillings-e-posten. Krever UID og token fra e-posten sammen med det nye passordet. Tokenet er for engangsbruk og utløper av sikkerhetshensyn.
ro: Completează procesul de resetare a parolei folosind token-ul din email-ul de resetare. Necesită UID-ul și token-ul din email împreună cu noua parolă. Token-ul este de unică folosință și expiră din motive de securitate.
ru: Завершить процесс сброса пароля, используя токен из email для сброса. Требует UID и токен из email вместе с новым паролем. Токен одноразового использования и истекает для безопасности.
ta: மீட்டமைப்பு மின்னஞ்சலிலிருந்து டோக்கனைப் பயன்படுத்தி கடவுச்சொல் மீட்டமைப்பு செயல்முறையை முடிக்கவும். மின்னஞ்சலிலிருந்து UID மற்றும் டோக்கன் மற்றும் புதிய கடவுச்சொல்லுடன் தேவை. டோக்கன் ஒரு முறை மட்டும் பயன்படுத்தி பாதுகாப்பின் காரணமாக காலாவதி முடிவடையும்.
tl: Kumpletuhin ang password reset process gamit ang token mula sa reset email. Kailangan ang UID at token mula sa email kasama ang bagong password. Ang token ay single-use at mag-expire para sa security.
vi: Hoàn thành quá trình đặt lại mật khẩu bằng token từ email đặt lại. Yêu cầu UID và token từ email cùng với mật khẩu mới. Token chỉ sử dụng một lần và có thời gian hết hạn để đảm bảo an toàn.

source: Change the current user's password. Requires authentication.
cy: Newid cyfrinair y defnyddiwr cyfredol. Angen dilysu.
da: Skift den aktuelle brugers adgangskode. Kræver autentificering.
de: Ändert das Passwort des aktuellen Benutzers. Erfordert Authentifizierung.
et: Muuda praeguse kasutaja parooli. Nõuab autentimist.
hi: वर्तमान उपयोगकर्ता का पासवर्ड बदलें। प्रमाणीकरण की आवश्यकता है।
ja: 現在のユーザーのパスワードを変更します。認証が必要です。
lt: Keisti esamo vartotojo slaptažodį. Reikia autentifikacijos.
mi: Huringa te kupuhuna o te kaiwhakamahi o naianei. Me whakamanatia.
nl: Wijzig het wachtwoord van de huidige gebruiker. Vereist authenticatie.
no: Endre gjeldende brukers passord. Krever autentisering.
ro: Schimbă parola utilizatorului curent. Necesită autentificare.
ru: Изменить пароль текущего пользователя. Требует аутентификацию.
ta: தற்போதைய பயனரின் கடவுச்சொல்லை மாற்றவும். அங்கீகாரம் தேவை.
tl: Baguhin ang password ng kasalukuyang user. Kailangan ng authentication.
vi: Thay đổi mật khẩu của người dùng hiện tại. Yêu cầu xác thực.

source: Confirm email address using the verification key sent via email. This activates the user account and allows login access.
cy: Cadarnhau cyfeiriad e-bost gan ddefnyddio'r allwedd wirio a anfonwyd trwy e-bost. Mae hyn yn actifadu'r cyfrif defnyddiwr ac yn caniatáu mynediad mewngofnodi.
da: Bekræft e-mail-adresse ved hjælp af verifikationsnøglen sendt via e-mail. Dette aktiverer brugerkontoen og tillader login-adgang.
de: Bestätigt die E-Mail-Adresse mit dem per E-Mail gesendeten Verifikationsschlüssel. Dies aktiviert das Benutzerkonto und ermöglicht den Login-Zugang.
et: Kinnita e-posti aadress, kasutades e-posti teel saadetud kinnitamisvõtit. See aktiveerib kasutajakonto ja võimaldab sisselogimist.
hi: ईमेल के माध्यम से भेजी गई सत्यापन कुंजी का उपयोग करके ईमेल पते की पुष्टि करें। यह उपयोगकर्ता खाते को सक्रिय करता है और लॉगिन एक्सेस की अनुमति देता है।
ja: メールで送信された確認キーを使用してメールアドレスを確認します。これによりユーザーアカウントがアクティベートされ、ログインアクセスが許可されます。
lt: Patvirtinti el. pašto adresą naudojant patvirtinimo raktą, išsiųstą el. paštu. Tai aktyvuoja vartotojo paskyrą ir leidžia prisijungti.
mi: Whakaū te wāhitau īmēra ma te kī whakamana i tukuna ma te īmēra. Tenei whakahohe ai te pūkete kaiwhakamahi me te whakaaetanga takiuru.
nl: Bevestig e-mailadres met behulp van de verificatiesleutel die per e-mail is verzonden. Dit activeert het gebruikersaccount en geeft toegang tot inloggen.
no: Bekreft e-postadresse ved hjelp av bekreftelsesnøkkelen sendt via e-post. Dette aktiverer brukerkontoen og tillater innloggingstilgang.
ro: Confirmă adresa de email folosind cheia de verificare trimisă prin email. Aceasta activează contul de utilizator și permite accesul de conectare.
ru: Подтвердить адрес электронной почты, используя ключ проверки, отправленный по email. Это активирует учетную запись пользователя и разрешает доступ для входа.
ta: மின்னஞ்சல் வழியாக அனுப்பப்பட்ட சரிபார்ப்பு சாவியைப் பயன்படுத்தி மின்னஞ்சல் முகவரியை உறுதி செய்யவும். இது பயனர் கணக்கை செயல்படுத்தி உள்நுழைவு அணுகலை அனுமதிக்கிறது.
tl: Kumpirmahin ang email address gamit ang verification key na napadala sa email. Ito ay nagpapagana ng user account at nagbibigay ng login access.
vi: Xác nhận địa chỉ email bằng khóa xác minh được gửi qua email. Điều này kích hoạt tài khoản người dùng và cho phép truy cập đăng nhập.

source: Send a new email verification message to unverified email addresses. Only works for email addresses that are registered but not yet verified.
cy: Anfon neges wirio e-bost newydd i gyfeiriadau e-bost heb eu gwirio. Dim ond yn gweithio ar gyfer cyfeiriadau e-bost sydd wedi'u cofrestru ond heb eu gwirio eto.
da: Send en ny e-mail-verificeringsbesked til ikke-verificerede e-mail-adresser. Virker kun for e-mail-adresser, der er registreret, men endnu ikke verificeret.
de: Sendet eine neue E-Mail-Verifikationsnachricht an nicht verifizierte E-Mail-Adressen. Funktioniert nur für E-Mail-Adressen, die registriert, aber noch nicht verifiziert sind.
et: Saada uus e-posti kinnitamise sõnum kinnitamata e-posti aadressidele. Töötab ainult e-posti aadressidega, mis on registreeritud, kuid veel kinnitamata.
hi: असत्यापित ईमेल पतों पर नया ईमेल सत्यापन संदेश भेजें। केवल उन ईमेल पतों के लिए काम करता है जो पंजीकृत हैं लेकिन अभी तक सत्यापित नहीं हैं।
ja: 未確認のメールアドレスに新しいメール確認メッセージを送信します。登録されているがまだ確認されていないメールアドレスにのみ機能します。
lt: Išsiųsti naują el. pašto patvirtinimo pranešimą nepatvirtintiems el. pašto adresams. Veikia tik el. pašto adresams, kurie yra registruoti, bet dar nepatvirtinti.
mi: Tukuna he karere whakamana īmēra hou ki nga wāhitau īmēra kore whakamana. Mahi anake mo nga wāhitau īmēra kua rēhita engari kaore anō kia whakamanatia.
nl: Verstuur een nieuw e-mailverificatiebericht naar niet-geverifieerde e-mailadressen. Werkt alleen voor e-mailadressen die zijn geregistreerd maar nog niet geverifieerd.
no: Send en ny e-postbekreftelsesmelding til ubekreftede e-postadresser. Fungerer kun for e-postadresser som er registrert men ikke ennå bekreftet.
ro: Trimite un nou mesaj de verificare email la adresele de email neverificate. Funcționează doar pentru adresele de email care sunt înregistrate dar nu încă verificate.
ru: Отправить новое сообщение для проверки email на неподтвержденные адреса электронной почты. Работает только для адресов электронной почты, которые зарегистрированы, но еще не подтверждены.
ta: சரிபார்க்கப்படாத மின்னஞ்சல் முகவரிகளுக்கு புதிய மின்னஞ்சல் சரிபார்ப்பு செய்தியை அனுப்பவும். பதிவு செய்யப்பட்டு ஆனால் இன்னும் சரிபார்க்கப்படாத மின்னஞ்சல் முகவரிகளுக்கு மட்டுமே வேலை செய்யும்.
tl: Magpadala ng bagong email verification message sa mga hindi pa na-verify na email addresses. Gumagana lang para sa mga email addresses na nakarehistro pero hindi pa na-verify.
vi: Gửi tin nhắn xác minh email mới đến các địa chỉ email chưa được xác minh. Chỉ hoạt động cho các địa chỉ email đã đăng ký nhưng chưa được xác minh.

source: Retrieve the authenticated user's profile information including username, email, first name, and last name. Password fields are excluded.
cy: Adalw gwybodaeth proffil y defnyddiwr wedi'i ddilysu gan gynnwys enw defnyddiwr, e-bost, enw cyntaf, a chyfenw. Mae meysydd cyfrinair wedi'u heithrio.
da: Hent den autentificerede brugers profiloplysninger, herunder brugernavn, e-mail, fornavn og efternavn. Adgangskodefelter er udelukket.
de: Ruft die Profilinformationen des authentifizierten Benutzers ab, einschließlich Benutzername, E-Mail, Vorname und Nachname. Passwortfelder sind ausgeschlossen.
et: Hangi autenditud kasutaja profiili andmed, sealhulgas kasutajanimi, e-post, eesnimi ja perekonnanimi. Parooli väljad on välja jäetud.
hi: प्रमाणित उपयोगकर्ता की प्रोफ़ाइल जानकारी प्राप्त करें जिसमें उपयोगकर्ता नाम, ईमेल, पहला नाम और अंतिम नाम शामिल है। पासवर्ड फ़ील्ड बाहर रखे गए हैं।
ja: ユーザー名、メール、名前、姓を含む認証されたユーザーのプロフィール情報を取得します。パスワードフィールドは除外されます。
lt: Gauti autentifikuoto vartotojo profilio informaciją, įskaitant vartotojo vardą, el. paštą, vardą ir pavardę. Slaptažodžio laukai neįtraukti.
mi: Tikina nga taipitopito kōtaha o te kaiwhakamahi whakamanatia, tae atu ki te ingoa-kaiwhakamahi, īmēra, ingoa tuatahi, me te ingoa whakamutunga. Kaore nga āpure kupuhuna.
nl: Haal de geauthenticeerde gebruikersprofielinformatie op, inclusief gebruikersnaam, e-mail, voornaam en achternaam. Wachtwoordvelden zijn uitgesloten.
no: Hent den autentiserte brukerens profilinformasjon inkludert brukernavn, e-post, fornavn og etternavn. Passordfelter er ekskludert.
ro: Recuperează informațiile de profil ale utilizatorului autentificat incluzând numele de utilizator, email, prenumele și numele de familie. Câmpurile de parolă sunt excluse.
ru: Получить информацию профиля аутентифицированного пользователя, включая имя пользователя, email, имя и фамилию. Поля пароля исключены.
ta: பயனர்பெயர், மின்னஞ்சல், முதல் பெயர் மற்றும் கடைசி பெயர் உள்பட அங்கீகரிக்கப்பட்ட பயனரின் சுருக்க தகவலை பெறவும். கடவுச்சொல் களங்கள் விலக்கப்பட்டுள்ளன.
tl: Kunin ang profile information ng authenticated user kasama ang username, email, first name, at last name. Hindi kasama ang password fields.
vi: Truy xuất thông tin hồ sơ người dùng đã xác thực bao gồm tên người dùng, email, tên và họ. Các trường mật khẩu được loại trừ.

source: Update the authenticated user's profile information. Allows modification of username, first name, and last name. Email field is read-only for security.
cy: Diweddaru gwybodaeth proffil y defnyddiwr wedi'i ddilysu. Caniatáu newid enw defnyddiwr, enw cyntaf, a chyfenw. Mae'r maes e-bost yn ddarllen-yn-unig ar gyfer diogelwch.
da: Opdater den autentificerede brugers profiloplysninger. Tillader ændring af brugernavn, fornavn og efternavn. E-mail-felt er skrivebeskyttet af sikkerhedshensyn.
de: Aktualisiert die Profilinformationen des authentifizierten Benutzers. Ermöglicht die Änderung von Benutzername, Vorname und Nachname. E-Mail-Feld ist aus Sicherheitsgründen schreibgeschützt.
et: Uuenda autenditud kasutaja profiili andmeid. Võimaldab muuta kasutajanime, eesnime ja perekonnanime. E-posti väli on turvalisuse huvides kirjutuskaitstud.
hi: प्रमाणित उपयोगकर्ता की प्रोफ़ाइल जानकारी अपडेट करें। उपयोगकर्ता नाम, पहला नाम और अंतिम नाम के संशोधन की अनुमति देता है। सुरक्षा के लिए ईमेल फ़ील्ड केवल पढ़ने योग्य है।
ja: 認証されたユーザーのプロフィール情報を更新します。ユーザー名、名前、姓の変更が可能です。セキュリティのためメールフィールドは読み取り専用です。
lt: Atnaujinti autentifikuoto vartotojo profilio informaciją. Leidžia keisti vartotojo vardą, vardą ir pavardę. El. pašto laukas yra tik skaitomas dėl saugumo.
mi: Whakahoutia nga taipitopito kōtaha o te kaiwhakamahi whakamanatia. Whakaaetanga whakakē o te ingoa-kaiwhakamahi, ingoa tuatahi, me te ingoa whakamutunga. He pānui-anake te āpure īmēra mo te haumarutanga.
nl: Update de geauthenticeerde gebruikersprofielinformatie. Staat wijziging toe van gebruikersnaam, voornaam en achternaam. E-mailveld is alleen-lezen voor veiligheid.
no: Oppdater den autentiserte brukerens profilinformasjon. Tillater modifikasjon av brukernavn, fornavn og etternavn. E-postfeltet er skrivebeskyttet av sikkerhetshensyn.
ro: Actualizează informațiile de profil ale utilizatorului autentificat. Permite modificarea numelui de utilizator, prenumelui și numelui de familie. Câmpul email este doar-citire din motive de securitate.
ru: Обновить информацию профиля аутентифицированного пользователя. Разрешает изменение имени пользователя, имени и фамилии. Поле email доступно только для чтения для безопасности.
ta: அங்கீகரிக்கப்பட்ட பயனரின் சுருக்க தகவலை புதுப்பிக்கவும். பயனர்பெயர், முதல் பெயர் மற்றும் கடைசி பெயரை மாற்ற அனுமதிக்கிறது. பாதுகாப்பின் காரணமாக மின்னஞ்சல் களம் வாசிக்க மட்டும்.
tl: I-update ang profile information ng authenticated user. Nagbibigay-daan sa pagbabago ng username, first name, at last name. Ang email field ay read-only para sa security.
vi: Cập nhật thông tin hồ sơ người dùng đã xác thực. Cho phép sửa đổi tên người dùng, tên và họ. Trường email chỉ đọc để đảm bảo an toàn.

source: Partially update the authenticated user's profile information. Only provided fields will be updated. Email field is read-only.
cy: Diweddaru gwybodaeth proffil y defnyddiwr wedi'i ddilysu yn rhannol. Dim ond meysydd a ddarperir fydd yn cael eu diweddaru. Mae'r maes e-bost yn ddarllen-yn-unig.
da: Delvist opdater den autentificerede brugers profiloplysninger. Kun angivne felter bliver opdateret. E-mail-felt er skrivebeskyttet.
de: Aktualisiert teilweise die Profilinformationen des authentifizierten Benutzers. Nur bereitgestellte Felder werden aktualisiert. E-Mail-Feld ist schreibgeschützt.
et: Osaliselt uuenda autenditud kasutaja profiili andmeid. Uuendatakse ainult esitatud väljad. E-posti väli on kirjutuskaitstud.
hi: प्रमाणित उपयोगकर्ता की प्रोफ़ाइल जानकारी आंशिक रूप से अपडेट करें। केवल प्रदान किए गए फ़ील्ड अपडेट किए जाएंगे। ईमेल फ़ील्ड केवल पढ़ने योग्य है।
ja: 認証されたユーザーのプロフィール情報を部分的に更新します。提供されたフィールドのみが更新されます。メールフィールドは読み取り専用です。
lt: Dalinai atnaujinti autentifikuoto vartotojo profilio informaciją. Tik pateikti laukai bus atnaujinti. El. pašto laukas yra tik skaitomas.
mi: Whakahoutia wāhanga nga taipitopito kōtaha o te kaiwhakamahi whakamanatia. Ko nga āpure whakarato anake ka whakahoutia. He pānui-anake te āpure īmēra.
nl: Gedeeltelijk bijwerken van de geauthenticeerde gebruikersprofielinformatie. Alleen opgegeven velden worden bijgewerkt. E-mailveld is alleen-lezen.
no: Delvis oppdatere den autentiserte brukerens profilinformasjon. Bare oppgitte felter vil bli oppdatert. E-postfeltet er skrivebeskyttet.
ro: Actualizează parțial informațiile de profil ale utilizatorului autentificat. Doar câmpurile furnizate vor fi actualizate. Câmpul email este doar-citire.
ru: Частично обновить информацию профиля аутентифицированного пользователя. Только предоставленные поля будут обновлены. Поле email доступно только для чтения.
ta: அங்கீகரிக்கப்பட்ட பயனரின் சுருக்க தகவலை பகுதியாக புதுப்பிக்கவும். வழங்கப்பட்ட களங்கள் மட்டுமே புதுப்பிக்கப்படும். மின்னஞ்சல் களம் வாசிக்க மட்டும்.
tl: Bahagyang i-update ang profile information ng authenticated user. Ang mga fields na naibigay lamang ang ma-update. Ang email field ay read-only.
vi: Cập nhật một phần thông tin hồ sơ người dùng đã xác thực. Chỉ các trường được cung cấp sẽ được cập nhật. Trường email chỉ đọc.

source: The email address is not assigned to any user account.
cy: Nid yw'r cyfeiriad e-bost wedi'i neilltuo i unrhyw gyfrif defnyddiwr.
da: E-mail-adressen er ikke tildelt nogen brugerkonto.
de: Die E-Mail-Adresse ist keinem Benutzerkonto zugeordnet.
et: E-posti aadress ei ole ühegi kasutajakontoga seotud.
hi: ईमेल पता किसी भी उपयोगकर्ता खाते से असाइन नहीं है।
ja: メールアドレスはどのユーザーアカウントにも割り当てられていません。
lt: El. pašto adresas nėra priskirtas jokiai vartotojo paskyrai.
mi: Kaore te wāhitau īmēra i whakaritea ki tetahi pūkete kaiwhakamahi.
nl: Het e-mailadres is niet toegewezen aan een gebruikersaccount.
no: E-postadressen er ikke tilknyttet noen brukerkonto.
ro: Adresa de email nu este atribuită niciunui cont de utilizator.
ru: Адрес электронной почты не присвоен ни одной учетной записи пользователя.
ta: மின்னஞ்சல் முகவரி எந்த பயனர் கணக்குக்கும் ஒதுக்கப்படவில்லை.
tl: Ang email address ay hindi naka-assign sa anumang user account.
vi: Địa chỉ email không được gán cho bất kỳ tài khoản người dùng nào.

source: Requested MFA method does not exist.
cy: Nid yw'r dull MFA a ofynnwyd amdano yn bodoli.
da: Den anmodede MFA-metode findes ikke.
de: Die angeforderte MFA-Methode existiert nicht.
et: Soovitud MFA meetod ei eksisteeri.
hi: अनुरोधित MFA विधि मौजूद नहीं है।
ja: 要求されたMFA方法は存在しません。
lt: Prašomas MFA metodas neegzistuoja.
mi: Kaore te tikanga MFA i tongia i rēhia.
nl: De gevraagde MFA-methode bestaat niet.
no: Forespurt MFA-metode eksisterer ikke.
ro: Metoda MFA solicitată nu există.
ru: Запрошенный метод MFA не существует.
ta: கோரப்பட்ட MFA முறை இல்லை.
tl: Ang hiniling na MFA method ay hindi umiiral.
vi: Phương thức MFA được yêu cầu không tồn tại.

source: Email message with MFA code has been sent.
cy: Mae neges e-bost gyda chod MFA wedi'i hanfon.
da: E-mail-besked med MFA-kode er blevet sendt.
de: E-Mail-Nachricht mit MFA-Code wurde gesendet.
et: E-posti sõnum MFA koodiga on saadetud.
hi: MFA कोड के साथ ईमेल संदेश भेजा गया है।
ja: MFAコードを含むメールメッセージが送信されました。
lt: El. pašto pranešimas su MFA kodu buvo išsiųstas.
mi: Kua tukuna he karere īmēra me te waehere MFA.
nl: E-mailbericht met MFA-code is verzonden.
no: E-postmelding med MFA-kode har blitt sendt.
ro: Mesajul email cu codul MFA a fost trimis.
ru: Сообщение электронной почты с кодом MFA было отправлено.
ta: MFA கோடுடன் மின்னஞ்சல் செய்தி அனுப்பப்பட்டது.
tl: Ang email message na may MFA code ay napadala na.
vi: Email chứa mã MFA đã được gửi.

source: MFA code expires in {} seconds.
cy: Mae cod MFA yn dod i ben mewn {} eiliad.
da: MFA-kode udløber om {} sekunder.
de: MFA-Code läuft in {} Sekunden ab.
et: MFA kood aegub {} sekundi pärast.
hi: MFA कोड {} सेकंड में समाप्त हो जाता है।
ja: MFAコードは{}秒後に期限切れになります。
lt: MFA kodas nebegalioja po {} sekundžių.
mi: Ka mutu te waehere MFA i {} hēkona.
nl: MFA-code verloopt over {} seconden.
no: MFA-kode utløper om {} sekunder.
ro: Codul MFA expiră în {} secunde.
ru: Код MFA истекает через {} секунд.
ta: MFA கோட் {} விநாடிகளில் காலாவதி முடிவடையும்.
tl: Ang MFA code ay mag-expire sa {} segundo.
vi: Mã MFA hết hạn trong {} giây.
