Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.2.tar.gz/drf_auth_kit-1.1.2/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: cy, da, de, et, hi, ja, lt, mi, nl, no, ro, ru, ta, tl, vi

source: Returns user details along with JWT access and refresh tokens with expiration times.
cy: Dychwelyd manylion defnyddiwr ynghyd â thocynnau mynediad a adnewyddu JWT gydag amseroedd dod i ben.
da: Returnerer brugeroplysninger sammen med JWT-adgangs- og opdateringstokens med udløbstider.
de: Gibt Benutzerdetails zusammen mit JWT-Zugriffs- und Aktualisierungstoken mit Ablaufzeiten zurück.
et: Tagastab kasutaja andmed koos JWT juurdepääsu- ja värskendamistokendega ning aegumisaegadega.
hi: उपयोगकर्ता विवरण के साथ JWT एक्सेस और रिफ्रेश टोकन समाप्ति समय के साथ वापस करता है।
ja: 有効期限付きのJWTアクセストークンとリフレッシュトークンとともにユーザー詳細を返します。
lt: Grąžina vartotojo duomenis kartu su JWT prieigos ir atnaujinimo žetonais su galiojimo laikais.
mi: Whakahoki ai nga taipitopito kaiwhakamahi me nga tohu urunga JWT me nga tohu whakahou me nga taima mutunga.
nl: Retourneert gebruikersgegevens samen met JWT toegangs- en verversingstokens met vervaltijden.
no: Returnerer brukerdetaljer sammen med JWT tilgangs- og oppdateringstokens med utløpstider.
ro: Returnează detaliile utilizatorului împreună cu token-urile de acces și împrospătare JWT cu timpii de expirare.
ru: Возвращает данные пользователя вместе с токенами доступа и обновления JWT с временем истечения.
ta: காலாவதி நேரங்களுடன் JWT அணுகல் மற்றும் புதுப்பிப்பு டோக்கன்களுடன் பயனர் விவரங்களை வழங்குகிறது.
tl: Nagbabalik ng mga detalye ng user kasama ang JWT access at refresh tokens na may mga oras ng pag-expire.
vi: Trả về thông tin người dùng cùng với JWT access token và refresh token kèm thời gian hết hạn.

source: Returns user details along with a DRF authentication token for API access.
cy: Dychwelyd manylion defnyddiwr ynghyd â thocyn dilysu DRF ar gyfer mynediad API.
da: Returnerer brugeroplysninger sammen med et DRF-autentificeringstoken til API-adgang.
de: Gibt Benutzerdetails zusammen mit einem DRF-Authentifizierungstoken für API-Zugriff zurück.
et: Tagastab kasutaja andmed koos DRF autentimistokendega API juurdepääsuks.
hi: API एक्सेस के लिए DRF प्रमाणीकरण टोकन के साथ उपयोगकर्ता विवरण वापस करता है।
ja: APIアクセス用のDRF認証トークンとともにユーザー詳細を返します。
lt: Grąžina vartotojo duomenis kartu su DRF autentifikacijos žetonu API prieigai.
mi: Whakahoki ai nga taipitopito kaiwhakamahi me he tohu whakamanatanga DRF mo te urunga API.
nl: Retourneert gebruikersgegevens samen met een DRF authenticatietoken voor API-toegang.
no: Returnerer brukerdetaljer sammen med et DRF autentiseringstoken for API-tilgang.
ro: Returnează detaliile utilizatorului împreună cu un token de autentificare DRF pentru accesul API.
ru: Возвращает данные пользователя вместе с токеном аутентификации DRF для доступа к API.
ta: API அணுகலுக்கான DRF அங்கீகார டோக்கனுடன் பயனர் விவரங்களை வழங்குகிறது.
tl: Nagbabalik ng mga detalye ng user kasama ang DRF authentication token para sa API access.
vi: Trả về thông tin người dùng cùng với DRF authentication token để truy cập API.

source: Returns user details along with custom authentication tokens.
cy: Dychwelyd manylion defnyddiwr ynghyd â thocynnau dilysu personol.
da: Returnerer brugeroplysninger sammen med brugerdefinerede autentificeringstokens.
de: Gibt Benutzerdetails zusammen mit benutzerdefinierten Authentifizierungstoken zurück.
et: Tagastab kasutaja andmed koos kohandatud autentimistokendega.
hi: कस्टम प्रमाणीकरण टोकन के साथ उपयोगकर्ता विवरण वापस करता है।
ja: カスタム認証トークンとともにユーザー詳細を返します。
lt: Grąžina vartotojo duomenis kartu su pasirinktiniais autentifikacijos žetonais.
mi: Whakahoki ai nga taipitopito kaiwhakamahi me nga tohu whakamanatanga ritenga.
nl: Retourneert gebruikersgegevens samen met aangepaste authenticatietokens.
no: Returnerer brukerdetaljer sammen med tilpassede autentiseringstokens.
ro: Returnează detaliile utilizatorului împreună cu token-uri de autentificare personalizate.
ru: Возвращает данные пользователя вместе с пользовательскими токенами аутентификации.
ta: தனிப்பயன் அங்கீகார டோக்கன்களுடன் பயனர் விவரங்களை வழங்குகிறது.
tl: Nagbabalik ng mga detalye ng user kasama ang custom authentication tokens.
vi: Trả về thông tin người dùng cùng với custom authentication token.

source: JWT access and refresh tokens
cy: Tocynnau mynediad a adnewyddu JWT
da: JWT-adgangs- og opdateringstokens
de: JWT-Zugriffs- und Aktualisierungstoken
et: JWT juurdepääsu- ja värskendamistokendid
hi: JWT एक्सेस और रिफ्रेश टोकन
ja: JWTアクセストークンとリフレッシュトークン
lt: JWT prieigos ir atnaujinimo žetonai
mi: Nga tohu urunga JWT me nga tohu whakahou
nl: JWT toegangs- en verversingstokens
no: JWT tilgangs- og oppdateringstokens
ro: Token-uri de acces și împrospătare JWT
ru: Токены доступа и обновления JWT
ta: JWT அணுகல் மற்றும் புதுப்பிப்பு டோக்கன்கள்
tl: JWT access at refresh tokens
vi: JWT access token và refresh token

source: DRF authentication token
cy: Tocyn dilysu DRF
da: DRF-autentificeringstoken
de: DRF-Authentifizierungstoken
et: DRF autentimistoken
hi: DRF प्रमाणीकरण टोकन
ja: DRF認証トークン
lt: DRF autentifikacijos žetonas
mi: Tohu whakamanatanga DRF
nl: DRF authenticatietoken
no: DRF autentiseringstoken
ro: Token de autentificare DRF
ru: Токен аутентификации DRF
ta: DRF அங்கீகார டோக்கன்

source: custom authentication tokens
cy: tocynnau dilysu personol
da: brugerdefinerede autentificeringstokens
de: benutzerdefinierte Authentifizierungstoken
et: kohandatud autentimistokendid
hi: कस्टम प्रमाणीकरण टोकन
ja: カスタム認証トークン
lt: pasirinktiniai autentifikacijos žetonai
mi: nga tohu whakamanatanga ritenga
nl: aangepaste authenticatietokens
no: tilpassede autentiseringstokens
ro: token-uri de autentificare personalizate
ru: пользовательские токены аутентификации
ta: தனிப்பயன் அங்கீகார டோக்கன்கள்
vi: token xác thực tùy chỉnh

source: Authentication cookies are set automatically for secure token storage.
cy: Mae cwcis dilysu yn cael eu gosod yn awtomatig ar gyfer storio tocynnau diogel.
da: Autentificeringsindstillinger indstilles automatisk til sikker tokenlagring.
de: Authentifizierungscookies werden automatisch für sichere Token-Speicherung gesetzt.
et: Autentimisküpsised seatakse automaatselt turvalise tokeni salvestamiseks.
hi: सुरक्षित टोकन संग्रहण के लिए प्रमाणीकरण कुकीज़ स्वचालित रूप से सेट की जाती हैं।
ja: 認証クッキーはセキュアなトークン保存のために自動的に設定されます。
lt: Autentifikacijos slapukai nustatomi automatiškai saugiems žetonams saugoti.
mi: Ka whakaritea nga kuki whakamanatanga aunoa mo te penapena tohu haumaru.
nl: Authenticatiecookies worden automatisch ingesteld voor veilige tokenopslag.
no: Autentiseringscookies settes automatisk for sikker tokenlagring.
ro: Cookie-urile de autentificare sunt setate automat pentru stocarea securizată a token-urilor.
ru: Cookies аутентификации устанавливаются автоматически для безопасного хранения токенов.
ta: பாதுகாப்பான டோக்கன் சேமிப்பிற்காக அங்கீகார குக்கீகள் தானாகவே அமைக்கப்படுகின்றன.
tl: Ang authentication cookies ay awtomatikong naitakda para sa secure token storage.
vi: Cookie xác thực được thiết lập tự động để lưu trữ token một cách an toàn.

source: Blacklists JWT refresh tokens to prevent further use.
cy: Rhestr ddu tocynnau adnewyddu JWT i atal defnydd pellach.
da: Sortlister JWT-opdateringstokens for at forhindre yderligere brug.
de: Setzt JWT-Aktualisierungstoken auf die schwarze Liste, um weitere Nutzung zu verhindern.
et: Lisab JWT värskendamistokendid mustale nimekirjale edasiseks kasutamiseks.
hi: आगे के उपयोग को रोकने के लिए JWT रिफ्रेश टोकन को ब्लैकलिस्ट करता है।
ja: JWTリフレッシュトークンをブラックリストに追加して今後の使用を防ぎます。
lt: Įtraukia JWT atnaujinimo žetonus į juodąjį sąrašą, kad užkirstų kelią tolesniam naudojimui.
mi: Ka whakauru ki te raina ā-turi nga tohu whakahou JWT kia kore ai e whakamahi anō.
nl: Zet JWT verversingstokens op de zwarte lijst om verder gebruik te voorkomen.
no: Svartelister JWT oppdateringstokens for å forhindre videre bruk.
ro: Adaugă la lista neagră token-urile de împrospătare JWT pentru a preveni folosirea ulterioară.
ru: Заносит в черный список токены обновления JWT для предотвращения дальнейшего использования.
ta: மேலும் பயன்பாட்டைத் தடுக்க JWT புதுப்பிப்பு டோக்கன்களை கருப்புப் பட்டியலில் சேர்க்கிறது.
tl: Inilagay sa blacklist ang JWT refresh tokens para mapigil ang karagdagang paggamit.
vi: Đưa JWT refresh token vào danh sách đen để ngăn chặn việc sử dụng tiếp theo.

source: Deletes the DRF authentication token from the database.
cy: Dileu'r tocyn dilysu DRF o'r gronfa ddata.
da: Sletter DRF-autentificeringstoken fra databasen.
de: Löscht den DRF-Authentifizierungstoken aus der Datenbank.
et: Kustutab DRF autentimistokeni andmebaasist.
hi: डेटाबेस से DRF प्रमाणीकरण टोकन को हटाता है।
ja: データベースからDRF認証トークンを削除します。
lt: Ištrina DRF autentifikacijos žetoną iš duomenų bazės.
mi: Ka muku i te tohu whakamanatanga DRF i te pātaka raraunga.
nl: Verwijdert het DRF authenticatietoken uit de database.
no: Sletter DRF autentiseringstoken fra databasen.
ro: Șterge token-ul de autentificare DRF din baza de date.
ru: Удаляет токен аутентификации DRF из базы данных.
ta: தரவுத்தளத்திலிருந்து DRF அங்கீகார டோக்கனை நீக்குகிறது.
tl: Tinatanggal ang DRF authentication token mula sa database.
vi: Xóa DRF authentication token khỏi cơ sở dữ liệu.

source: Invalidates custom authentication tokens.
cy: Dirymu tocynnau dilysu personol.
da: Ugyldiggør brugerdefinerede autentificeringstokens.
de: Macht benutzerdefinierte Authentifizierungstoken ungültig.
et: Kehtestab kohandatud autentimistokendid kehtetuks.
hi: कस्टम प्रमाणीकरण टोकन को अमान्य करता है।
ja: カスタム認証トークンを無効にします。
lt: Panaikina pasirinktinių autentifikacijos žetonų galiojimą.
mi: Ka whakakorekore nga tohu whakamanatanga ritenga.
nl: Maakt aangepaste authenticatietokens ongeldig.
no: Ugyldiggjør tilpassede autentiseringstokens.
ro: Invalidează token-urile de autentificare personalizate.
ru: Делает недействительными пользовательские токены аутентификации.
ta: தனிப்பயன் அங்கீகார டோக்கன்களை செல்லாததாக்குகிறது.
tl: Ginagawang hindi valid ang custom authentication tokens.
vi: Vô hiệu hóa token xác thực tùy chỉnh.

source: Clears authentication cookies from the browser.
cy: Clirio cwcis dilysu o'r porwr.
da: Rydder autentificeringsindstillinger fra browseren.
de: Löscht Authentifizierungscookies aus dem Browser.
et: Kustutab autentimisküpsised brauserist.
hi: ब्राउज़र से प्रमाणीकरण कुकीज़ साफ़ करता है।
ja: ブラウザから認証クッキーをクリアします。
lt: Išvalo autentifikacijos slapukus iš naršyklės.
mi: Ka whakamomohi nga kuki whakamanatanga i te pūtirotiro.
nl: Wist authenticatiecookies uit de browser.
no: Fjerner autentiseringscookies fra nettleseren.
ro: Curăță cookie-urile de autentificare din browser.
ru: Очищает cookies аутентификации из браузера.
ta: உலாவியில் இருந்து அங்கீகார குக்கீகளை அழிக்கிறது.
tl: Nilalinis ang authentication cookies mula sa browser.
vi: Xóa cookie xác thực khỏi trình duyệt.

source: Authenticate with username/email and password to obtain access tokens.
cy: Dilysu gydag enw defnyddiwr/e-bost a chyfrinair i gael tocynnau mynediad.
da: Autentificer med brugernavn/e-mail og adgangskode for at få adgangstokens.
de: Authentifizieren Sie sich mit Benutzername/E-Mail und Passwort, um Zugriffstoken zu erhalten.
et: Autentimiseks kasutajanime/e-posti ja parooli abil juurdepääsutokende saamiseks.
hi: एक्सेस टोकन प्राप्त करने के लिए उपयोगकर्ता नाम/ईमेल और पासवर्ड के साथ प्रमाणीकरण करें।
ja: アクセストークンを取得するためにユーザー名/メールアドレスとパスワードで認証してください。
lt: Autentifikuotis su vartotojo vardu/el. paštu ir slaptažodžiu, kad gautumėte prieigos žetonus.
mi: Whakamanatia me te ingoa-kaiwhakamahi/īmēra me te kupuhuna hoki nga tohu urunga.
nl: Authenticeer met gebruikersnaam/e-mail en wachtwoord om toegangstokens te verkrijgen.
no: Autentiser med brukernavn/e-post og passord for å få tilgangstokens.
ro: Autentifică cu numele de utilizator/email și parola pentru a obține token-uri de acces.
ru: Пройдите аутентификацию с именем пользователя/email и паролем для получения токенов доступа.
ta: அணுகல் டோக்கன்களைப் பெற பயனர்பெயர்/மின்னஞ்சல் மற்றும் கடவுச்சொல்லுடன் அங்கீகரிக்கவும்.
tl: Mag-authenticate gamit ang username/email at password para makakuha ng access tokens.
vi: Xác thực bằng tên người dùng/email và mật khẩu để lấy access token.

source: Logout user and invalidate authentication tokens.
cy: Allgofnodi defnyddiwr a dirymu tocynnau dilysu.
da: Log bruger ud og ugyldiggør autentificeringstokens.
de: Benutzer abmelden und Authentifizierungstoken ungültig machen.
et: Logi kasutaja välja ja kehtestamd autentimistokendid kehtetuks.
hi: उपयोगकर्ता को लॉग आउट करें और प्रमाणीकरण टोकन को अमान्य करें।
ja: ユーザーをログアウトし、認証トークンを無効にします。
lt: Atsijungti vartotoją ir panaikinti autentifikacijos žetonų galiojimą.
mi: Whakaputa te kaiwhakamahi me te whakakorekore nga tohu whakamanatanga.
nl: Gebruiker uitloggen en authenticatietokens ongeldig maken.
no: Logg ut bruker og ugyldiggjør autentiseringstokens.
ro: Deconectează utilizatorul și invalidează token-urile de autentificare.
ru: Выйти из системы и аннулировать токены аутентификации.
ta: பயனரை வெளியேற்றி அங்கீகார டோக்கன்களை செல்லாததாக்குகிறது.
tl: Mag-logout ng user at ginagawang hindi valid ang authentication tokens.
vi: Đăng xuất người dùng và vô hiệu hóa authentication token.

source: Requires authentication to ensure only valid sessions can be logged out.
cy: Angen dilysu i sicrhau y gall sesiynau dilys yn unig gael eu hallgofnodi.
da: Kræver autentificering for at sikre, at kun gyldige sessioner kan logges ud.
de: Erfordert Authentifizierung, um sicherzustellen, dass nur gültige Sitzungen abgemeldet werden können.
et: Nõuab autentimist, et tagada ainult kehtivate seansside väljalogimist.
hi: यह सुनिश्चित करने के लिए प्रमाणीकरण की आवश्यकता है कि केवल वैध सत्र ही लॉग आउट किए जा सकें।
ja: 有効なセッションのみログアウトできるように認証が必要です。
lt: Reikia autentifikacijos, kad užtikrintumėte, jog tik galiojančios sesijos gali būti atjungtos.
mi: Me whakamanatia kia mohio ai he taima whakawhitiwhiti anake nga mea ka whakaputaina.
nl: Vereist authenticatie om ervoor te zorgen dat alleen geldige sessies kunnen worden uitgelogd.
no: Krever autentisering for å sikre at bare gyldige økter kan logges ut.
ro: Necesită autentificare pentru a asigura că doar sesiunile valide pot fi deconectate.
ru: Требует аутентификацию для обеспечения того, чтобы только действительные сессии могли быть завершены.
ta: செல்லுபடியான அமர்வுகள் மட்டுமே வெளியேற்றப்படுவதை உறுதிசெய்ய அங்கீகாரம் தேவை.
tl: Kailangan ng authentication para masiguro na ang mga valid na session lang ang makakapag-logout.
vi: Yêu cầu xác thực để đảm bảo chỉ các phiên hợp lệ mới có thể đăng xuất.

source: Generate new JWT access tokens using refresh tokens.
cy: Cynhyrchu tocynnau mynediad JWT newydd gan ddefnyddio tocynnau adnewyddu.
da: Generer nye JWT-adgangstokens ved hjælp af opdateringstokens.
de: Generiert neue JWT-Zugriffstoken mit Aktualisierungstoken.
et: Genereeri uusi JWT juurdepääsutokende värskendamistokende abil.
hi: रिफ्रेश टोकन का उपयोग करके नए JWT एक्सेस टोकन जेनरेट करें।
ja: リフレッシュトークンを使用して新しいJWTアクセストークンを生成します。
lt: Sukurti naują JWT prieigos žetoną naudojant atnaujinimo žetonus.
mi: Waihanga tohu urunga JWT hou ma nga tohu whakahou.
nl: Genereer nieuwe JWT toegangstokens met verversingstokens.
no: Generer nye JWT tilgangstokens ved hjelp av oppdateringstokens.
ro: Generează noi token-uri de acces JWT folosind token-urile de împrospătare.
ru: Генерировать новые токены доступа JWT, используя токены обновления.
ta: புதுப்பிப்பு டோக்கன்களைப் பயன்படுத்தி புதிய JWT அணுகல் டோக்கன்களை உருவாக்குகிறது.
tl: Bumuo ng mga bagong JWT access tokens gamit ang refresh tokens.
vi: Tạo JWT access token mới bằng refresh token.

source: Refresh tokens can be provided in request data or extracted automatically from HTTP cookies.
cy: Gellir darparu tocynnau adnewyddu yn nata'r cais neu eu hechdynnu'n awtomatig o gwcis HTTP.
da: Opdateringstokens kan leveres i anmodningsdata eller udtrækkes automatisk fra HTTP-indstillinger.
de: Aktualisierungstoken können in Anfragedaten bereitgestellt oder automatisch aus HTTP-Cookies extrahiert werden.
et: Värskendamistokendid saab edastada päringu andmetes või ekstraktida automaatselt HTTP küpsistest.
hi: रिफ्रेश टोकन अनुरोध डेटा में प्रदान किए जा सकते हैं या HTTP कुकीज़ से स्वचालित रूप से निकाले जा सकते हैं।
ja: リフレッシュトークンはリクエストデータで提供するか、HTTPクッキーから自動的に抽出できます。
lt: Atnaujinimo žetonai gali būti pateikti užklausos duomenyse arba automatiškai ištraukti iš HTTP slapukų.
mi: Ka taea nga tohu whakahou te whakarato i nga raraunga tongi ranei te tango aunoa hoki i nga kuki HTTP.
nl: Verversingstokens kunnen worden opgegeven in aanvraaggegevens of automatisch worden geëxtraheerd uit HTTP-cookies.
no: Oppdateringstokens kan oppgis i forespørselsdata eller ekstraheres automatisk fra HTTP-cookies.
ro: Token-urile de împrospătare pot fi furnizate în datele cererii sau extrase automat din cookie-urile HTTP.
ru: Токены обновления могут быть предоставлены в данных запроса или извлечены автоматически из HTTP cookies.
ta: புதுப்பிப்பு டோக்கன்கள் கோரிக்கை தரவில் வழங்கப்படலாம் அல்லது HTTP குக்கீகளில் இருந்து தானாகவே பிரித்தெடுக்கப்படலாம்.
tl: Ang refresh tokens ay maaaring ibigay sa request data o awtomatikong kunin mula sa HTTP cookies.
vi: Refresh token có thể được cung cấp trong dữ liệu yêu cầu hoặc tự động trích xuất từ HTTP cookie.

source: Returns new access tokens with updated expiration times.
cy: Dychwelyd tocynnau mynediad newydd gydag amseroedd dod i ben wedi'u diweddaru.
da: Returnerer nye adgangstokens med opdaterede udløbstider.
de: Gibt neue Zugriffstoken mit aktualisierten Ablaufzeiten zurück.
et: Tagastab uued juurdepääsutokendid uuendatud aegumisaegadega.
hi: अपडेटेड समाप्ति समय के साथ नए एक्सेस टोकन वापस करता है।
ja: 更新された有効期限付きの新しいアクセストークンを返します。
lt: Grąžina naują prieigos žetoną su atnaujintu galiojimo laiku.
mi: Whakahoki ai nga tohu urunga hou me nga taima mutunga whakahoutia.
nl: Retourneert nieuwe toegangstokens met bijgewerkte vervaltijden.
no: Returnerer nye tilgangstokens med oppdaterte utløpstider.
ro: Returnează noi token-uri de acces cu timpii de expirare actualizați.
ru: Возвращает новые токены доступа с обновленными временами истечения.
ta: புதுப்பிக்கப்பட்ட காலாவதி நேரங்களுடன் புதிய அணுகல் டோக்கன்களை வழங்குகிறது.
tl: Nagbabalik ng mga bagong access tokens na may na-update na mga oras ng pag-expire.
vi: Trả về access token mới với thời gian hết hạn được cập nhật.

source: New tokens are automatically set in HTTP cookies for secure storage.
cy: Mae tocynnau newydd yn cael eu gosod yn awtomatig mewn cwcis HTTP ar gyfer storio diogel.
da: Nye tokens indstilles automatisk i HTTP-indstillinger til sikker lagring.
de: Neue Token werden automatisch in HTTP-Cookies für sichere Speicherung gesetzt.
et: Uued tokendid seatakse automaatselt HTTP küpsistesse turvalise salvestamiseks.
hi: सुरक्षित संग्रहण के लिए नए टोकन स्वचालित रूप से HTTP कुकीज़ में सेट हो जाते हैं।
ja: 新しいトークンはセキュアな保存のためにHTTPクッキーに自動的に設定されます。
lt: Nauji žetonai automatiškai nustatomi HTTP slapukuose saugiam saugojimui.
mi: Ka whakaritea nga tohu hou aunoa ki nga kuki HTTP mo te penapena haumaru.
nl: Nieuwe tokens worden automatisch ingesteld in HTTP-cookies voor veilige opslag.
no: Nye tokens settes automatisk i HTTP-cookies for sikker lagring.
ro: Noile token-uri sunt setate automat în cookie-urile HTTP pentru stocare securizată.
ru: Новые токены автоматически устанавливаются в HTTP cookies для безопасного хранения.
ta: பாதுகாப்பான சேமிப்பிற்காக புதிய டோக்கன்கள் HTTP குக்கீகளில் தானாகவே அமைக்கப்படுகின்றன.
tl: Ang mga bagong tokens ay awtomatikong naitakda sa HTTP cookies para sa secure storage.
vi: Token mới được tự động thiết lập trong HTTP cookie để lưu trữ an toàn.

source: Refresh tokens must be provided in the request data.
cy: Rhaid darparu tocynnau adnewyddu yn nata'r cais.
da: Opdateringstokens skal leveres i anmodningsdata.
de: Aktualisierungstoken müssen in den Anfragedaten bereitgestellt werden.
et: Värskendamistokendid peavad olema edastatud päringu andmetes.
hi: रिफ्रेश टोकन अनुरोध डेटा में प्रदान किए जाने चाहिए।
ja: リフレッシュトークンはリクエストデータで提供する必要があります。
lt: Atnaujinimo žetonai turi būti pateikti užklausos duomenyse.
mi: Me whakarato nga tohu whakahou ki nga raraunga tongi.
nl: Verversingstokens moeten worden opgegeven in de aanvraaggegevens.
no: Oppdateringstokens må oppgis i forespørselsdataene.
ro: Token-urile de împrospătare trebuie furnizate în datele cererii.
ru: Токены обновления должны быть предоставлены в данных запроса.
ta: புதுப்பிப்பு டோக்கன்கள் கோரிக்கை தரவில் வழங்கப்பட வேண்டும்.
tl: Ang refresh tokens ay dapat ibigay sa request data.
vi: Refresh token phải được cung cấp trong dữ liệu yêu cầu.

source: Register a new user account.
cy: Cofrestru cyfrif defnyddiwr newydd.
da: Registrer en ny brugerkonto.
de: Registriert ein neues Benutzerkonto.
et: Registreeri uus kasutajakonto.
hi: नया उपयोगकर्ता खाता पंजीकृत करें।
ja: 新しいユーザーアカウントを登録します。
lt: Registruoti naują vartotojo paskyrą.
mi: Rēhita he pūkete kaiwhakamahi hou.
nl: Registreer een nieuw gebruikersaccount.
no: Registrer en ny brukerkonto.
ro: Înregistrează un nou cont de utilizator.
ru: Зарегистрировать новую учетную запись пользователя.
ta: புதிய பயனர் கணக்கை பதிவு செய்யவும்.
tl: Magrehistro ng bagong user account.
vi: Đăng ký tài khoản người dùng mới.

source: Users must verify their email address before the account is fully activated.
cy: Rhaid i ddefnyddwyr wirio eu cyfeiriad e-bost cyn i'r cyfrif gael ei actifadu'n llawn.
da: Brugere skal verificere deres e-mail-adresse, før kontoen er fuldt aktiveret.
de: Benutzer müssen ihre E-Mail-Adresse verifizieren, bevor das Konto vollständig aktiviert wird.
et: Kasutajad peavad kinnitama oma e-posti aadressi enne konto täielikku aktiveerimist.
hi: खाता पूर्ण रूप से सक्रिय होने से पहले उपयोगकर्ताओं को अपना ईमेल पता सत्यापित करना होगा।
ja: アカウントが完全にアクティベートされる前に、ユーザーはメールアドレスを確認する必要があります。
lt: Vartotojai turi patvirtinti savo el. pašto adresą prieš visiškai aktyvuojant paskyrą.
mi: Me whakaū e nga kaiwhakamahi to rātou wāhitau īmēra i mua i te whakahohenga katoa o te pūkete.
nl: Gebruikers moeten hun e-mailadres verifiëren voordat het account volledig wordt geactiveerd.
no: Brukere må bekrefte sin e-postadresse før kontoen er fullstendig aktivert.
ro: Utilizatorii trebuie să își verifice adresa de email înainte ca contul să fie complet activat.
ru: Пользователи должны подтвердить свой адрес электронной почты перед тем, как учетная запись будет полностью активирована.
ta: கணக்கு முழுவதுமாக செயல்படுத்தப்படுவதற்கு முன்பு பயனர்கள் தங்கள் மின்னஞ்சல் முகவரியை சரிபார்க்க வேண்டும்.
tl: Kailangan ng mga user na i-verify ang kanilang email address bago ganap na ma-activate ang account.
vi: Người dùng phải xác minh địa chỉ email của họ trước khi tài khoản được kích hoạt hoàn toàn.
