Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.2.tar.gz/drf_auth_kit-1.1.2/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: cy, da, de, et, hi, ja, lt, mi, nl, no, ro, ru, ta, tl, vi

source: First step of MFA-enabled authentication. Validates credentials and initiates MFA flow.
cy: Cam cyntaf dilysiad â MFA wedi'i alluogi. Dilysu cymwysterau a chychwyn llif MFA.
da: Første trin i MFA-aktiveret autentificering. Validerer legitimationsoplysninger og initierer MFA-flow.
de: Erster Schritt der MFA-aktivierten Authentifizierung. Validiert Anmeldedaten und startet den MFA-Ablauf.
et: MFA-ga autentimise esimene samm. Kontrollib mandaate ja alustab MFA protsessi.
hi: MFA-सक्षम प्रमाणीकरण का पहला चरण। क्रेडेंशियल्स को सत्यापित करता है और MFA फ़्लो आरंभ करता है।
ja: MFA有効認証の最初のステップです。認証情報を確認し、MFAフローを開始します。
lt: Pirmas MFA-įgalintos autentifikacijos žingsnis. Patikrina kredencialus ir inicijuoja MFA srautą.
mi: Te hianga tuatahi o te whakamanatanga MFA-whakahohea. Whakamanatia nga tohu me te whakatīmata rere MFA.
nl: Eerste stap van MFA-geactiveerde authenticatie. Valideert inloggegevens en start MFA-flow.
no: Første trinn i MFA-aktivert autentisering. Validerer legitimasjon og starter MFA-flyt.
ro: Primul pas al autentificării cu MFA activat. Validează acreditările și inițiază fluxul MFA.
ru: Первый шаг аутентификации с поддержкой MFA. Проверяет учетные данные и инициирует поток MFA.
ta: MFA-செயல்படுத்தப்பட்ட அங்கீகாரத்தின் முதல் கட்டம். அங்கீகார விவரங்களை சரிபார்த்து MFA ஒழுங்கைத் துவங்குகிறது.
tl: Unang hakbang ng MFA-enabled authentication. Vina-validate ang credentials at sinimulan ang MFA flow.
vi: Bước đầu tiên của xác thực có MFA. Xác thực thông tin đăng nhập và khởi tạo quy trình MFA.

source: Returns ephemeral token for MFA verification or complete {} if MFA is disabled.
cy: Dychwelyd tocyn dros dro ar gyfer gwirio MFA neu {} cyflawn os yw MFA wedi'i analluogi.
da: Returnerer midlertidigt token til MFA-verificering eller fuldstændige {} hvis MFA er deaktiveret.
de: Gibt temporären Token für MFA-Verifikation zurück oder vollständige {}, wenn MFA deaktiviert ist.
et: Tagastab ajutise tokeni MFA kinnitamiseks või täielikud {}, kui MFA on keelatud.
hi: MFA सत्यापन के लिए अस्थायी टोकन या MFA अक्षम होने पर पूर्ण {} वापस करता है।
ja: MFA確認用の一時トークンを返すか、MFAが無効の場合は完全な{}を返します。
lt: Grąžina laikinąjį žetoną MFA patvirtinimui arba užbaigtą {}, jei MFA yra išjungtas.
mi: Whakahoki ai te tohu roa-poto mo te whakamana MFA tetahi rānei {} katoa mēnā kua monokia te MFA.
nl: Retourneert tijdelijk token voor MFA-verificatie of volledige {} als MFA is uitgeschakeld.
no: Returnerer midlertidig token for MFA-bekreftelse eller fullstendige {} hvis MFA er deaktivert.
ro: Returnează token efemer pentru verificarea MFA sau {} complete dacă MFA este dezactivat.
ru: Возвращает временный токен для проверки MFA или завершает {}, если MFA отключена.
ta: MFA சரிபார்ப்பிற்கான தற்காலிக டோக்கனை வழங்குகிறது அல்லது MFA செயலற்ற நிலையில் {} முடிவு வழங்குகிறது.
tl: Nagbabalik ng ephemeral token para sa MFA verification o kumpletong {} kung ang MFA ay disabled.
vi: Trả về token tạm thời để xác minh MFA hoặc {} hoàn chỉnh nếu MFA bị vô hiệu hóa.

source: Complete MFA authentication using verification code and ephemeral token.
cy: Cwblhau dilysiad MFA gan ddefnyddio cod gwirio a thocyn dros dro.
da: Fuldfør MFA-autentificering ved hjælp af verificeringskode og midlertidigt token.
de: Vervollständigt MFA-Authentifizierung mit Verifikationscode und temporärem Token.
et: Lõpeta MFA autentimine kinnituskoodi ja ajutise tokeni abil.
hi: सत्यापन कोड और अस्थायी टोकन का उपयोग करके MFA प्रमाणीकरण पूर्ण करें।
ja: 確認コードと一時トークンを使用してMFA認証を完了します。
lt: Užbaigti MFA autentifikaciją naudojant patvirtinimo kodą ir laikinąjį žetoną.
mi: Whakaoti te whakamanatanga MFA ma te waehere whakamana me te tohu roa-poto.
nl: Voltooi MFA-authenticatie met verificatiecode en tijdelijk token.
no: Fullfør MFA-autentisering ved hjelp av bekreftelseskode og midlertidig token.
ro: Completează autentificarea MFA folosind codul de verificare și token-ul efemer.
ru: Завершить аутентификацию MFA, используя код проверки и временный токен.
ta: சரிபார்ப்பு கோட் மற்றும் தற்காலிக டோக்கனைப் பயன்படுத்தி MFA அங்கீகாரத்தை முடிக்கவும்.
tl: Kumpletuhin ang MFA authentication gamit ang verification code at ephemeral token.
vi: Hoàn thành xác thực MFA bằng mã xác minh và token tạm thời.

source: Supports both TOTP codes and backup codes for verification.
cy: Cefnogi codau TOTP a chodau wrth gefn ar gyfer gwirio.
da: Understøtter både TOTP-koder og backup-koder til verificering.
de: Unterstützt sowohl TOTP-Codes als auch Backup-Codes zur Verifikation.
et: Toetab nii TOTP koode kui ka varukoode kinnitamiseks.
hi: सत्यापन के लिए TOTP कोड और बैकअप कोड दोनों का समर्थन करता है।
ja: 確認のTOTPコードとバックアップコードの両方をサポートします。
lt: Palaiko ir TOTP kodus, ir atsargos kodus patvirtinimui.
mi: Tautoko nga waehere TOTP me nga waehere putunga mo te whakamana.
nl: Ondersteunt zowel TOTP-codes als back-upcodes voor verificatie.
no: Støtter både TOTP-koder og backup-koder for bekreftelse.
ro: Suportă atât codurile TOTP cât și codurile de rezervă pentru verificare.
ru: Поддерживает как коды TOTP, так и резервные коды для проверки.
ta: சரிபார்ப்பிற்காக TOTP கோட்கள் மற்றும் காப்பு கோட்கள் இரண்டையும் ஆதரிக்கிறது.
tl: Sumusuporta sa parehong TOTP codes at backup codes para sa verification.
vi: Hỗ trợ cả mã TOTP và mã sao lưu để xác minh.

source: Switch to a different MFA method during authentication flow.
cy: Newid i ddull MFA gwahanol yn ystod llif dilysiad.
da: Skift til en anden MFA-metode under autentificeringsflow.
de: Wechselt zu einer anderen MFA-Methode während des Authentifizierungsablaufs.
et: Lülitu teisele MFA meetodile autentimise protsessi käigus.
hi: प्रमाणीकरण फ़्लो के दौरान एक अलग MFA विधि पर स्विच करें।
ja: 認証フロー中に異なるMFA方法に切り替えます。
lt: Pereiti prie kito MFA metodo autentifikacijos srauto metu.
mi: Kōwhiri ki tetahi tikanga MFA kē i te rere whakamanatanga.
nl: Schakel over naar een andere MFA-methode tijdens authenticatieflow.
no: Bytt til en annen MFA-metode under autentiseringsflyt.
ro: Comută la o metodă MFA diferită în timpul fluxului de autentificare.
ru: Переключиться на другой метод MFA во время потока аутентификации.
ta: அங்கீகார ஒழுங்கின் போது வேறு MFA முறைக்கு மாறவும்.
tl: Lumipat sa ibang MFA method sa panahon ng authentication flow.
vi: Chuyển sang phương thức MFA khác trong quá trình xác thực.

source: Requires valid ephemeral token from first step authentication.
cy: Angen tocyn dros dro dilys o ddilysiad cam cyntaf.
da: Kræver gyldigt midlertidigt token fra første trin autentificering.
de: Erfordert gültigen temporären Token aus der ersten Authentifizierungsstufe.
et: Nõuab kehtivat ajutist tokenit esimese sammu autentimisest.
hi: पहले चरण प्रमाणीकरण से वैध अस्थायी टोकन की आवश्यकता है।
ja: 最初のステップ認証からの有効な一時トークンが必要です。
lt: Reikia galiojančio laikinojo žetono iš pirmo žingsnio autentifikacijos.
mi: Me he tohu roa-poto whakawhitiwhiti i te whakamanatanga hianga tuatahi.
nl: Vereist geldig tijdelijk token van eerste stap authenticatie.
no: Krever gyldig midlertidig token fra første trinns autentisering.
ro: Necesită token efemer valid din primul pas de autentificare.
ru: Требует действительный временный токен из первого шага аутентификации.
ta: முதல் கட்ட அங்கீகாரத்திலிருந்து செல்லுபடியான தற்காலிக டோக்கன் தேவை.
tl: Kailangan ng valid ephemeral token mula sa first step authentication.
vi: Yêu cầu token tạm thời hợp lệ từ bước xác thực đầu tiên.

source: New ephemeral token expires in {} seconds.
cy: Mae tocyn dros dro newydd yn dod i ben mewn {} eiliad.
da: Nyt midlertidigt token udløber om {} sekunder.
de: Neuer temporärer Token läuft in {} Sekunden ab.
et: Uus ajutine token aegub {} sekundi pärast.
hi: नया अस्थायी टोकन {} सेकंड में समाप्त हो जाता है।
ja: 新しい一時トークンは{}秒後に期限切れになります。
lt: Naujas laikinasis žetonas nebegalioja po {} sekundžių.
mi: Ka mutu te tohu roa-poto hou i {} hēkona.
nl: Nieuw tijdelijk token verloopt over {} seconden.
no: Nytt midlertidig token utløper om {} sekunder.
ro: Noul token efemer expiră în {} secunde.
ru: Новый временный токен истекает через {} секунд.
ta: புதிய தற்காலிக டோக்கன் {} விநாடிகளில் காலாவதி முடிவடையும்.
tl: Ang bagong ephemeral token ay mag-expire sa {} segundo.
vi: Token tạm thời mới hết hạn trong {} giây.

source: Resend MFA verification code using existing ephemeral token.
cy: Ail-anfon cod gwirio MFA gan ddefnyddio tocyn dros dro presennol.
da: Gensend MFA-verificeringskode ved hjælp af eksisterende midlertidigt token.
de: Sendet MFA-Verifikationscode mit vorhandenem temporärem Token erneut.
et: Saada MFA kinnituskood uuesti olemasoleva ajutise tokeni abil.
hi: मौजूदा अस्थायी टोकन का उपयोग करके MFA सत्यापन कोड पुनः भेजें।
ja: 既存の一時トークンを使用してMFA確認コードを再送信します。
lt: Iš naujo išsiųsti MFA patvirtinimo kodą naudojant esamą laikinąjį žetoną.
mi: Tukuna anō te waehere whakamana MFA ma te tohu roa-poto o nāianei.
nl: Verstuur MFA-verificatiecode opnieuw met bestaand tijdelijk token.
no: Send MFA-bekreftelseskode på nytt ved hjelp av eksisterende midlertidig token.
ro: Retrimite codul de verificare MFA folosind token-ul efemer existent.
ru: Повторно отправить код проверки MFA, используя существующий временный токен.
ta: இருக்கும் தற்காலிக டோக்கனைப் பயன்படுத்தி MFA சரிபார்ப்பு கோடை மீண்டும் அனுப்பவும்.
tl: Muling ipadala ang MFA verification code gamit ang kasalukuyang ephemeral token.
vi: Gửi lại mã xác minh MFA bằng token tạm thời hiện có.

source: Only applicable for methods that require code dispatch (e.g., email).
cy: Dim ond yn berthnasol i ddulliau sy'n gofyn anfon cod (e.e., e-bost).
da: Gælder kun for metoder, der kræver kodeafsendelse (f.eks. e-mail).
de: Nur anwendbar für Methoden, die Code-Versendung erfordern (z.B. E-Mail).
et: Kehtib ainult meetodite kohta, mis nõuavad koodi saatmist (nt e-post).
hi: केवल उन विधियों के लिए लागू जिनके लिए कोड डिस्पैच की आवश्यकता है (जैसे, ईमेल)।
ja: コードの送信が必要な方法（例：メール）にのみ適用されます。
lt: Taikoma tik metodams, kuriems reikia kodo siuntimo (pvz., el. paštas).
mi: Hāngai anake ki nga tikanga me te tuku waehere (hei tauira, īmēra).
nl: Alleen van toepassing op methoden die code verzending vereisen (bijv. e-mail).
no: Gjelder bare for metoder som krever kodesending (f.eks. e-post).
ro: Aplicabil doar pentru metodele care necesită trimiterea codului (ex. email).
ru: Применимо только для методов, которые требуют отправки кода (например, email).
ta: கோட் அனுப்பல் தேவையான முறைகளுக்கு (உதா: மின்னஞ்சல்) மட்டுமே பயன்படும்.
tl: Nalalapat lamang sa mga methods na nangangailangan ng code dispatch (hal., email).
vi: Chỉ áp dụng cho các phương thức yêu cầu gửi mã (ví dụ: email).

source: List all available MFA methods with their setup and activation status. Shows which methods are configured, active, and set as primary.
cy: Rhestr o'r holl ddulliau MFA sydd ar gael gyda'u statws gosod ac actifadu. Dangos pa ddulliau sydd wedi'u ffurfweddu, yn weithredol, a wedi'u gosod fel rhai cynradd.
da: Vis alle tilgængelige MFA-metoder med deres opsætnings- og aktiveringsstatus. Viser hvilke metoder der er konfigureret, aktive og indstillet som primære.
de: Listet alle verfügbaren MFA-Methoden mit ihrem Einrichtungs- und Aktivierungsstatus auf. Zeigt welche Methoden konfiguriert, aktiv und als primär eingestellt sind.
et: Loetleb kõik saadaolevad MFA meetodid koos nende seadistamise ja aktiveerimise staatusega. Näitab, millised meetodid on seadistatud, aktiivsed ja määratud peamisteks.
hi: सभी उपलब्ध MFA विधियों को उनके सेटअप और सक्रियण स्थिति के साथ सूचीबद्ध करें। दिखाता है कि कौन सी विधियां कॉन्फ़िगर की गई हैं, सक्रिय हैं, और प्राथमिक के रूप में सेट की गई हैं।
ja: セットアップとアクティベーション状態とともに利用可能なすべてのMFA方法を一覧表示します。どの方法が設定され、アクティブで、プライマリに設定されているかを表示します。
lt: Išvardinti visus prieinamus MFA metodus su jų nustatymo ir aktyvavimo būsena. Rodo, kurie metodai yra sukonfigūruoti, aktyvūs ir nustatyti kaip pirminiai.
mi: Raina nga tikanga MFA katoa me o rātou tūranga whakarite me te whakahohe. Whakaatu nga tikanga kua whakaritea, hohe, me te whakarite hei matua.
nl: Lijst alle beschikbare MFA-methoden met hun setup en activatiestatus. Toont welke methoden zijn geconfigureerd, actief en ingesteld als primair.
no: List alle tilgjengelige MFA-metoder med deres oppsett og aktiveringsstatus. Viser hvilke metoder som er konfigurert, aktive og satt som primære.
ro: Listează toate metodele MFA disponibile cu statusul lor de configurare și activare. Arată care metode sunt configurate, active și setate ca primare.
ru: Список всех доступных методов MFA с их состоянием настройки и активации. Показывает, какие методы настроены, активны и установлены как основные.
ta: அவற்றின் அமைப்பு மற்றும் செயல்பாடு நிலையுடன் கிடைக்கும் எல்லா MFA முறைகளைப் பட்டியலிடவும். எந்த முறைகள் கான்பிக் செய்யப்பட்டு, செயல்பாட்டில் உள்ளன மற்றும் முக்கியமாக அமைக்கப்பட்டுள்ளன என்பதைக் காட்டுகிறது.
tl: Ilista ang lahat ng available MFA methods kasama ang kanilang setup at activation status. Ipinipakita kung aling methods ang configured, active, at naitakda bilang primary.
vi: Liệt kê tất cả các phương thức MFA có sẵn với trạng thái thiết lập và kích hoạt. Hiển thị phương thức nào được cấu hình, hoạt động và được đặt làm chính.

source: Initialize a new MFA method setup. Creates the method with backup codes and returns setup instructions (e.g., QR code for authenticator apps). Method must be confirmed before activation.
cy: Cychwyn gosod dull MFA newydd. Creu'r dull gyda chodau wrth gefn a dychwelyd cyfarwyddiadau gosod (e.e., cod QR ar gyfer apiau dilysydd). Rhaid cadarnhau'r dull cyn ei actifadu.
da: Initialiser opsætning af ny MFA-metode. Opretter metoden med backup-koder og returnerer opsætningsinstruktioner (f.eks. QR-kode til autentificeringsapps). Metoden skal bekræftes før aktivering.
de: Initialisiert die Einrichtung einer neuen MFA-Methode. Erstellt die Methode mit Backup-Codes und gibt Einrichtungsanweisungen zurück (z.B. QR-Code für Authenticator-Apps). Methode muss vor der Aktivierung bestätigt werden.
et: Alusta uue MFA meetodi seadistamist. Loob meetodi varukoodidega ja tagastab seadistamisjuhised (nt QR kood autentikaatori rakenduste jaoks). Meetod peab olema kinnitatud enne aktiveerimist.
hi: नई MFA विधि सेटअप आरंभ करें। बैकअप कोड के साथ विधि बनाता है और सेटअप निर्देश वापस करता है (जैसे, प्रमाणीकरण ऐप्स के लिए QR कोड)। सक्रियण से पहले विधि की पुष्टि करनी होगी।
ja: 新しいMFA方法のセットアップを初期化します。バックアップコードとともに方法を作成し、セットアップ手順（例：認証アプリ用QRコード）を返します。アクティベーション前に方法を確認する必要があります。
lt: Inicijuoti naują MFA metodo nustatymą. Sukuria metodą su atsargos kodais ir grąžina nustatymo instrukcijas (pvz., QR kodą autentifikatorių programoms). Metodas turi būti patvirtintas prieš aktyvavimą.
mi: Whakatīmata he whakarite tikanga MFA hou. Waihanga te tikanga me nga waehere putunga me te whakahoki tohutohu whakarite (hei tauira, waehere QR mo nga taupānga kaiwhakamana). Me whakaū te tikanga i mua i te whakahohe.
nl: Initialiseer een nieuwe MFA-methode setup. Creëert de methode met back-upcodes en retourneert setup instructies (bijv. QR-code voor authenticator apps). Methode moet worden bevestigd voor activatie.
no: Initialiser et nytt MFA-metodeoppsett. Oppretter metoden med backup-koder og returnerer oppsettinstruksjoner (f.eks. QR-kode for autentiseringsapper). Metoden må bekreftes før aktivering.
ro: Inițializează configurarea unei noi metode MFA. Creează metoda cu coduri de rezervă și returnează instrucțiunile de configurare (ex. cod QR pentru aplicațiile de autentificare). Metoda trebuie confirmată înainte de activare.
ru: Инициализировать настройку нового метода MFA. Создает метод с резервными кодами и возвращает инструкции по настройке (например, QR-код для приложений аутентификации). Метод должен быть подтвержден перед активацией.
ta: புதிய MFA முறை அமைப்பைத் துவங்குகிறது. காப்பு கோட்களுடன் முறையை உருவாக்கி அமைப்பு வழிகாட்டுதல்களை (உதா: அங்கீகரிப்பு அப்லிகேஷன்களுக்கு QR கோட்) வழங்குகிறது. செயல்படுத்தும் முன் முறை உறுதி செய்யப்பட வேண்டும்.
tl: Simulan ang bagong MFA method setup. Gumagawa ng method na may backup codes at nagbabalik ng setup instructions (hal., QR code para sa authenticator apps). Dapat kumpirmahin ang method bago ma-activate.
vi: Khởi tạo thiết lập phương thức MFA mới. Tạo phương thức với mã sao lưu và trả về hướng dẫn thiết lập (ví dụ: mã QR cho ứng dụng xác thực). Phương thức phải được xác nhận trước khi kích hoạt.

source: Confirm and activate a newly created MFA method using verification code. Automatically sets as primary method if no other primary method exists. Required before the method can be used for authentication.
cy: Cadarnhau ac actifadu dull MFA newydd a grewyd gan ddefnyddio cod gwirio. Gosod yn awtomatig fel dull cynradd os nad oes dull cynradd arall yn bodoli. Angenrheidiol cyn y gellir defnyddio'r dull ar gyfer dilysiad.
da: Bekræft og aktiver en nyoprettet MFA-metode ved hjælp af verificeringskode. Indstilles automatisk som primær metode, hvis ingen anden primær metode eksisterer. Krævet før metoden kan bruges til autentificering.
de: Bestätigt und aktiviert eine neu erstellte MFA-Methode mit Verifikationscode. Wird automatisch als primäre Methode gesetzt, wenn keine andere primäre Methode existiert. Erforderlich, bevor die Methode für die Authentifizierung verwendet werden kann.
et: Kinnita ja aktiveeri äsja loodud MFA meetod kinnituskoodi abil. Määrab automaatselt peamiseks meetodiks, kui muud peamist meetodit ei ole. Nõutav enne meetodi kasutamist autentimiseks.
hi: सत्यापन कोड का उपयोग करके नई बनाई गई MFA विधि की पुष्टि करें और सक्रिय करें। यदि कोई अन्य प्राथमिक विधि मौजूद नहीं है तो स्वचालित रूप से प्राथमिक विधि के रूप में सेट हो जाती है। प्रमाणीकरण के लिए विधि का उपयोग करने से पहले आवश्यक है।
ja: 確認コードを使用して新しく作成されたMFA方法を確認し、アクティベートします。他にプライマリ方法が存在しない場合、自動的にプライマリ方法として設定されます。認証に使用する前に必要です。
lt: Patvirtinti ir aktyvuoti naujai sukurtą MFA metodą naudojant patvirtinimo kodą. Automatiškai nustato kaip pirminį metodą, jei nėra kito pirminio metodo. Būtina prieš naudojant metodą autentifikacijai.
mi: Whakaū me te whakahohe he tikanga MFA hou ma te waehere whakamana. Whakarite aunoa hei tikanga matua mēnā kaore he tikanga matua kē. Me i mua i te whakamahi tikanga mo te whakamanatanga.
nl: Bevestig en activeer een nieuw aangemaakte MFA-methode met verificatiecode. Stelt automatisch in als primaire methode als er geen andere primaire methode bestaat. Vereist voordat de methode kan worden gebruikt voor authenticatie.
no: Bekreft og aktiver en nyopprettet MFA-metode ved hjelp av bekreftelseskode. Setter automatisk som primær metode hvis ingen annen primær metode eksisterer. Påkrevd før metoden kan brukes til autentisering.
ro: Confirmă și activează o metodă MFA nou creată folosind codul de verificare. Se setează automat ca metodă primară dacă nu există altă metodă primară. Necesar înainte ca metoda să poată fi folosită pentru autentificare.
ru: Подтвердить и активировать вновь созданный метод MFA, используя код проверки. Автоматически устанавливается как основной метод, если не существует другого основного метода. Требуется перед тем, как метод может быть использован для аутентификации.
ta: சரிபார்ப்பு கோடைப் பயன்படுத்தி புதிதாக உருவாக்கப்பட்ட MFA முறையை உறுதி செய்து செயல்படுத்தவும். வேறு முக்கிய முறை இல்லைனால் தானாகவே முக்கிய முறையாக அமைக்குகிறது. அங்கீகாரத்திற்காக முறையைப் பயன்படுத்தும் முன் தேவை.
tl: Kumpirmahin at i-activate ang bagong MFA method gamit ang verification code. Awtomatikong naitakda bilang primary method kung walang ibang primary method. Kailangan bago magamit ang method para sa authentication.
vi: Xác nhận và kích hoạt phương thức MFA mới tạo bằng mã xác minh. Tự động đặt làm phương thức chính nếu không có phương thức chính nào khác. Bắt buộc trước khi phương thức có thể được sử dụng để xác thực.

source: Deactivate an active MFA method. Requires verification code from the method itself. Cannot deactivate primary methods - set another method as primary first.
cy: Dadactifadu dull MFA gweithredol. Angen cod gwirio o'r dull ei hun. Methu dadactifadu dulliau cynradd - gosod dull arall fel un cynradd yn gyntaf.
da: Deaktiver en aktiv MFA-metode. Kræver verificeringskode fra metoden selv. Kan ikke deaktivere primære metoder - indstil en anden metode som primær først.
de: Deaktiviert eine aktive MFA-Methode. Erfordert Verifikationscode von der Methode selbst. Primäre Methoden können nicht deaktiviert werden - setzen Sie zuerst eine andere Methode als primär.
et: Desaktiveeri aktiivne MFA meetod. Nõuab kinnituskoodi meetodist endast. Ei saa desaktiveerida peamisi meetodeid - määra enne teine meetod peamiseks.
hi: सक्रिय MFA विधि को निष्क्रिय करें। विधि से ही सत्यापन कोड की आवश्यकता है। प्राथमिक विधियों को निष्क्रिय नहीं कर सकते - पहले किसी अन्य विधि को प्राथमिक के रूप में सेट करें।
ja: アクティブなMFA方法を無効化します。方法自体からの確認コードが必要です。プライマリ方法は無効化できません - まず別の方法をプライマリに設定してください。
lt: Išjungti aktyvų MFA metodą. Reikia patvirtinimo kodo iš paties metodo. Negalima išjungti pirminių metodų - pirmiau nustatykite kitą metodą kaip pirminį.
mi: Whakakorekore he tikanga MFA hohe. Me he waehere whakamana i te tikanga ake. Kaore e taea te whakakorekore nga tikanga matua - whakarite he tikanga kē hei matua tuatahi.
nl: Deactiveer een actieve MFA-methode. Vereist verificatiecode van de methode zelf. Kan primaire methoden niet deactiveren - stel eerst een andere methode in als primair.
no: Deaktiver en aktiv MFA-metode. Krever bekreftelseskode fra metoden selv. Kan ikke deaktivere primære metoder - sett en annen metode som primær først.
ro: Dezactivează o metodă MFA activă. Necesită cod de verificare din metoda însăși. Nu pot dezactiva metodele primare - setează altă metodă ca primară mai întâi.
ru: Деактивировать активный метод MFA. Требует код проверки от самого метода. Нельзя деактивировать основные методы - сначала установите другой метод как основной.
ta: செயல்பாட்டில் உள்ள MFA முறையை செயலற்ற நிலையில் வைக்கவும். முறையிலிருந்தே சரிபார்ப்பு கோட் தேவை. முக்கிய முறைகளை செயலற்ற நிலையில் வைக்க முடியாது - முன்னே வேறு முறையை முக்கியமாக அமைக்கவும்.
tl: I-deactivate ang active MFA method. Kailangan ng verification code mula sa method mismo. Hindi maaaring i-deactivate ang primary methods - magtakda muna ng ibang method bilang primary.
vi: Vô hiệu hóa phương thức MFA đang hoạt động. Yêu cầu mã xác minh từ chính phương thức đó. Không thể vô hiệu hóa phương thức chính - hãy đặt phương thức khác làm chính trước.
