Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.2.tar.gz/drf_auth_kit-1.1.2/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: cy, da, de, et, hi, ja, lt, mi, nl, no, ro, ru, ta, tl, vi

source: Set an active MFA method as the primary authentication method. Primary method is used by default during login flow.
cy: Gosod dull MFA gweithredol fel y dull dilysiad cynradd. Defnyddir y dull cynradd yn ddiofyn yn ystod llif mewngofnodi.
da: Indstil en aktiv MFA-metode som den primære autentificeringsmetode. Primær metode bruges som standard under login-flow.
de: Setzt eine aktive MFA-Methode als primäre Authentifizierungsmethode. Primäre Methode wird standardmäßig während des Login-Ablaufs verwendet.
et: Määra aktiivne MFA meetod peamiseks autentimismeetodiks. Peamist meetodit kasutatakse vaikimisi sisselogimise protsessis.
hi: एक सक्रिय MFA विधि को प्राथमिक प्रमाणीकरण विधि के रूप में सेट करें। लॉगिन फ़्लो के दौरान प्राथमिक विधि का उपयोग डिफ़ॉल्ट रूप से किया जाता है।
ja: アクティブなMFA方法をプライマリ認証方法として設定します。プライマリ方法はログインフロー中にデフォルトで使用されます。
lt: Nustatyti aktyvų MFA metodą kaip pirminį autentifikacijos metodą. Pirminis metodas naudojamas pagal numatytuosius nustatymus prisijungimo srauto metu.
mi: Whakarite he tikanga MFA hohe hei tikanga whakamanatanga matua. Ka whakamahi te tikanga matua ma te taunoa i te rere takiuru.
nl: Stel een actieve MFA-methode in als de primaire authenticatiemethode. Primaire methode wordt standaard gebruikt tijdens login flow.
no: Sett en aktiv MFA-metode som den primære autentiseringsmetoden. Primær metode brukes som standard under innloggingsflyt.
ro: Setează o metodă MFA activă ca metodă primară de autentificare. Metoda primară este folosită implicit în timpul fluxului de conectare.
ru: Установить активный метод MFA как основной метод аутентификации. Основной метод используется по умолчанию во время потока входа.
ta: செயல்பாட்டில் உள்ள MFA முறையை முக்கிய அங்கீகார முறையாக அமைக்கவும். முக்கிய முறை உள்நுழைவு ஒழுங்கின் போது இயல்பிலையாக பயன்படுத்தப்படுகிறது.
tl: Itakda ang active MFA method bilang primary authentication method. Ang primary method ay ginagamit sa default sa panahon ng login flow.
vi: Đặt phương thức MFA đang hoạt động làm phương thức xác thực chính. Phương thức chính được sử dụng mặc định trong quá trình đăng nhập.

source: Only one method can be primary at a time.
cy: Dim ond un dull all fod yn gynradd ar y tro.
da: Kun én metode kan være primær ad gangen.
de: Nur eine Methode kann gleichzeitig primär sein.
et: Korraga saab olla ainult üks meetod peamine.
hi: एक समय में केवल एक विधि प्राथमिक हो सकती है।
ja: 一度にプライマリにできる方法は1つだけです。
lt: Vienu metu tik vienas metodas gali būti pirminis.
mi: Kotahi anake tikanga hei matua i tetahi taima.
nl: Slechts één methode kan tegelijk primair zijn.
no: Bare én metode kan være primær om gangen.
ro: Doar o metodă poate fi primară la un moment dat.
ru: Только один метод может быть основным одновременно.
ta: ஒரு நேரத்தில் ஒரு முறை மட்டுமே முக்கியமாக இருக்க முடியும்.
tl: Isang method lang ang maaaring maging primary sa isang oras.
vi: Chỉ một phương thức có thể là chính tại một thời điểm.

source: Requires verification code from current primary method.
cy: Angen cod gwirio o'r dull cynradd cyfredol.
da: Kræver verificeringskode fra aktuel primær metode.
de: Erfordert Verifikationscode von der aktuellen primären Methode.
et: Nõuab kinnituskoodi praegusest peamisest meetodist.
hi: वर्तमान प्राथमिक विधि से सत्यापन कोड की आवश्यकता है।
ja: 現在のプライマリ方法からの確認コードが必要です。
lt: Reikia patvirtinimo kodo iš dabartinio pirminio metodo.
mi: Me he waehere whakamana i te tikanga matua o nāianei.
nl: Vereist verificatiecode van huidige primaire methode.
no: Krever bekreftelseskode fra gjeldende primære metode.
ro: Necesită cod de verificare din metoda primară curentă.
ru: Требует код проверки от текущего основного метода.
ta: தற்போதைய முக்கிய முறையிலிருந்து சரிபார்ப்பு கோட் தேவை.
tl: Kailangan ng verification code mula sa kasalukuyang primary method.
vi: Yêu cầu mã xác minh từ phương thức chính hiện tại.

source: Send verification code for methods that support code dispatch. Useful for testing method configuration or manual code requests.
cy: Anfon cod gwirio ar gyfer dulliau sy'n cefnogi anfon cod. Defnyddiol ar gyfer profi ffurfweddiad dull neu geisiadau cod â llaw.
da: Send verificeringskode for metoder, der understøtter kodeafsendelse. Nyttig til test af metodekonfiguration eller manuelle kodeanmodninger.
de: Sendet Verifikationscode für Methoden, die Code-Versendung unterstützen. Nützlich für das Testen der Methodenkonfiguration oder manuelle Code-Anfragen.
et: Saada kinnituskood meetoditele, mis toetavad koodi saatmist. Kasulik meetodi seadistamise testimiseks või käsitsi koodi taotlemiseks.
hi: कोड डिस्पैच का समर्थन करने वाली विधियों के लिए सत्यापन कोड भेजें। विधि कॉन्फ़िगरेशन का परीक्षण या मैन्युअल कोड अनुरोधों के लिए उपयोगी।
ja: コード送信をサポートする方法に対して確認コードを送信します。方法設定のテストや手動コードリクエストに便利です。
lt: Siųsti patvirtinimo kodą metodams, kurie palaiko kodo siuntimą. Naudinga metodo konfigūracijos testavimui arba rankinėms kodo užklausoms.
mi: Tukuna te waehere whakamana mo nga tikanga tautoko tuku waehere. He pai mo te whakamatau whakarite tikanga me nga tono waehere ringa rānei.
nl: Verstuur verificatiecode voor methoden die code verzending ondersteunen. Nuttig voor testen van methode configuratie of handmatige code aanvragen.
no: Send bekreftelseskode for metoder som støtter kodesending. Nyttig for testing av metodekonfigurasjon eller manuelle kodeforespørsler.
ro: Trimite cod de verificare pentru metodele care suportă trimiterea codului. Util pentru testarea configurației metodei sau cererile manuale de cod.
ru: Отправить код проверки для методов, которые поддерживают отправку кода. Полезно для тестирования конфигурации метода или ручных запросов кода.
ta: கோட் அனுப்பலை ஆதரிக்கும் முறைகளுக்கு சரிபார்ப்பு கோடை அனுப்பவும். முறை கான்பிக்கரேஷனைச் சோதிக்க அல்லது கையேடு கோட் கோரிக்கைகளுக்கு பயனுள்ளது.
tl: Magpadala ng verification code para sa mga methods na sumusuporta sa code dispatch. Kapaki-pakinabang para sa testing ng method configuration o manual code requests.
vi: Gửi mã xác minh cho các phương thức hỗ trợ gửi mã. Hữu ích để kiểm tra cấu hình phương thức hoặc yêu cầu mã thủ công.

source: Permanently delete an MFA method.
cy: Dileu dull MFA yn barhaol.
da: Slet en MFA-metode permanent.
de: Löscht eine MFA-Methode dauerhaft.
et: Kustuta MFA meetod jäädavalt.
hi: MFA विधि को स्थायी रूप से हटाएं।
ja: MFA方法を永久的に削除します。
lt: Visam laikui ištrinti MFA metodą.
mi: Muku mutunga kore he tikanga MFA.
nl: Permanent verwijderen van een MFA-methode.
no: Permanent slett en MFA-metode.
ro: Șterge permanent o metodă MFA.
ru: Навсегда удалить метод MFA.
ta: ஒரு MFA முறையை நிரந்தரமாக நீக்கவும்.
tl: Permanenteng tanggalin ang MFA method.
vi: Xóa vĩnh viễn phương thức MFA.

source: This action cannot be undone.
cy: Ni ellir dadwneud y weithred hon.
da: Denne handling kan ikke fortrydes.
de: Diese Aktion kann nicht rückgängig gemacht werden.
et: Seda tegevust ei saa tagasi võtta.
hi: यह कार्य पूर्ववत नहीं किया जा सकता।
ja: このアクションは元に戻すことができません。
lt: Šis veiksmas negali būti atšauktas.
mi: Kaore tenei mahi e taea te whakakore.
nl: Deze actie kan niet ongedaan worden gemaakt.
no: Denne handlingen kan ikke angres.
ro: Această acțiune nu poate fi anulată.
ru: Это действие нельзя отменить.
ta: இந்த செயலை முன்னே செய்ய முடியாது.
tl: Ang aksyon na ito ay hindi maaaring bawiin.
vi: Hành động này không thể hoàn tác.

source: Cannot delete active methods.
cy: Methu dileu dulliau gweithredol.
da: Kan ikke slette aktive metoder.
de: Aktive Methoden können nicht gelöscht werden.
et: Aktiivseid meetodeid ei saa kustutada.
hi: सक्रिय विधियों को हटाया नहीं जा सकता।
ja: アクティブな方法は削除できません。
lt: Negalima ištrinti aktyvių metodų.
mi: Kaore e taea te muku nga tikanga hohe.
nl: Kan actieve methoden niet verwijderen.
no: Kan ikke slette aktive metoder.
ro: Nu pot șterge metodele active.
ru: Нельзя удалить активные методы.
ta: செயல்பாட்டில் உள்ள முறைகளை நீக்க முடியாது.
tl: Hindi maaaring tanggalin ang active methods.
vi: Không thể xóa phương thức đang hoạt động.

source: Cannot delete primary methods.
cy: Methu dileu dulliau cynradd.
da: Kan ikke slette primære metoder.
de: Primäre Methoden können nicht gelöscht werden.
et: Peamisi meetodeid ei saa kustutada.
hi: प्राथमिक विधियों को हटाया नहीं जा सकता।
ja: プライマリ方法は削除できません。
lt: Negalima ištrinti pirminių metodų.
mi: Kaore e taea te muku nga tikanga matua.
nl: Kan primaire methoden niet verwijderen.
no: Kan ikke slette primære metoder.
ro: Nu pot șterge metodele primare.
ru: Нельзя удалить основные методы.
ta: முக்கிய முறைகளை நீக்க முடியாது.
tl: Hindi maaaring tanggalin ang primary methods.
vi: Không thể xóa phương thức chính.

source: Requires verification code for active methods.
cy: Angen cod gwirio ar gyfer dulliau gweithredol.
da: Kræver verificeringskode for aktive metoder.
de: Erfordert Verifikationscode für aktive Methoden.
et: Nõuab kinnituskoodi aktiivsete meetodite jaoks.
hi: सक्रिय विधियों के लिए सत्यापन कोड की आवश्यकता है।
ja: アクティブな方法に対して確認コードが必要です。
lt: Reikia patvirtinimo kodo aktyviems metodams.
mi: Me he waehere whakamana mo nga tikanga hohe.
nl: Vereist verificatiecode voor actieve methoden.
no: Krever bekreftelseskode for aktive metoder.
ro: Necesită cod de verificare pentru metodele active.
ru: Требует код проверки для активных методов.
ta: செயல்பாட்டில் உள்ள முறைகளுக்கு சரிபார்ப்பு கோட் தேவை.
tl: Kailangan ng verification code para sa active methods.
vi: Yêu cầu mã xác minh cho phương thức đang hoạt động.

source: user
cy: defnyddiwr
da: bruger
de: Benutzer
et: kasutaja
hi: उपयोगकर्ता
ja: ユーザー
lt: vartotojas
mi: kaiwhakamahi
nl: gebruiker
no: bruker
ro: utilizator
ru: пользователь
ta: பயனர்
vi: người dùng

source: User who owns this MFA method
cy: Defnyddiwr sy'n berchen ar y dull MFA hwn
da: Bruger der ejer denne MFA-metode
de: Benutzer, der diese MFA-Methode besitzt
et: Kasutaja, kellele see MFA meetod kuulub
hi: उपयोगकर्ता जो इस MFA विधि का मालिक है
ja: このMFA方法を所有するユーザー
lt: Vartotojas, kuris valdo šį MFA metodą
mi: Kaiwhakamahi nei tenei tikanga MFA
nl: Gebruiker die eigenaar is van deze MFA-methode
no: Bruker som eier denne MFA-metoden
ro: Utilizatorul care deține această metodă MFA
ru: Пользователь, которому принадлежит этот метод MFA
ta: இந்த MFA முறைக்கு உரிமையான பயனர்
tl: User na may-ari ng MFA method na ito
vi: Người dùng sở hữu phương thức MFA này

source: name
cy: enw
da: navn
et: nimi
hi: नाम
ja: 名前
lt: vardas
mi: ingoa
nl: naam
no: navn
ro: nume
ru: имя
ta: பெயர்
tl: pangalan
vi: tên

source: MFA method name (e.g., 'app', 'email')
cy: Enw dull MFA (e.e., 'app', 'email')
da: MFA metode navn (f.eks. 'app', 'email')
de: MFA-Methodenname (z.B. 'app', 'email')
et: MFA meetodi nimi (nt 'app', 'email')
hi: MFA विधि नाम (जैसे, 'app', 'email')
ja: MFA方法名（例：'app'、'email'）
lt: MFA metodo pavadinimas (pvz., 'app', 'email')
mi: Ingoa tikanga MFA (hei tauira, 'taupānga', 'īmēra')
nl: MFA-methode naam (bijv. 'app', 'email')
no: MFA-metodenavn (f.eks. 'app', 'email')
ro: Numele metodei MFA (ex: 'app', 'email')
ru: Название метода MFA (например, 'app', 'email')
ta: MFA முறை பெயர் (எ.கா. 'app', 'email')
tl: Pangalan ng MFA method (hal. 'app', 'email')
vi: Tên phương thức MFA (ví dụ: 'app', 'email')

source: secret
cy: cyfrinach
da: hemmelighed
de: Geheimnis
et: saladus
hi: गुप्त
ja: シークレット
lt: slaptas
mi: muna
nl: geheim
no: hemmelighet
ru: секрет
ta: ரகசியம்
tl: lihim
vi: bí mật

source: TOTP secret key for generating verification codes
cy: Allwedd gyfrinachol TOTP ar gyfer cynhyrchu codau gwirio
da: TOTP hemmelig nøgle til generering af verificeringskoder
de: TOTP-Geheimschlüssel zur Generierung von Verifikationscodes
et: TOTP salavõti kinnituskoodide genereerimiseks
hi: सत्यापन कोड उत्पन्न करने के लिए TOTP गुप्त कुंजी
ja: 確認コードを生成するためのTOTPシークレットキー
lt: TOTP slaptas raktas patvirtinimo kodų generavimui
mi: Kī muna TOTP mō te whakangā waehere whakamana
nl: TOTP geheime sleutel voor het genereren van verificatiecodes
no: TOTP hemmelig nøkkel for å generere bekreftelseskoder
ro: Cheie secretă TOTP pentru generarea codurilor de verificare
ru: Секретный ключ TOTP для генерации кодов проверки
ta: சரிபார்ப்பு கோட்கள் உருவாக்க TOTP ரகசிய விசை
tl: TOTP secret key para sa pagbuo ng mga verification code
vi: Khóa bí mật TOTP để tạo mã xác minh

source: is primary
cy: yn gynradd
da: er primær
de: ist primär
et: on peamine
hi: प्राथमिक है
ja: プライマリ
lt: yra pirminis
mi: he matua
nl: is primair
no: er primær
ro: este primară
ru: является основным
ta: முக்கியமானது
tl: ay primary
vi: là chính

source: Whether this is the user's primary MFA method
cy: A yw hwn yn ddull MFA cynradd y defnyddiwr
da: Om dette er brugerens primære MFA-metode
de: Ob dies die primäre MFA-Methode des Benutzers ist
et: Kas see on kasutaja peamine MFA meetod
hi: क्या यह उपयोगकर्ता की प्राथमिक MFA विधि है
ja: これがユーザーのプライマリMFA方法かどうか
lt: Ar tai vartotojo pirminis MFA metodas
mi: Mēnā rānei tenei te tikanga MFA matua o te kaiwhakamahi
nl: Of dit de primaire MFA-methode van de gebruiker is
no: Om dette er brukerens primære MFA-metode
ro: Dacă aceasta este metoda MFA principală a utilizatorului
ru: Является ли это основным методом MFA пользователя
ta: இது பயனரின் முக்கிய MFA முறையா
tl: Kung ito ba ay primary MFA method ng user
vi: Liệu đây có phải là phương thức MFA chính của người dùng không

source: is active
cy: yn weithredol
da: er aktiv
de: ist aktiv
et: on aktiivne
hi: सक्रिय है
ja: アクティブ
lt: yra aktyvus
mi: he hohe
nl: is actief
no: er aktiv
ro: este activă
ru: активен
ta: செயல்பாட்டில் உள்ளது
tl: ay active
vi: đang hoạt động

source: Whether this method is active and can be used
cy: A yw'r dull hwn yn weithredol ac yn gallu cael ei ddefnyddio
da: Om denne metode er aktiv og kan bruges
de: Ob diese Methode aktiv ist und verwendet werden kann
et: Kas see meetod on aktiivne ja kasutatav
hi: क्या यह विधि सक्रिय है और इसका उपयोग किया जा सकता है
ja: この方法がアクティブで使用できるかどうか
lt: Ar šis metodas yra aktyvus ir gali būti naudojamas
mi: Mēnā rānei he hohe tenei tikanga ā ka taea te whakamahi
nl: Of deze methode actief is en kan worden gebruikt
no: Om denne metoden er aktiv og kan brukes
ro: Dacă această metodă este activă și poate fi utilizată
ru: Является ли этот метод активным и может ли использоваться
ta: இந்த முறை செயல்பாட்டில் உள்ளதா மற்றும் பயன்படுத்த முடியுமா
tl: Kung ang method na ito ay active at maaaring gamitin
vi: Liệu phương thức này có đang hoạt động và có thể được sử dụng không

source: backup codes
cy: codau wrth gefn
da: backup-koder
et: varukoodid
hi: बैकअप कोड
ja: バックアップコード
lt: atsargos kodai
mi: nga waehere putunga
no: backup-koder
ro: coduri de rezervă
ru: резервные коды
ta: காப்பு கோட்கள்
vi: mã sao lưu

source: JSON field storing backup codes for account recovery
cy: Maes JSON sy'n storio codau wrth gefn ar gyfer adfer cyfrif
da: JSON felt der gemmer backup-koder til kontooprettelse
de: JSON-Feld zur Speicherung von Backup-Codes für Kontowiederherstellung
et: JSON väli, mis talletab varukoode konto taastamiseks
hi: खाता पुनर्प्राप्ति के लिए बैकअप कोड संग्रहीत करने वाला JSON फ़ील्ड
ja: アカウント回復用のバックアップコードを保存するJSONフィールド
lt: JSON laukas, saugantis atsargos kodus paskyros atkūrimui
mi: Āpure JSON e penapena nei nga waehere putunga mō te whakahokinga pūkete
nl: JSON-veld dat back-upcodes opslaat voor accountherstel
no: JSON-felt som lagrer reservekoder for kontogjenoppretting
ro: Câmp JSON care stochează codurile de rezervă pentru recuperarea contului
ru: JSON поле для хранения резервных кодов для восстановления аккаунта
ta: கணக்கு மீட்புக்கு காப்பு கோட்களை சேமிக்கும் JSON புலம்
tl: JSON field na nag-iimbak ng backup codes para sa account recovery
vi: Trường JSON lưu trữ mã sao lưu cho việc khôi phục tài khoản

source: MFA Method
cy: Dull MFA
da: MFA-metode
de: MFA-Methode
et: MFA meetod
hi: MFA विधि
ja: MFA方法
lt: MFA metodas
mi: Tikanga MFA
nl: MFA-methode
no: MFA-metode
ro: Metodă MFA
ru: Метод MFA
ta: MFA முறை
vi: Phương thức MFA

source: MFA Methods
cy: Dulliau MFA
da: MFA-metoder
de: MFA-Methoden
et: MFA meetodid
hi: MFA विधियां
ja: MFA方法
lt: MFA metodai
mi: Nga Tikanga MFA
nl: MFA-methoden
no: MFA-metoder
ro: Metode MFA
ru: Методы MFA
ta: MFA முறைகள்
vi: Phương thức MFA

source: Invalid code
cy: Cod annilys
da: Ugyldig kode
de: Ungültiger Code
et: Kehtetu kood
hi: अमान्य कोड
ja: 無効なコード
lt: Neteisingas kodas
mi: Waehere muhu
nl: Ongeldige code
no: Ugyldig kode
ro: Cod invalid
ru: Неверный код
ta: தவறான கோட்
vi: Mã không hợp lệ

source: Invalid token
cy: Tocyn annilys
da: Ugyldig token
de: Ungültiger Token
et: Kehtetu token
hi: अमान्य टोकन
ja: 無効なトークン
lt: Neteisingas žetonas
mi: Tohu muhu
nl: Ongeldig token
no: Ugyldig token
ro: Token invalid
ru: Неверный токен
ta: தவறான டோக்கன்
vi: Token không hợp lệ

source: Please select a new method
cy: Dewiswch ddull newydd
da: Vælg venligst en ny metode
de: Bitte wählen Sie eine neue Methode
et: Palun valige uus meetod
hi: कृपया नई विधि चुनें
ja: 新しい方法を選択してください
lt: Pasirinkite naują metodą
mi: Koa kōwhiri he tikanga hou
nl: Selecteer een nieuwe methode
no: Vennligst velg en ny metode
ro: Vă rugăm selectați o metodă nouă
ru: Пожалуйста, выберите новый метод
ta: கருணை செய்து புதிய முறையைத் தேர்ந்தெடுக்கவும்
tl: Pakiselect ang bagong method
vi: Vui lòng chọn phương thức mới

source: This method is already exists
cy: Mae'r dull hwn eisoes yn bodoli
da: Denne metode eksisterer allerede
de: Diese Methode existiert bereits
et: See meetod on juba olemas
hi: यह विधि पहले से मौजूद है
ja: この方法は既に存在します
lt: Šis metodas jau egzistuoja
mi: Kua rēhia tenei tikanga
nl: Deze methode bestaat al
no: Denne metoden eksisterer allerede
ro: Această metodă există deja
ru: Этот метод уже существует
ta: இந்த முறை ஏற்கனவே இருக்கிறது
tl: Ang method na ito ay umiiral na
vi: Phương thức này đã tồn tại

source: Invalid OTP code
cy: Cod OTP annilys
da: Ugyldig OTP-kode
de: Ungültiger OTP-Code
et: Kehtetu OTP kood
hi: अमान्य OTP कोड
ja: 無効なOTPコード
lt: Neteisingas OTP kodas
mi: Waehere OTP muhu
nl: Ongeldige OTP-code
no: Ugyldig OTP-kode
ro: Cod OTP invalid
ru: Неверный код OTP
ta: தவறான OTP கோட்
vi: Mã OTP không hợp lệ

source: Activated MFA method
cy: Dull MFA wedi'i actifadu
da: Aktiveret MFA-metode
de: MFA-Methode aktiviert
et: MFA meetod aktiveeritud
hi: MFA विधि सक्रिय की गई
ja: MFA方法が有効化されました
lt: Aktyvuotas MFA metodas
mi: Tikanga MFA whakahohea
nl: MFA-methode geactiveerd
no: MFA-metode aktivert
ro: Metodă MFA activată
ru: Активирован метод MFA
ta: MFA முறை செயல்படுத்தப்பட்டது
tl: Na-activate ang MFA method
vi: Đã kích hoạt phương thức MFA

source: You can only deactivate non-primary MFA method.
cy: Gallwch ond dadactifadu dull MFA nad yw'n gynradd.
da: Du kan kun deaktivere ikke-primære MFA-metoder.
de: Sie können nur nicht-primäre MFA-Methoden deaktivieren.
et: Saate desaktiveerida ainult mitte-peamise MFA meetodi.
hi: आप केवल गैर-प्राथमिक MFA विधि को निष्क्रिय कर सकते हैं।
ja: プライマリでないMFA方法のみ無効化できます。
lt: Galite išjungti tik ne pirminį MFA metodą.
mi: Ka taea e koe te whakakorekore tikanga MFA kore-matua anake.
nl: U kunt alleen niet-primaire MFA-methoden deactiveren.
no: Du kan bare deaktivere ikke-primære MFA-metoder.
ro: Puteți dezactiva doar metoda MFA non-primară.
ru: Вы можете деактивировать только неосновные методы MFA.
ta: நீங்கள் முக்கியமல்லாத MFA முறையை மட்டுமே செயலற்ற நிலையில் வைக்க முடியும்.
tl: Maaari mo lamang i-deactivate ang non-primary MFA method.
vi: Bạn chỉ có thể vô hiệu hóa phương thức MFA không phải là chính.

source: Deactivated MFA method
cy: Dull MFA wedi'i ddadactifadu
da: Deaktiveret MFA-metode
de: MFA-Methode deaktiviert
et: MFA meetod desaktiveeritud
hi: MFA विधि निष्क्रिय की गई
ja: MFA方法が無効化されました
lt: Išjungtas MFA metodas
mi: Tikanga MFA whakakorekore
nl: MFA-methode gedeactiveerd
no: MFA-metode deaktivert
ro: Metodă MFA dezactivată
ru: Деактивирован метод MFA
ta: MFA முறை செயலற்ற நிலையில் வைக்கப்பட்டது
tl: Na-deactivate ang MFA method
vi: Đã vô hiệu hóa phương thức MFA

source: Invalid primary method code
cy: Cod dull cynradd annilys
da: Ugyldig primær metodekode
de: Ungültiger Code der primären Methode
et: Kehtetu peamise meetodi kood
hi: अमान्य प्राथमिक विधि कोड
ja: 無効なプライマリ方法コード
lt: Neteisingas pirminio metodo kodas
mi: Waehere tikanga matua muhu
nl: Ongeldige primaire methode code
no: Ugyldig primær metodekode
ro: Cod metodă primară invalid
ru: Неверный код основного метода
ta: தவறான முக்கிய முறை கோட்
vi: Mã phương thức chính không hợp lệ

source: Updated primary MFA method
cy: Dull MFA cynradd wedi'i ddiweddaru
da: Opdateret primær MFA-metode
de: Primäre MFA-Methode aktualisiert
et: Peamine MFA meetod uuendatud
hi: प्राथमिक MFA विधि अपडेट की गई
ja: プライマリMFA方法が更新されました
lt: Atnaujintas pirminis MFA metodas
mi: Tikanga MFA matua whakahoutia
nl: Primaire MFA-methode bijgewerkt
no: Primær MFA-metode oppdatert
ro: Metodă MFA primară actualizată
ru: Обновлен основной метод MFA
ta: முக்கிய MFA முறை புதுப்பிக்கப்பட்டது
tl: Na-update ang primary MFA method
vi: Đã cập nhật phương thức MFA chính

source: Cannot delete active MFA method
cy: Methu dileu dull MFA gweithredol
da: Kan ikke slette aktiv MFA-metode
de: Aktive MFA-Methode kann nicht gelöscht werden
et: Aktiivset MFA meetodit ei saa kustutada
hi: सक्रिय MFA विधि को हटाया नहीं जा सकता
ja: アクティブなMFA方法は削除できません
lt: Negalima ištrinti aktyvaus MFA metodo
mi: Kaore e taea te muku tikanga MFA hohe
nl: Kan actieve MFA-methode niet verwijderen
no: Kan ikke slette aktiv MFA-metode
ro: Nu pot șterge metoda MFA activă
ru: Невозможно удалить активный метод MFA
ta: செயல்பாட்டில் உள்ள MFA முறையை நீக்க முடியாது
tl: Hindi maaaring tanggalin ang active MFA method
vi: Không thể xóa phương thức MFA đang hoạt động

source: Cannot delete primary MFA method
cy: Methu dileu dull MFA cynradd
da: Kan ikke slette primær MFA-metode
de: Primäre MFA-Methode kann nicht gelöscht werden
et: Peamist MFA meetodit ei saa kustutada
hi: प्राथमिक MFA विधि को हटाया नहीं जा सकता
ja: プライマリMFA方法は削除できません
lt: Negalima ištrinti pirminio MFA metodo
mi: Kaore e taea te muku tikanga MFA matua
nl: Kan primaire MFA-methode niet verwijderen
no: Kan ikke slette primær MFA-metode
ro: Nu pot șterge metoda MFA primară
ru: Невозможно удалить основной метод MFA
ta: முக்கிய MFA முறையை நீக்க முடியாது
tl: Hindi maaaring tanggalin ang primary MFA method
vi: Không thể xóa phương thức MFA chính

source: Method does not exist
cy: Nid yw'r dull yn bodoli
da: Metoden findes ikke
de: Methode existiert nicht
et: Meetod ei eksisteeri
hi: विधि मौजूद नहीं है
ja: メソッドが存在しません
lt: Metodas neegzistuoja
mi: Kaore te tikanga i rēhia
nl: Methode bestaat niet
no: Metoden eksisterer ikke
ro: Metoda nu există
ru: Метод не существует
ta: முறை இல்லை
tl: Hindi umiiral ang method
vi: Phương thức không tồn tại

source: Deleted MFA method
cy: Dull MFA wedi'i ddileu
da: Slettet MFA-metode
de: MFA-Methode gelöscht
et: MFA meetod kustutatud
hi: MFA विधि हटा दी गई
ja: MFA方法が削除されました
lt: Ištrintas MFA metodas
mi: Tikanga MFA mukua
nl: MFA-methode verwijderd
no: MFA-metode slettet
ro: Metodă MFA ștearsă
ru: Удален метод MFA
ta: MFA முறை நீக்கப்பட்டது
tl: Natanggal ang MFA method
vi: Đã xóa phương thức MFA

source: MFA code sent
cy: Cod MFA wedi'i anfon
da: MFA-kode sendt
de: MFA-Code gesendet
et: MFA kood saadetud
hi: MFA कोड भेजा गया
ja: MFAコードが送信されました
lt: MFA kodas išsiųstas
mi: Waehere MFA tukuna
nl: MFA-code verzonden
no: MFA-kode sendt
ro: Cod MFA trimis
ru: Код MFA отправлен
ta: MFA கோட் அனுப்பப்பட்டது
tl: Napadala na ang MFA code
vi: Mã MFA đã được gửi

source: Will override cookie.
cy: Bydd yn diystyru cwci.
da: Vil overstyre cookie.
de: Wird Cookie überschreiben.
et: Kirjutab küpsise üle.
hi: कुकी को ओवरराइड करेगा।
ja: クッキーを上書きします。
lt: Perrašys slapuką.
mi: Ka whakaaro ki te kuki.
nl: Zal cookie overschrijven.
no: Vil overstyre cookie.
ro: Va suprascrie cookie-ul.
ru: Перезапишет cookie.
ta: குக்கீயை மீறுவே எழுதும்.
tl: Papalitan ang cookie.
vi: Sẽ ghi đè cookie.
