Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.2.tar.gz/drf_auth_kit-1.1.2/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: cy, da, de, et, hi, ja, lt, mi, nl, no, ro, ru, ta, tl, vi

source: No valid refresh token found.
cy: Dim tocyn adnewyddu dilys wedi'i ganfod.
da: Ingen gyldig opdateringstoken fundet.
de: Kein gültiger Aktualisierungstoken gefunden.
et: Kehtivat värskendamistokenit ei leitud.
hi: कोई वैध रिफ्रेश टोकन नहीं मिला।
ja: 有効なリフレッシュトークンが見つかりません。
lt: Nerasta galiojančio atnaujinimo žetono.
mi: Kaore he tohu whakahou whakawhitiwhiti i kitea.
nl: Geen geldig verversingstoken gevonden.
no: Ingen gyldig oppdateringstoken funnet.
ro: Nu s-a găsit niciun token de împrospătare valid.
ru: Действительный токен обновления не найден.
ta: செல்லுபடியான புதுப்பிப்பு டோக்கன் காணவில்லை.
tl: Walang valid refresh token na nakita.
vi: Không tìm thấy refresh token hợp lệ.

source: E-mail is not verified.
cy: Nid yw'r e-bost wedi'i wirio.
da: E-mail er ikke verificeret.
de: E-Mail ist nicht verifiziert.
et: E-post ei ole kinnitatud.
hi: ईमेल सत्यापित नहीं है।
ja: メールアドレスが確認されていません。
lt: El. paštas nepatvirtintas.
mi: Kaore te īmēra i whakamanatia.
nl: E-mail is niet geverifieerd.
no: E-post er ikke bekreftet.
ro: Email-ul nu este verificat.
ru: Электронная почта не подтверждена.
ta: மின்னஞ்சல் சரிபார்க்கப்படவில்லை.
tl: Hindi na-verify ang e-mail.
vi: Email chưa được xác minh.

source: Unable to log in with provided credentials.
cy: Methu mewngofnodi gyda'r cymwysterau a ddarparwyd.
da: Kan ikke logge ind med de angivne legitimationsoplysninger.
de: Anmeldung mit den angegebenen Anmeldedaten nicht möglich.
et: Esitatud mandaatidega ei saa sisse logida.
hi: प्रदान किए गए क्रेडेंशियल के साथ लॉग इन करने में असमर्थ।
ja: 提供された認証情報でログインできません。
lt: Nepavyko prisijungti su pateiktais kredencialais.
mi: Kaore e taea te takiuru me nga tohu whakarato.
nl: Kan niet inloggen met opgegeven inloggegevens.
no: Kan ikke logge inn med oppgitte legitimasjon.
ro: Nu pot să mă conectez cu acreditările furnizate.
ru: Невозможно войти в систему с предоставленными учетными данными.
ta: வழங்கப்பட்ட அங்கீகார விவரங்களுடன் உள்நுழைவ முடியவில்லை.
tl: Hindi makapag-login gamit ang naibigay na credentials.
vi: Không thể đăng nhập với thông tin đăng nhập được cung cấp.

source: Invalid value
cy: Gwerth annilys
da: Ugyldig værdi
de: Ungültiger Wert
et: Kehtetu väärtus
hi: अमान्य मान
ja: 無効な値
lt: Neteisinga vertė
mi: Uara muhu
nl: Ongeldige waarde
no: Ugyldig verdi
ro: Valoare invalidă
ru: Неверное значение
ta: தவறான மதிப்பு
vi: Giá trị không hợp lệ

source: Your old password was entered incorrectly. Please enter it again.
cy: Cafodd eich hen gyfrinair ei nodi'n anghywir. Nodwch ef eto.
da: Din gamle adgangskode blev indtastet forkert. Indtast den venligst igen.
de: Ihr altes Passwort wurde falsch eingegeben. Bitte geben Sie es erneut ein.
et: Teie vana parool sisestati valesti. Palun sisestage see uuesti.
hi: आपका पुराना पासवर्ड गलत दर्ज किया गया था। कृपया इसे फिर से दर्ज करें।
ja: 古いパスワードが正しく入力されませんでした。再度入力してください。
lt: Jūsų senas slaptažodis buvo įvestas neteisingai. Įveskite jį dar kartą.
mi: Ko to kupuhuna tawhito i whakaurua he. Koa whakaurua anō.
nl: Uw oude wachtwoord is onjuist ingevoerd. Voer het opnieuw in.
no: Ditt gamle passord ble skrevet inn feil. Vennligst skriv det inn igjen.
ro: Parola veche a fost introdusă incorect. Vă rugăm introduceți-o din nou.
ru: Ваш старый пароль введен неправильно. Пожалуйста, введите его снова.
ta: உங்கள் பழைய கடவுச்சொல் தவறாக உள்ளீடப்பட்டது. கருணை செய்து மீண்டும் உள்ளீடவும்.
tl: Ang inyong lumang password ay mali ang pagkakapasok. Pakiulit po.
vi: Mật khẩu cũ của bạn đã được nhập sai. Vui lòng nhập lại.

source: A user is already registered with this e-mail address.
cy: Mae defnyddiwr eisoes wedi'i gofrestru gyda'r cyfeiriad e-bost hwn.
da: En bruger er allerede registreret med denne e-mail-adresse.
de: Ein Benutzer ist bereits mit dieser E-Mail-Adresse registriert.
et: Kasutaja on juba selle e-posti aadressiga registreeritud.
hi: इस ईमेल पते से पहले से ही एक उपयोगकर्ता पंजीकृत है।
ja: このメールアドレスはすでに登録されています。
lt: Vartotojas jau registruotas su šiuo el. pašto adresu.
mi: Kua rēhita he kaiwhakamahi me tenei wāhitau īmēra.
nl: Er is al een gebruiker geregistreerd met dit e-mailadres.
no: En bruker er allerede registrert med denne e-postadressen.
ro: Un utilizator este deja înregistrat cu această adresă de email.
ru: Пользователь уже зарегистрирован с этим адресом электронной почты.
ta: இந்த மின்னஞ்சல் முகவரியில் ஒரு பயனர் ஏற்கனவே பதிவு செய்யப்பட்டுள்ளார்.
tl: May user na nakarehistro sa e-mail address na ito.
vi: Đã có người dùng đăng ký với địa chỉ email này.

source: The two password fields didn't match.
cy: Nid oedd y ddau faes cyfrinair yn cydweddu.
da: De to adgangskodefelter stemte ikke overens.
de: Die beiden Passwort-Felder stimmten nicht überein.
et: Kaks parooli välja ei ühtinud.
hi: दो पासवर्ड फ़ील्ड मेल नहीं खाते।
ja: 2つのパスワードフィールドが一致しません。
lt: Du slaptažodžio laukai nesutapo.
mi: Kaore nga āpure kupuhuna e rua i rite.
nl: De twee wachtwoordvelden komen niet overeen.
no: De to passordeftene stemte ikke overens.
ro: Cele două câmpuri de parolă nu se potrivesc.
ru: Два поля пароля не совпадают.
ta: இரண்டு கடவுச்சொல் களங்கள் பொருந்தவில்லை.
tl: Ang dalawang password fields ay hindi magkatugma.
vi: Hai trường mật khẩu không khớp.

source: Social account email must match your current account email.
cy: Rhaid i e-bost cyfrif cymdeithasol gydweddu â'ch e-bost cyfrif cyfredol.
da: Social konto e-mail skal matche din nuværende konto e-mail.
de: Die E-Mail des sozialen Kontos muss mit Ihrer aktuellen Konto-E-Mail übereinstimmen.
et: Sotsiaalse konto e-post peab ühtima teie praeguse konto e-postiga.
hi: सामाजिक खाता ईमेल आपके वर्तमान खाता ईमेल से मेल खाना चाहिए।
ja: ソーシャルアカウントのメールは現在のアカウントメールと一致する必要があります。
lt: Socialinės paskyros el. paštas turi sutapti su jūsų dabartinės paskyros el. paštu.
mi: Me rite te īmēra pūkete pāpori ki to īmēra pūkete o nāianei.
nl: Sociaal account e-mail moet overeenkomen met uw huidige account e-mail.
no: Sosial konto e-post må stemme overens med din nåværende konto e-post.
ro: Email-ul contului social trebuie să se potrivească cu email-ul contului curent.
ru: Email социального аккаунта должен совпадать с email вашего текущего аккаунта.
ta: சாமூக கணக்கு மின்னஞ்சல் உங்கள் தற்போதைய கணக்கு மின்னஞ்சலுடன் பொருந்த வேண்டும்.
tl: Ang social account email ay dapat tumugma sa inyong kasalukuyang account email.
vi: Email tài khoản mạng xã hội phải trùng khớp với email tài khoản hiện tại của bạn.

source: Connected
cy: Wedi cysylltu
da: Tilsluttet
de: Verbunden
et: Ühendatud
hi: कनेक्ट किया गया
ja: 接続済み
lt: Prisijungta
mi: Honoa
nl: Verbonden
no: Tilkoblet
ro: Conectat
ru: Подключено
ta: இணைக்கப்பட்டது
tl: Nakaconnect
vi: Đã kết nối

source: Failed to complete OAuth flow
cy: Methu cwblhau llif OAuth
da: Fejlede i at fuldføre OAuth-flow
de: OAuth-Flow konnte nicht abgeschlossen werden
et: OAuth voog ebaõnnestus
hi: OAuth फ़्लो पूर्ण करने में विफल
ja: OAuthフローの完了に失敗しました
lt: Nepavyko užbaigti OAuth srauto
mi: I rahua te whakaoti rere OAuth
nl: Kan OAuth-flow niet voltooien
no: Klarte ikke å fullføre OAuth-flyt
ro: Nu s-a reușit completarea fluxului OAuth
ru: Не удалось завершить поток OAuth
ta: OAuth ஒழுங்கை முடிக்க முடியவில்லை
tl: Hindi nakumpleto ang OAuth flow
vi: Không thể hoàn thành quy trình OAuth

source: User is already registered with this e-mail address.
cy: Mae defnyddiwr eisoes wedi'i gofrestru gyda'r cyfeiriad e-bost hwn.
da: Bruger er allerede registreret med denne e-mail-adresse.
de: Benutzer ist bereits mit dieser E-Mail-Adresse registriert.
et: Kasutaja on juba selle e-posti aadressiga registreeritud.
hi: इस ईमेल पते से उपयोगकर्ता पहले से ही पंजीकृत है।
ja: ユーザーはすでにこのメールアドレスで登録されています。
lt: Vartotojas jau registruotas su šiuo el. pašto adresu.
mi: Kua rēhita te kaiwhakamahi me tenei wāhitau īmēra.
nl: Gebruiker is al geregistreerd met dit e-mailadres.
no: Bruker er allerede registrert med denne e-postadressen.
ro: Utilizatorul este deja înregistrat cu această adresă de email.
ru: Пользователь уже зарегистрирован с этим адресом электронной почты.
ta: இந்த மின்னஞ்சல் முகவரியில் பயனர் ஏற்கனவே பதிவு செய்யப்பட்டுள்ளார்.
tl: Ang user ay nakarehistro na sa e-mail address na ito.
vi: Người dùng đã đăng ký với địa chỉ email này.

source: Failed to exchange code for access token
cy: Methu cyfnewid cod am docyn mynediad
da: Fejlede i at veksle kode til adgangstoken
de: Austausch des Codes gegen Zugriffstoken fehlgeschlagen
et: Koodi vahetamine juurdepääsutokeni vastu ebaõnnestus
hi: एक्सेस टोकन के लिए कोड एक्सचेंज करने में विफल
ja: コードをアクセストークンに交換することに失敗しました
lt: Nepavyko pakeisti kodo į prieigos žetoną
mi: I rahua te whakawhiti waehere mo te tohu urunga
nl: Kan code niet uitwisselen voor toegangstoken
no: Klarte ikke å veksle kode for tilgangstoken
ro: Nu s-a reușit schimbarea codului pentru token de acces
ru: Не удалось обменять код на токен доступа
ta: அணுகல் டோக்கனுக்காக கோடை மாற்ற முடியவில்லை
tl: Hindi naging matagumpay ang exchange ng code para sa access token
vi: Không thể đổi mã lấy access token

source: Authenticate with {} using OAuth2/OpenID Connect authorization code to obtain access tokens.
cy: Dilysu gyda {} gan ddefnyddio cod awdurdodi OAuth2/OpenID Connect i gael tocynnau mynediad.
da: Autentificer med {} ved hjælp af OAuth2/OpenID Connect autorisationskode for at få adgangstokens.
de: Authentifizieren Sie sich mit {} über OAuth2/OpenID Connect Autorisierungscode, um Zugriffstoken zu erhalten.
et: Autentimiseks {} abil OAuth2/OpenID Connect autoriseerimiskoodi kasutades juurdepääsutokende saamiseks.
hi: एक्सेस टोकन प्राप्त करने के लिए OAuth2/OpenID Connect प्राधिकरण कोड का उपयोग करके {} के साथ प्रमाणीकरण करें।
ja: アクセストークンを取得するために{}でOAuth2/OpenID Connect認証コードを使用して認証してください。
lt: Autentifikuotis su {} naudojant OAuth2/OpenID Connect autorizacijos kodą, kad gautumėte prieigos žetonus.
mi: Whakamanatia me {} ma te waehere whakamana OAuth2/OpenID Connect hoki nga tohu urunga.
nl: Authenticeer met {} met behulp van OAuth2/OpenID Connect autorisatiecode om toegangstokens te verkrijgen.
no: Autentiser med {} ved hjelp av OAuth2/OpenID Connect autorisasjonskode for å få tilgangstokens.
ro: Autentifică cu {} folosind codul de autorizare OAuth2/OpenID Connect pentru a obține token-uri de acces.
ru: Пройдите аутентификацию с {}, используя код авторизации OAuth2/OpenID Connect для получения токенов доступа.
ta: அணுகல் டோக்கன்களைப் பெற OAuth2/OpenID Connect அங்கீகார கோடைப் பயன்படுத்தி {} உடன் அங்கீகரிக்கவும்.
tl: Mag-authenticate gamit ang {} sa pamamagitan ng OAuth2/OpenID Connect authorization code para makakuha ng access tokens.
vi: Xác thực với {} bằng mã authorization OAuth2/OpenID Connect để lấy access token.

source: Connect a {} account to the current user's account. This allows the user to login using their existing {} account in the future.
cy: Cysylltu cyfrif {} i gyfrif y defnyddiwr cyfredol. Mae hyn yn caniatáu i'r defnyddiwr fewngofnodi gan ddefnyddio eu cyfrif {} presennol yn y dyfodol.
da: Tilslut en {}-konto til den nuværende brugers konto. Dette giver brugeren mulighed for at logge ind ved hjælp af deres eksisterende {}-konto i fremtiden.
de: Verbinden Sie ein {}-Konto mit dem aktuellen Benutzerkonto. Dies ermöglicht es dem Benutzer, sich in Zukunft mit seinem bestehenden {}-Konto anzumelden.
et: Ühenda {} konto praeguse kasutaja kontoga. See võimaldab kasutajal tulevikus sisse logida oma olemasoleva {} konto abil.
hi: वर्तमान उपयोगकर्ता के खाते से {} खाता कनेक्ट करें। यह उपयोगकर्ता को भविष्य में अपने मौजूदा {} खाते का उपयोग करके लॉगिन करने की अनुमति देता है।
ja: {}アカウントを現在のユーザーアカウントに接続します。これにより、ユーザーは将来的に既存の{}アカウントを使用してログインできます。
lt: Prijungti {} paskyrą prie dabartinio vartotojo paskyros. Tai leidžia vartotojui prisijungti naudojant esamą {} paskyrą ateityje.
mi: Honoa he pūkete {} ki te pūkete o te kaiwhakamahi o nāianei. Tenei whakaaetanga te kaiwhakamahi takiuru ma to rātou pūkete {} o mua i nga rā o mua.
nl: Verbind een {} account met het huidige gebruikersaccount. Dit stelt de gebruiker in staat om in de toekomst in te loggen met hun bestaande {} account.
no: Koble en {}-konto til den gjeldende brukerens konto. Dette tillater brukeren å logge inn ved hjelp av deres eksisterende {}-konto i fremtiden.
ro: Conectează un cont {} la contul utilizatorului curent. Aceasta permite utilizatorului să se conecteze folosind contul {} existent în viitor.
ru: Подключить аккаунт {} к аккаунту текущего пользователя. Это позволяет пользователю входить в систему, используя существующий аккаунт {} в будущем.
ta: {} கணக்கை தற்போதைய பயனரின் கணக்குடன் இணைக்கவும். இது பயனர் எதிர்காலத்தில் அவர்களின் ஏற்கனவே உள்ள {} கணக்கைப் பயன்படுத்தி உள்நுழைவ அனுமதிக்கிறது.
tl: Mag-connect ng {} account sa kasalukuyang user account. Ito ay nagbibigay-daan sa user na mag-login gamit ang kanilang existing {} account sa hinaharap.
vi: Kết nối tài khoản {} với tài khoản người dùng hiện tại. Điều này cho phép người dùng đăng nhập bằng tài khoản {} hiện có trong tương lai.

source: Requires authentication and a valid OAuth2/OpenID Connect authorization code from {}.
cy: Angen dilysu a chod awdurdodi OAuth2/OpenID Connect dilys o {}.
da: Kræver autentificering og en gyldig OAuth2/OpenID Connect autorisationskode fra {}.
de: Erfordert Authentifizierung und einen gültigen OAuth2/OpenID Connect Autorisierungscode von {}.
et: Nõuab autentimist ja kehtivat OAuth2/OpenID Connect autoriseerimiskoodi {}-ist.
hi: {} से प्रमाणीकरण और वैध OAuth2/OpenID Connect प्राधिकरण कोड की आवश्यकता है।
ja: 認証と{}からの有効なOAuth2/OpenID Connect認証コードが必要です。
lt: Reikia autentifikacijos ir galiojančio OAuth2/OpenID Connect autorizacijos kodo iš {}.
mi: Me whakamanatia me he waehere whakamana OAuth2/OpenID Connect whakawhitiwhiti i {}.
nl: Vereist authenticatie en een geldige OAuth2/OpenID Connect autorisatiecode van {}.
no: Krever autentisering og en gyldig OAuth2/OpenID Connect autorisasjonskode fra {}.
ro: Necesită autentificare și un cod de autorizare OAuth2/OpenID Connect valid de la {}.
ru: Требует аутентификацию и действительный код авторизации OAuth2/OpenID Connect от {}.
ta: {} இலிருந்து அங்கீகாரம் மற்றும் செல்லுபடியான OAuth2/OpenID Connect அங்கீகார கோட் தேவை.
tl: Kailangan ng authentication at valid OAuth2/OpenID Connect authorization code mula sa {}.
vi: Yêu cầu xác thực và mã authorization OAuth2/OpenID Connect hợp lệ từ {}.

source: On success, the {} account is linked and can be used for future logins.
cy: Ar lwyddiant, mae'r cyfrif {} wedi'i gysylltu a gellir ei ddefnyddio ar gyfer mewngofnodi yn y dyfodol.
da: Ved succes linkes {}-kontoen og kan bruges til fremtidige logins.
de: Bei Erfolg wird das {}-Konto verknüpft und kann für zukünftige Anmeldungen verwendet werden.
et: Edu korral on {} konto lingitud ja seda saab kasutada tulevaste sisselogimiste jaoks.
hi: सफलता पर, {} खाता लिंक हो जाता है और भविष्य के लॉगिन के लिए उपयोग किया जा सकता है।
ja: 成功すると、{}アカウントがリンクされ、将来のログインで使用できます。
lt: Sėkmės atveju {} paskyra susieta ir gali būti naudojama ateities prisijungimams.
mi: I te angitū, ka honoa te pūkete {} ā ka taea te whakamahi mō nga takiuru a mua.
nl: Bij succes wordt het {} account gekoppeld en kan het worden gebruikt voor toekomstige logins.
no: Ved suksess blir {}-kontoen koblet og kan brukes til fremtidige innlogginger.
ro: La succes, contul {} este conectat și poate fi folosit pentru conectări viitoare.
ru: При успехе аккаунт {} связывается и может использоваться для будущих входов в систему.
ta: வெற்றிகரமாக இருந்தால், {} கணக்கு இணைக்கப்பட்டு எதிர்காலத்தில் உள்நுழைவுகளுக்கு பயன்படுத்தப்படலாம்.
tl: Kapag matagumpay, ang {} account ay ma-link at maaaring gamitin para sa mga future logins.
vi: Khi thành công, tài khoản {} sẽ được liên kết và có thể được sử dụng cho các lần đăng nhập trong tương lai.

source: List all social accounts connected to the current user. Shows account details including provider, UID, and connection dates.
cy: Rhestr o'r holl gyfrifon cymdeithasol wedi'u cysylltu i'r defnyddiwr cyfredol. Dangos manylion cyfrif gan gynnwys darparwr, UID, a dyddiadau cysylltu.
da: List alle sociale konti forbundet til den nuværende bruger. Viser konto-detaljer inklusiv udbyder, UID og tilslutningsdatoer.
de: Listet alle mit dem aktuellen Benutzer verbundenen sozialen Konten auf. Zeigt Kontodetails einschließlich Anbieter, UID und Verbindungsdaten.
et: Loetleb kõik praeguse kasutajaga ühendatud sotsiaalsed kontod. Näitab konto üksikasjasid, sealhulgas teenusepakkujat, UID-d ja ühendamise kuupäevi.
hi: वर्तमान उपयोगकर्ता से जुड़े सभी सामाजिक खातों की सूची। प्रदाता, UID और कनेक्शन तिथियों सहित खाता विवरण दिखाता है।
ja: 現在のユーザーに接続されているすべてのソーシャルアカウントを一覧表示します。プロバイダー、UID、接続日を含むアカウントの詳細を表示します。
lt: Išvardinti visas socialines paskyras, prijungtas prie dabartinio vartotojo. Rodo paskyros detales, įskaitant teikėją, UID ir prisijungimo datas.
mi: Raina nga pūkete pāpori katoa kua honoa ki te kaiwhakamahi o nāianei. Whakaatu nga taipitopito pūkete me te kaiwhakamahi, UID, me nga rā hononga.
nl: Lijst alle sociale accounts die zijn verbonden met de huidige gebruiker. Toont accountgegevens inclusief provider, UID en verbindingsdatums.
no: List alle sosiale kontoer som er koblet til den gjeldende brukeren. Viser kontodetaljer inkludert leverandør, UID og koblingsdatoer.
ro: Listează toate conturile sociale conectate la utilizatorul curent. Arată detaliile contului incluzând furnizorul, UID-ul și datele de conectare.
ru: Список всех социальных аккаунтов, подключенных к текущему пользователю. Показывает детали аккаунта, включая провайдера, UID и даты подключения.
ta: தற்போதைய பயனருடன் இணைக்கப்பட்ட அனைத்து சாமூக கணக்குகளையும் பட்டியலிடவும். வழங்குநர், UID, மற்றும் இணைப்பு தேதிகள் உள்பட கணக்கு விவரங்களைக் காட்டுகிறது.
tl: Ilista ang lahat ng social accounts na nakaconnect sa kasalukuyang user. Ipinakita ang account details kasama ang provider, UID, at connection dates.
vi: Liệt kê tất cả tài khoản mạng xã hội được kết nối với người dùng hiện tại. Hiển thị chi tiết tài khoản bao gồm nhà cung cấp, UID và ngày kết nối.

source: Disconnect a social account from the current user. Removes the social account connection and prevents future logins via that provider. Requires authentication and the account must belong to the current user.
cy: Datgysylltu cyfrif cymdeithasol oddi wrth y defnyddiwr cyfredol. Tynnu'r cysylltiad cyfrif cymdeithasol ac atal mewngofnodi yn y dyfodol trwy'r darparwr hwnnw. Angen dilysu a rhaid i'r cyfrif berthyn i'r defnyddiwr cyfredol.
da: Frakobl en social konto fra den nuværende bruger. Fjerner den sociale kontoforbindelse og forhindrer fremtidige logins via den udbyder. Kræver autentificering og kontoen skal tilhøre den nuværende bruger.
de: Trennt ein soziales Konto vom aktuellen Benutzer. Entfernt die soziale Kontoverknüpfung und verhindert zukünftige Anmeldungen über diesen Anbieter. Erfordert Authentifizierung und das Konto muss dem aktuellen Benutzer gehören.
et: Ühenda sotsiaalne konto praegusest kasutajast lahti. Eemaldab sotsiaalse konto ühenduse ja takistab tulevasi sisselogimisi selle teenusepakkuja kaudu. Nõuab autentimist ja konto peab kuuluma praegusele kasutajale.
hi: वर्तमान उपयोगकर्ता से सामाजिक खाता डिस्कनेक्ट करें। सामाजिक खाता कनेक्शन हटाता है और उस प्रदाता के माध्यम से भविष्य के लॉगिन को रोकता है। प्रमाणीकरण की आवश्यकता है और खाता वर्तमान उपयोगकर्ता का होना चाहिए।
ja: 現在のユーザーからソーシャルアカウントを切断します。ソーシャルアカウント接続を削除し、そのプロバイダー経由での将来のログインを防ぎます。認証が必要で、アカウントは現在のユーザーに属している必要があります。
lt: Atjungti socialinę paskyrą nuo dabartinio vartotojo. Panaikina socialinės paskyros ryšį ir neleidžia ateities prisijungimų per tą teikėją. Reikia autentifikacijos ir paskyra turi priklausyti dabartiniam vartotojui.
mi: Wetekina he pūkete pāpori i te kaiwhakamahi o nāianei. Tangohia te hononga pūkete pāpori me te aukati nga takiuru a mua ma taua kaiwhakamahi. Me whakamanatia me no te kaiwhakamahi o nāianei te pūkete.
nl: Ontkoppel een sociaal account van de huidige gebruiker. Verwijdert de sociale accountverbinding en voorkomt toekomstige logins via die provider. Vereist authenticatie en het account moet eigendom zijn van de huidige gebruiker.
no: Koble fra en sosial konto fra den gjeldende brukeren. Fjerner den sosiale kontokoblingen og forhindrer fremtidige innlogginger via den leverandøren. Krever autentisering og kontoen må tilhøre den gjeldende brukeren.
ro: Deconectează un cont social de la utilizatorul curent. Elimină conexiunea contului social și previne conectările viitoare prin acel furnizor. Necesită autentificare și contul trebuie să aparțină utilizatorului curent.
ru: Отключить социальный аккаунт от текущего пользователя. Удаляет соединение социального аккаунта и предотвращает будущие входы через этого провайдера. Требует аутентификацию и аккаунт должен принадлежать текущему пользователю.
ta: தற்போதைய பயனரிடமிருந்து சாமூக கணக்கை துண்டிக்கவும். சாமூக கணக்கு இணைப்பை நீக்கி அந்த வழங்குநர் மூலம் எதிர்காலத்தில் உள்நுழைவுகளை தடுக்கிறது. அங்கீகாரம் தேவை மற்றும் கணக்கு தற்போதைய பயனருக்கு சொந்தமானதாக இருக்க வேண்டும்.
tl: I-disconnect ang social account mula sa kasalukuyang user. Tinatanggal ang social account connection at pinipigilan ang mga future logins sa pamamagitan ng provider na iyon. Kailangan ng authentication at ang account ay dapat pag-aari ng kasalukuyang user.
vi: Ngắt kết nối tài khoản mạng xã hội khỏi người dùng hiện tại. Xóa kết nối tài khoản mạng xã hội và ngăn chặn đăng nhập trong tương lai qua nhà cung cấp đó. Yêu cầu xác thực và tài khoản phải thuộc về người dùng hiện tại.

source: adapter_class is not defined
cy: Nid yw adapter_class wedi'i ddiffinio
da: adapter_class er ikke defineret
de: adapter_class ist nicht definiert
et: adapter_class ei ole määratletud
hi: adapter_class परिभाषित नहीं है
ja: adapter_classが定義されていません
lt: adapter_class nėra apibrėžtas
mi: Kaore te adapter_class i whakamāramahia
nl: adapter_class is niet gedefinieerd
no: adapter_class er ikke definert
ro: adapter_class nu este definit
ru: adapter_class не определен
ta: adapter_class வரையறுக்கப்படவில்லை
tl: hindi nadefine ang adapter_class
vi: adapter_class không được định nghĩa

source: Refresh token was not included in cookie data.
cy: Ni chynhwyswyd tocyn adnewyddu yn nata'r cwci.
da: Opdateringstoken var ikke inkluderet i cookie-data.
de: Aktualisierungstoken war nicht in den Cookie-Daten enthalten.
et: Värskendamistoken ei olnud küpsise andmetes.
hi: रिफ्रेश टोकन कुकी डेटा में शामिल नहीं था।
ja: リフレッシュトークンがクッキーデータに含まれていませんでした。
lt: Atnaujinimo žetonas nebuvo įtrauktas į slapuko duomenis.
mi: Kaore te tohu whakahou i whakaurua ki nga raraunga kuki.
nl: Verversingstoken was niet opgenomen in cookie gegevens.
no: Oppdateringstoken var ikke inkludert i cookie-data.
ro: Token-ul de împrospătare nu a fost inclus în datele cookie.
ru: Токен обновления не был включен в данные cookie.
ta: குக்கீ தரவில் புதுப்பிப்பு டோக்கன் சேர்க்கப்படவில்லை.
tl: Ang refresh token ay hindi kasama sa cookie data.
vi: Refresh token không được bao gồm trong dữ liệu cookie.

source: Refresh token was not included in request data.
cy: Ni chynhwyswyd tocyn adnewyddu yn nata'r cais.
da: Opdateringstoken var ikke inkluderet i anmodningsdata.
de: Aktualisierungstoken war nicht in den Anfragedaten enthalten.
et: Värskendamistoken ei olnud päringu andmetes.
hi: रिफ्रेश टोकन अनुरोध डेटा में शामिल नहीं था।
ja: リフレッシュトークンがリクエストデータに含まれていませんでした。
lt: Atnaujinimo žetonas nebuvo įtrauktas į užklausos duomenis.
mi: Kaore te tohu whakahou i whakaurua ki nga raraunga tongi.
nl: Verversingstoken was niet opgenomen in aanvraaggegevens.
no: Oppdateringstoken var ikke inkludert i forespørselsdata.
ro: Token-ul de împrospătare nu a fost inclus în datele cererii.
ru: Токен обновления не был включен в данные запроса.
ta: கோரிக்கை தரவில் புதுப்பிப்பு டோக்கன் சேர்க்கப்படவில்லை.
tl: Ang refresh token ay hindi kasama sa request data.
vi: Refresh token không được bao gồm trong dữ liệu yêu cầu.
