Repository: pypi-data/pypi-mirror-402
Catalog: packages/drf-auth-kit/drf_auth_kit-1.1.2.tar.gz/drf_auth_kit-1.1.2/auth_kit/locale/*/LC_MESSAGES/django.po
Languages: cy, da, de, et, hi, ja, lt, mi, nl, no, ro, ru, ta, tl, vi

source: An error has occurred.
cy: Mae gwall wedi digwydd.
da: Der er opstået en fejl.
de: Ein Fehler ist aufgetreten.
et: Ilmnes viga.
hi: एक त्रुटि हुई है।
ja: エラーが発生しました。
lt: Įvyko klaida.
mi: Kua hapa.
nl: Er is een fout opgetreden.
no: En feil har oppstått.
ro: A apărut o eroare.
ru: Произошла ошибка.
ta: ஒரு பிழை ஏற்பட்டது.
tl: May error na naganap.
vi: Đã xảy ra lỗi.

source: Successfully logged out.
cy: Wedi allgofnodi'n llwyddiannus.
da: Logget ud med succes.
de: Erfolgreich abgemeldet.
et: Edukalt välja logitud.
hi: सफलतापूर्वक लॉग आउट हो गया।
ja: ログアウトしました。
lt: Sėkmingai atsijungta.
mi: I whakaputaina pai.
nl: Succesvol uitgelogd.
no: Logget ut med suksess.
ro: Deconectat cu succes.
ru: Успешно вышли из системы.
ta: வெற்றிகரமாக வெளியேறப்பட்டது.
tl: Matagumpay na nag-logout.
vi: Đăng xuất thành công.

source: Password reset e-mail has been sent.
cy: Mae e-bost ailosod cyfrinair wedi'i anfon.
da: E-mail til nulstilling af adgangskode er blevet sendt.
de: E-Mail zum Zurücksetzen des Passworts wurde gesendet.
et: Parooli lähtestamise e-post on saadetud.
hi: पासवर्ड रीसेट ईमेल भेजा गया है।
ja: パスワードリセットメールが送信されました。
lt: Slaptažodžio atstatymo el. laiškas buvo išsiųstas.
mi: Kua tukuna te īmēra tautuhi kupuhuna.
nl: Wachtwoord reset e-mail is verzonden.
no: E-post for passordnullstilling har blitt sendt.
ro: Email-ul de resetare a parolei a fost trimis.
ru: Письмо для сброса пароля отправлено.
ta: கடவுச்சொல் மீட்டமைப்பு மின்னஞ்சல் அனுப்பப்பட்டது.
tl: Napadala na ang password reset e-mail.
vi: Email đặt lại mật khẩu đã được gửi.

source: Password has been reset with the new password.
cy: Mae'r cyfrinair wedi'i ailosod gyda'r cyfrinair newydd.
da: Adgangskoden er blevet nulstillet med den nye adgangskode.
de: Passwort wurde mit dem neuen Passwort zurückgesetzt.
et: Parool on uue parooliga lähtestatud.
hi: नए पासवर्ड के साथ पासवर्ड रीसेट कर दिया गया है।
ja: パスワードが新しいパスワードでリセットされました。
lt: Slaptažodis atstatytas su nauju slaptažodžiu.
mi: Kua tautuhi te kupuhuna me te kupuhuna hou.
nl: Wachtwoord is gereset met het nieuwe wachtwoord.
no: Passord har blitt nullstilt med det nye passordet.
ro: Parola a fost resetată cu noua parolă.
ru: Пароль был сброшен с новым паролем.
ta: புதிய கடவுச்சொல்லுடன் கடவுச்சொல் மீட்டமைக்கப்பட்டது.
tl: Na-reset na ang password gamit ang bagong password.
vi: Mật khẩu đã được đặt lại với mật khẩu mới.

source: New password has been saved.
cy: Mae'r cyfrinair newydd wedi'i gadw.
da: Ny adgangskode er blevet gemt.
de: Neues Passwort wurde gespeichert.
et: Uus parool on salvestatud.
hi: नया पासवर्ड सेव हो गया है।
ja: 新しいパスワードが保存されました。
lt: Naujas slaptažodis išsaugotas.
mi: Kua tiakina te kupuhuna hou.
nl: Nieuw wachtwoord is opgeslagen.
no: Nytt passord har blitt lagret.
ro: Noua parolă a fost salvată.
ru: Новый пароль сохранен.
ta: புதிய கடவுச்சொல் சேமிக்கப்பட்டது.
tl: Na-save na ang bagong password.
vi: Mật khẩu mới đã được lưu.

source: Verification e-mail sent.
cy: E-bost gwirio wedi'i anfon.
da: Verificerings-e-mail sendt.
de: Verifikations-E-Mail gesendet.
et: Kinnitamise e-post saadetud.
hi: सत्यापन ईमेल भेजा गया।
ja: 確認メールが送信されました。
lt: Patvirtinimo el. laiškas išsiųstas.
mi: Īmēra whakamana tukuna.
nl: Verificatie e-mail verzonden.
no: Bekreftelse e-post sendt.
ro: Email de verificare trimis.
ru: Письмо для подтверждения отправлено.
ta: சரிபார்ப்பு மின்னஞ்சல் அனுப்பப்பட்டது.
tl: Napadala na ang verification e-mail.
vi: Email xác minh đã được gửi.

source: Successfully registered.
cy: Wedi cofrestru'n llwyddiannus.
da: Registreret med succes.
de: Erfolgreich registriert.
et: Edukalt registreeritud.
hi: सफलतापूर्वक पंजीकृत।
ja: 登録が完了しました。
lt: Sėkmingai registruota.
mi: I rēhita pai.
nl: Succesvol geregistreerd.
no: Registrert med suksess.
ro: Înregistrat cu succes.
ru: Успешно зарегистрированы.
ta: வெற்றிகரமாக பதிவு செய்யப்பட்டது.
tl: Matagumpay na nakarehistro.
vi: Đăng ký thành công.

source: ok
cy: iawn
hi: ठीक है
lt: gerai
mi: pai
ru: ок
ta: சரி

source: Personal info
cy: Gwybodaeth bersonol
da: Personlige oplysninger
de: Persönliche Informationen
et: Isikuandmed
hi: व्यक्तिगत जानकारी
ja: 個人情報
lt: Asmeninė informacija
mi: Taipitopito whaiaro
nl: Persoonlijke informatie
no: Personlig informasjon
ro: Informații personale
ru: Личная информация
ta: தனிப்பட்ட தகவல்
vi: Thông tin cá nhân

source: Permissions
cy: Caniatâd
da: Tilladelser
de: Berechtigungen
et: Õigused
hi: अनुमतियां
ja: 権限
lt: Leidimai
mi: Nga whakaaetanga
nl: Machtigingen
no: Tillatelser
ro: Permisiuni
ru: Разрешения
ta: அனுமதிகள்
vi: Quyền hạn

source: Important dates
cy: Dyddiadau pwysig
da: Vigtige datoer
de: Wichtige Daten
et: Olulised kuupäevad
hi: महत्वपूर्ण तिथियां
ja: 重要な日付
lt: Svarbios datos
mi: Nga rā nui
nl: Belangrijke datums
no: Viktige datoer
ro: Date importante
ru: Важные даты
ta: முக்கிய தேதிகள்
tl: Mahahalagang petsa
vi: Ngày quan trọng
