Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.10.tar.gz/litegram-1.0.10/docs/locale/*/LC_MESSAGES/api/bot.po
Languages: ru

source: Bot
ru: Бот

source: Bot instance can be created from :code:`litegram.Bot` (:code:`from litegram import Bot`) and you can't use methods without instance of bot with configured token.
ru: Экземпляр бота может быть создан из :code:`litegram.Bot` (:code:`from litegram import Bot`). Вы не сможете использовать методы без экземпляра бота с настроенным токеном.

source: This class has aliases for all methods and named in :code:`lower_camel_case`.
ru: Этот класс имеет псевдонимы для всех методов, именованных в :code:`snake_case`.

source: For example :code:`sendMessage` named :code:`send_message` and has the same specification with all class-based methods.
ru: Например, :code:`sendMessage` называется :code:`send_message` и имеет ту же спецификацию, что и все методы на основе классов.

source: A full list of methods can be found in the appropriate section of the documentation
ru: Полный список методов можно найти в соответствующем разделе документации

source: Bot class
ru: Класс Bot

source: Parameters
ru: Параметры

source: Telegram Bot token `Obtained from @BotFather <https://t.me/BotFather>`_
ru: Токен Telegram-бота, `полученный от @BotFather <https://t.me/BotFather>`_

source: HTTP Client session (For example HttpxSession). If not specified it will be automatically created.
ru: Сессия HTTP-клиента (например, HttpxSession). Если не указана, она будет создана автоматически.

source: Default bot properties. If specified it will be propagated into the API methods at runtime.
ru: Свойства бота по умолчанию. Если указаны, они будут распространяться на методы API во время выполнения.

source: Raises
ru: Исключения

source: When token has invalid format this exception will be raised
ru: Если токен имеет неверный формат, будет выброшено это исключение

source: Get bot ID from token
ru: Получить ID бота из токена

source: Returns
ru: Возвращает

source: Generate bot context
ru: Сгенерировать контекст бота

source: close session on exit
ru: закрыть сессию при выходе

source: Cached alias for getMe method
ru: Кэшированный псевдоним для метода getMe

source: Download file by file_path to destination.
ru: Скачать файл по file_path в место назначения.

source: If you want to automatically create destination (:class:`io.BytesIO`) use default value of destination and handle result of this method.
ru: Если вы хотите автоматически создать место назначения (:class:`io.BytesIO`), используйте значение по умолчанию для destination и обработайте результат этого метода.

source: File path on Telegram server (You can get it from :obj:`litegram.types.File`)
ru: Путь к файлу на сервере Telegram (вы можете получить его из :obj:`litegram.types.File`)

source: Filename, file path or instance of :class:`io.IOBase`. For e.g. :class:`io.BytesIO`, defaults to None
ru: Имя файла, путь к файлу или экземпляр :class:`io.IOBase`. Например, :class:`io.BytesIO`, по умолчанию None

source: Total timeout in seconds, defaults to 30
ru: Общий таймаут в секундах, по умолчанию 30

source: File chunks size, defaults to 64 kb
ru: Размер фрагментов файла, по умолчанию 64 КБ

source: Go to start of file when downloading is finished. Used only for destination with :class:`typing.BinaryIO` type, defaults to True
ru: Перейти в начало файла после завершения загрузки. Используется только если destination имеет тип :class:`typing.BinaryIO`, по умолчанию True

source: Download file by file_id or Downloadable object to destination.
ru: Скачать файл по file_id или объекту Downloadable в место назначения.

source: file_id or Downloadable object
ru: file_id или объект Downloadable
