Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.9.tar.gz/litegram-1.0.9/docs/locale/*/LC_MESSAGES/utils/chat_action.po
Languages: ru

source: Chat action sender
ru: Отправитель действий в чате (Chat action sender)

source: Sender
ru: Отправитель

source: This utility helps to automatically send chat action until long actions is done to take acknowledge bot users the bot is doing something and not crashed.
ru: Эта утилита помогает автоматически отправлять действия в чат, пока выполняются длительные действия бота, чтобы уведомить пользователей о том, что бот что-то делает, а не завис.

source: Provides simply to use context manager.
ru: Предоставляет простой в использовании контекстный менеджер.

source: Technically sender start background task with infinity loop which works until action will be finished and sends the `chat action <https://core.telegram.org/bots/api#sendchataction>`_ every 5 seconds.
ru: Технически, отправитель запускает фоновую задачу с бесконечным циклом, которая работает до завершения действия и отправляет `действие чата <https://core.telegram.org/bots/api#sendchataction>`_ каждые 5 секунд.

source: Parameters
ru: Параметры

source: instance of the bot
ru: экземпляр бота, необязательный параметр

source: target chat id
ru: идентификатор целевого чата

source: chat action type
ru: тип действия

source: interval between iterations
ru: интервал между итерациями

source: Create instance of the sender with `choose_sticker` action
ru: Создание экземпляра отправителя с действием `choose_sticker`

source: Create instance of the sender with `find_location` action
ru: Создание экземпляра отправителя с действием `find_location`

source: Create instance of the sender with `record_video` action
ru: Создание экземпляра отправителя с действием `record_video`

source: Create instance of the sender with `record_video_note` action
ru: Создание экземпляра отправителя с действием `record_video_note`

source: Create instance of the sender with `record_voice` action
ru: Создание экземпляра отправителя с действием `record_voice`

source: Create instance of the sender with `typing` action
ru: Создание экземпляра отправителя с действием `typing`

source: Create instance of the sender with `upload_document` action
ru: Создание экземпляра отправителя с действием `upload_document`

source: Create instance of the sender with `upload_photo` action
ru: Создание экземпляра отправителя с действием `upload_photo`

source: Create instance of the sender with `upload_video` action
ru: Создание экземпляра отправителя с действием `upload_video`

source: Create instance of the sender with `upload_video_note` action
ru: Создание экземпляра отправителя с действием `upload_video_note`

source: Create instance of the sender with `upload_voice` action
ru: Создание экземпляра отправителя с действием `upload_voice`

source: Usage
ru: Использование

source: Helps to automatically use chat action sender for all message handlers
ru: Помогает автоматически использовать отправителя действий чата для всех обработчиков сообщений

source: Before usa should be registered for the `message` event
ru: Перед использованием следует зарегистрировать для события `message`

source: After this action all handlers which works longer than `initial_sleep` will produce the '`typing`' chat action.
ru: После этого все обработчики, работающие дольше `initial_sleep`, будут выполнять действие '`typing`' в чате

source: Also sender can be customized via flags feature for particular handler.
ru: Также отправитель может быть настроен с помощью функции флагов (flags) для конкретного обработчика.

source: Change only action type:
ru: Изменение только типа действия:

source: Change sender configuration:
ru: Изменение конфигурации отправителя:
