Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.0.tar.gz/litegram-1.0.0/docs/locale/*/LC_MESSAGES/api/defaults.po
Languages: ru

source: Global defaults
ru: Глобальные настройки

source: litegram provides mechanism to set some global defaults for all requests to Telegram Bot API in your application using :class:`litegram.client.default.DefaultBotProperties` class.
ru: litegram предоставляет механизм для установки некоторых глобальных настроек для всех запросов к Telegram Bot API в вашем приложении, используя класс :class:`litegram.client.default.DefaultBotProperties`.

source: There are some properties that can be set:
ru: Можно установить некоторые свойства:

source: Default bot properties.
ru: Синдартные свойства бота.

source: Default parse mode for messages.
ru: Синдартный режим разбора для сообщений.

source: Sends the message silently. Users will receive a notification with no sound.
ru: Отправляет сообщение без звука. Пользователи получат уведомление без звукового сигнала.

source: Protects content from copying.
ru: Защищает контент от копирования.

source: Allows to send messages without reply.
ru: Позволяет отправлять сообщения без отвеи.

source: Link preview settings.
ru: Настройки предварительного просмотра ссылок.

source: Disables link preview.
ru: Отключает предварительный просмотр ссылок.

source: Prefer small media in link preview.
ru: Предпочиить маленькие медиафайлы в предварительном просмотре ссылок.

source: Prefer large media in link preview.
ru: Предпочиить большие медиафайлы в предварительном просмотре ссылок.

source: Show link preview above text.
ru: Показывать предварительный просмотр ссылки над текстом.

source: Show caption above media.
ru: Показывать подпись над медиафайлом.

source: If you need to override default properties for some requests, you should use `litegram.client.default.DefaultBotProperties` only for properties that you want to set as defaults and pass explicit values for other properties.
ru: Если вам нужно переопределить стандартные свойства для некоторых запросов, следует использовать `litegram.client.default.DefaultBotProperties` только для свойств, которые вы хотите установить по умолчанию, и передавать явные значения для других свойств.

source: If you upgrading from litegram 3.0-3.6 to 3.7, you should update your code to use `litegram.client.default.DefaultBotProperties`.
ru: Если вы обновляетесь с версий litegram 3.0-3.6 к 3.7, вам следует обновить свой код для использования `litegram.client.default.DefaultBotProperties`.

source: Example
ru: Пример

source: Here is an example of setting default parse mode for all requests to Telegram Bot API:
ru: Вот пример установки стандартного режима разбора для всех запросов к Telegram Bot API:

source: In this case all messages sent by this bot will be parsed as HTML, so you don't need to specify `parse_mode` in every message you send.
ru: В этом случае все сообщения, отправленные этим ботом, будут разбираться как HTML, поэтому вам не нужно указывать `parse_mode` в каждом отправляемом сообщении.

source: Instead of
ru: Вместо

source: you can use
ru: вы можетте использовать

source: and the message will be sent with HTML parse mode.
ru: и сообщение будет отправлено в режиме разбора HTML.

source: In some cases you may want to override default properties for some requests. You can do it by passing explicit values to the method:
ru: В некоторых случаях вы можете захотеть переопределить стандартные свойства для некоторых запросов. Вы можете сделать это, передав явные значения в метод:

source: In this case the message will be sent with Markdown parse mode instead of default HTML.
ru: В этом случае сообщение будет отправлено в режиме Markdown вместо стандартного HTML.

source: Another example of overriding default properties:
ru: Еще один пример переопределения синдартных свойств:

source: In this case the message will be send withoout parse mode, even if default parse mode is set it may be useful if you want to send message with plain text or :ref:`litegram.types.message_entity.MessageEntity`.
ru: В этом случае сообщение будет отправлено без режима разбора, даже если установлен стандартный режим разбора. Это может быть полезно, если вы хотите отправить сообщение в виде обычного текста или :ref:`litegram.types.message_entity.MessageEntity`.
