Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.0.tar.gz/litegram-1.0.0/docs/locale/*/LC_MESSAGES/api/upload_file.po
Languages: ru

source: How to upload file?
ru: Как выгрузити файл?

source: As says `official Telegram Bot API documentation <https://core.telegram.org/bots/api#sending-files>`_ there are three ways to send files (photos, stickers, audio, media, etc.):
ru: Как утверждает `official Telegram Bot API documentation <https://core.telegram.org/bots/api#sending-files>`_ существует три способа отправить файл (фото, стикеры, аудио, медиа и т.д.):

source: If the file is already stored somewhere on the Telegram servers or file is available by the URL, you don't need to reupload it.
ru: Якщо файл уже зберигаеться десь на серверах Telegram или файл доступний за URL-адресою, вам не потрибно его повторно завантажувати.

source: :class:`litegram.types.input_file.FSInputFile` - `uploading from file system <#upload-from-file-system>`__
ru: :class:`litegram.types.input_file.FSInputFile` - `видвантажений с файловои системи <#upload-from-file-system>`__

source: :class:`litegram.types.input_file.BufferedInputFile` - `uploading from buffer <#upload-from-buffer>`__
ru: :class:`litegram.types.input_file.BufferedInputFile` - `видвантажений с буферу <#upload-from-buffer>`__

source: :class:`litegram.types.input_file.URLInputFile` - `uploading from URL <#upload-from-url>`__
ru: :class:`litegram.types.input_file.URLInputFile` - `видвантажений с URL <#upload-from-url>`__

source: Upload from file system
ru: Видваниження с файловои системи

source: By first step you will need to import InputFile wrapper:
ru: Перш за все, вам потрибно буде импортувати обгортку InputFile:

source: Then you can use it:
ru: Тепер вы можетте использовать ии:

source: Represents object for uploading files from filesystem
ru: Об’ект для выгруження файлов из файловои системи

source: Parameters
ru: Параметры

source: Path to file
ru: Путь к файлу

source: Filename to be propagated to telegram. By default, will be parsed from path
ru: Ім'я файлу, которое буде передано в telegram. За замовчуванням, буде взято зи шляху

source: Uploading chunk size
ru: Розмир фрагмени выгруження

source: Upload from buffer
ru: Видваниження с буферу

source: Import wrapper:
ru: Імпорт обгортки:

source: And then you can use it:
ru: Тепер вы можетте использовать ии:

source: Bytes
ru: Байти

source: Filename to be propagated to telegram.
ru: Ім'я файлу, которое буде передано в telegram.

source: Upload from url
ru: Видваниження с URL

source: If you need to upload a file from another server, but the direct link is bound to your server's IP, or you want to bypass native `upload limits <https://core.telegram.org/bots/api#sending-files>`_ by URL, you can use :obj:`litegram.types.input_file.URLInputFile`.
ru: Якщо вам потрибно видвантажити файл с иншого сервера, але пряме ссылку прив’язано к IP-адреси вашого сервера, или вы хотите обийти власни `обмеження на загрузка <https://core.telegram.org/bots/api#sending-files> `_ за URL-адресою, вы можете использовать :obj:`litegram.types.input_file.URLInputFile`.
