Repository: pypi-data/pypi-mirror-402
Catalog: packages/litegram/litegram-1.0.5.tar.gz/litegram-1.0.5/docs/locale/*/LC_MESSAGES/dispatcher/filters/command.po
Languages: ru

source: Command
ru: Команди

source: Usage
ru: Использование

source: Filter single variant of commands: :code:`Command("start")`
ru: Фильтр единого варианту команд: :code:`Command("start")`

source: Handle commands in public chats intended for other bots: :code:`Command("command", ignore_mention=True)`
ru: Обробка команды в публичних чатах, призначених для других ботив: :code:`Command("command", ignore_mention=True)`

source: Use :class:`litegram.types.bot_command.BotCommand` object as command reference :code:`Command(BotCommand(command="command", description="My awesome command")`
ru: Использование объекта :class:`litegram.types.bot_command.BotCommand` как ссылку на команду :code:`Command(BotCommand(command="command", description="My awesome command")`

source: Command cannot include spaces or any whitespace
ru: Команда не может мистити пробилив чи переносив рядкив

source: This filter can be helpful for handling commands from the text messages.
ru: Этот фильтр может бути корисним для обработки команд из текстовых сообщений.

source: Works only with :class:`litegram.types.message.Message` events which have the :code:`text`.
ru: Працюе только с подиями :class:`litegram.types.message.Message` , что мають :code:`text`.

source: List of commands (string or compiled regexp patterns)
ru: Перелик команд (рядки или скомпильовани шаблони регулярних виразив)

source: Parameters
ru: Параметры

source: Prefix for command. Prefix is always a single char but here you can pass all of allowed prefixes, for example: :code:`"/!"` will work with commands prefixed by :code:`"/"` or :code:`"!"`.
ru: Префикс для команды. Префикс всегда складаеться с одного символу, але здесь вы можете передати все дозволени префикси, например: :code:`"/!"` працюватиме с командами с префиксом :code:`"/"` или :code:`"!" `.

source: Ignore case (Does not work with regexp, use flags instead)
ru: Ігнорувати регистр (не працюе с регулярним виразом, вместо этого используйте маркери)

source: Ignore bot mention. By default, bot can not handle commands intended for other bots
ru: Ігнорувати згадку о бота. За замовчуванням бот не может обробляти команды, призначени для других ботив

source: Validate command object via Magic filter after all checks done
ru: Проверка объекта команды с помощью магичного фильтра после виконання всех перевирок

source: When filter is passed the :class:`litegram.filters.command.CommandObject` will be passed to the handler argument :code:`command`
ru: Коли фильтр пройдено, :class:`litegram.filters.command.CommandObject` буде передано аргументу обробника :code:`command`

source: Instance of this object is always has command and it prefix. Can be passed as keyword argument **command** to the handler
ru: Екземпляр этого объекта всегда имеет команду и ии префикс. Можна передати обробнику (handler) как аргумент ключового слова **command**

source: Command prefix
ru: Префикс команды

source: Command without prefix and mention
ru: Команда без префикса и згадки

source: Mention (if available)
ru: Згадка (за наявности)

source: Command argument
ru: Аргумент команды

source: Will be presented match result if the command is presented as regexp in filter
ru: Буде представлено результат видповидности, если команда представлена как регулярний вираз в фильтри

source: This command has mention?
ru: Ця команда згадуеться?

source: Generate original text from object
ru: Створення оригинального тексту с об'еки

source: Allowed handlers
ru: Дозволени обробники (handler)

source: Allowed update types for this filter:
ru: Дозволени типы оновлень для этого фильтра:
